{"type":"challenge_raised","timestamp":"2026-02-09T14:40:37.710087655Z","challenge_id":"ch-9741de17c3d8d764","node_id":"1.3.2","target":"statement","reason":"CASSELMAN-SHALIKA FORMULA APPLIED TO W^circ FOR ARBITRARY Pi, BUT ONLY VALID FOR UNRAMIFIED Pi. The node states: 'the Casselman-Shalika formula for W^circ on the GL_{n+1}-side gives W^circ(diag(varpi^{m_1},...,varpi^{m_{n-1}},1,1)) = 0 unless (m_1,...,m_{n-1},0) satisfies the dominance condition m_1 \u003e= m_2 \u003e= ... \u003e= m_{n-1} \u003e= 0.'\n\nThe Casselman-Shalika formula describes the torus values of the SPHERICAL (K_{n+1}-fixed) Whittaker function of an UNRAMIFIED representation. It applies ONLY when Pi is unramified.\n\nThe problem requires the construction to work for ALL generic irreducible admissible Pi of GL_{n+1}(F), including ramified ones. For ramified Pi (c(Pi) \u003e= 1), W^circ is the new vector (the K_1(p^{c(Pi)})-fixed vector), NOT the spherical vector. The Casselman-Shalika formula does NOT apply to W^circ in this case. The torus support of the new vector of a ramified representation follows different formulas (Matringe, Miyauchi), and can include non-dominant weights.\n\nSpecifically: (a) For ramified principal series Pi, the new vector W^circ can be nonzero at torus elements outside the dominant cone, including elements with some m_i \u003c 0. (b) For supercuspidal Pi, W^circ has compact support mod center, so the support is different but still not described by Casselman-Shalika. (c) Even the statement 'W^circ(diag(a,1)) = 0 unless m_1 \u003e= ... \u003e= m_n \u003e= 0' needs replacement for ramified Pi.\n\nThe node's argument for n \u003e= 2 uses Casselman-Shalika to bound the torus sum to the dominant cone {m_1 \u003e= ... \u003e= m_{n-1} \u003e= 0}, which combines with the Kirillov support to produce the collapse. Without this bound, even if the Kirillov support constrained m_i \u003c= 0, the collapse to m_i = 0 would not follow (there could be torus contributions at m_i \u003c 0 from the W^circ side).\n\nThis is the same issue as challenge ch-b23b0a145f13161b on Node 1.3.1. The node needs either (a) a replacement for Casselman-Shalika valid for all Pi, or (b) a case analysis for ramified Pi showing the torus collapse still holds.","severity":"major","raised_by":""}