{"type":"node_created","timestamp":"2026-02-09T13:24:10.088539402Z","node":{"id":"1.4.4","type":"claim","statement":"Torus Sum Reduction and Monomial Property (m_n = 0 established): With m_n = 0 from Node 1.4.3, the integral is I(s) = sum_{m_1,...,m_{n-1} in Z} W^circ(diag(varpi^{m_1},...,varpi^{m_{n-1}},1,1)) * delta_B^{-1}(a_0) * |det a_0|^{s-1/2} * J_K(m_1,...,m_{n-1},0), where a_0 = diag(varpi^{m_1},...,varpi^{m_{n-1}},1) in GL_n(F). The conductor analysis alone does NOT constrain m_1,...,m_{n-1}. However, the sum is controlled by the torus support of W^circ and V^circ via the Matringe (2013) explicit formulas and the JPSS rationality theorem. We establish that I(s) is a nonzero monomial in q^{-s} by the following argument. RATIONALITY: By JPSS (1983), I(s) = Psi(s, R(u_Q)W^circ, V^circ) is a rational function of q^{-s}, expressible as P(q^{-s}) * L(s, Pi x pi) for a polynomial P in C[q^{-s}, q^s]. POLE ANALYSIS: The L-function L(s, Pi x pi) = prod_j (1 - alpha_j q^{-s})^{-1} where the product is over pairs of Satake/Langlands parameters. For the TWISTED integral Psi(s, R(u_Q)W^circ, V^circ), we claim P(q^{-s}) * L(s, Pi x pi) has NO POLES. Proof: At any candidate pole s_0 (a zero of some (1 - alpha_j q^{-s})), the residue of I(s) at s_0 is zero because the additive twist psi^{-1}(Q g_{nn}) prevents the integral from achieving the maximal growth that produces poles in the standard (untwisted) RS integral. Precisely: the poles of L(s, Pi x pi) arise from the contribution of spherical vectors; the twist by psi^{-1}(Q g_{nn}) with val(Q) = -c(pi) \u003c 0 introduces oscillation that kills the residue at each pole. This can be verified case-by-case for the Langlands classification of pi using multiplicativity of gamma factors (Shahidi 1984) or by direct computation. ZERO ANALYSIS: I(s_0) != 0 for all s_0 in C. At s = s_0 where q^{-s_0} takes any value in C*, the torus sum (after m_n = 0 is fixed) involves the K-integral J_K at m_n = 0 which is nonzero at the identity coset (m_1 = ... = m_{n-1} = 0) by the conductor-matching argument of Node 1.5. The potential cancellation among multiple torus terms is prevented by the sign structure of W^circ (whose torus values are related to Schur polynomials or their ramified analogues). MONOMIAL CONCLUSION: A rational function of q^{-s} with no poles and no zeros on C* is a monomial c * q^{-ks} by Node 1.2. The detailed verification that I(s) has no poles splits into two subcases treated in Nodes 1.4.4.1 (supercuspidal pi) and 1.4.4.2 (non-supercuspidal ramified pi).","inference":"assumption","workflow_state":"available","epistemic_state":"pending","taint_state":"unresolved","content_hash":"f28c96d06765acf00977af5074ef3907a36249fafe837d312d16d6ae90ec91ad","created":"2026-02-09T13:24:10.088530934Z","claimed_at":"0001-01-01T00:00:00Z"}}