{"type":"node_amended","timestamp":"2026-02-09T13:50:41.230959861Z","node_id":"1.6","previous_statement":"Conclusion and Uniformity: Combining Nodes 1.1-1.5, the integral equals c(Pi,pi) q^{-k(Pi,pi) s} where c(Pi,pi) != 0 is a product of the nonzero Gauss sum (Node 1.5) and the nonzero torus value of W^circ (Node 1.3), and k(Pi,pi) is an explicit integer depending on conductor exponents. This is a nonzero monomial, hence finite and nonzero for all s (Node 1.2). The choice W = W^circ depends only on Pi (Node 1.3); for each pi, the quantities Q, u_Q, V^circ change but the Gauss sum mechanism applies universally since conductor matching is built into the definition of Q. QED.","new_statement":"Conclusion and Uniformity (QED): Fix a generic irreducible admissible representation Pi of GL_{n+1}(F). Set W = W^circ, the essential Whittaker function of Pi (Node 1.3); this choice depends only on Pi. We show that for every generic irreducible admissible pi of GL_n(F), there exists V in W(pi, psi) such that the Rankin-Selberg integral I(s) = int_{N_n \\ GL_n(F)} W(diag(g,1) u_Q) V(g) |det g|^{s-1/2} dg equals a nonzero monomial c(Pi,pi) * q^{-k(Pi,pi) s}, hence is finite and nonzero for all s in C by the algebraic characterization of Node 1.2. The proof assembles three cases by type of pi, using different mechanisms for each.\n\nCASE 1 -- Unramified pi (c(pi) = 0): Choose V = V_0 in W(pi, psi), the Whittaker function with compact Kirillov support phi_0 = char((o^x)^{n-1}) constructed in Node 1.3.1. Note: V^circ (the spherical Whittaker function) is NOT used, because the standard RS integral with both new vectors equals L(s, Pi x pi) which generically has poles (Node 1.3, Case 2). Instead, V_0 has compact Kirillov support that forces the torus sum to collapse. By Node 1.3.2: the commutation identity (Node 1.1) gives the additive twist psi^{-1}(Q g_{nn}), but since Q in o^x (because c(pi) = 0 implies q = o), the twist is trivial on o; the Kirillov support of V_0 forces all torus exponents m_i = 0; and the integral evaluates to I(s) = W^circ(I_{n+1}) * int_{K_n} V_0(k) dk. Here c(Pi,pi) = W^circ(I_{n+1}) * vol({k in K_n : (k_{1n},...,k_{n-1,n}) in (o^x)^{n-1}}), which is nonzero because W^circ(I_{n+1}) != 0 (Matringe-Miyauchi) and the volume is positive. The exponent k(Pi,pi) = 0 (the integral is a nonzero constant, independent of s). No Gauss sum or conductor matching mechanism is involved; the monomial property comes entirely from the compact support of V_0 in the Kirillov model.\n\nCASE 2 -- Ramified supercuspidal pi (c(pi) \u003e= 1, pi supercuspidal): Choose V = V^circ, the essential Whittaker function of pi (Node 1.3, Case 1). The Iwasawa unfolding (Node 1.4) applies: the commutation identity (Node 1.1) introduces the additive twist; the W^circ-factorization (Node 1.4.1) separates W^circ(diag(a,1)) from the K-integral; the conductor analysis on the k_{nn}-variable (Nodes 1.4.2, 1.4.3) forces m_n = 0 via vanishing of J_K(m) for m_n != 0; the supercuspidal compact Kirillov support of V^circ intersected with the Whittaker support of W^circ (Node 1.4.4.1) forces m_1 = ... = m_{n-1} = 0. The torus sum collapses to the single point a* = I_n. The integral evaluates to I(s) = delta_B^{-1}(I_n) * |det I_n|^{s-1/2} * W^circ(I_{n+1}) * J_K(0,...,0) = W^circ(I_{n+1}) * J_K(0,...,0), since delta_B^{-1}(I_n) = 1 and |det I_n| = 1. By Node 1.5.1, J_K(0,...,0) != 0 (nonvanishing of the conductor-level Fourier coefficient of V^circ via the twisted matrix-coefficient integral at the identity). Here c(Pi,pi) = W^circ(I_{n+1}) * J_K(0,...,0) != 0, and k(Pi,pi) = 0 (the integral is again a nonzero constant). The monomial property comes from torus collapse to the identity, not from a one-dimensional Gauss sum.\n\nCASE 3 -- Ramified non-supercuspidal pi (c(pi) \u003e= 1, pi not supercuspidal): Choose V = V^circ (or V_mod with compact Kirillov support, as in Node 1.4.4.2). The Iwasawa unfolding (Node 1.4) applies as in Case 2: conductor analysis forces m_n = 0. The torus sum is finite but may have multiple terms (Node 1.4.4.2), giving I(s) as a finite Laurent polynomial in q^{-s}. By Node 1.5.2, this Laurent polynomial is identified (up to a nonzero scalar C) with the Rankin-Selberg epsilon factor: I(s) = C * epsilon(s, Pi x pi, psi). The epsilon factor is always a nonzero monomial epsilon(s, Pi x pi, psi) = c_eps * q^{-f(Pi,pi,psi) s} with c_eps in C* and f(Pi,pi,psi) in Z (JPSS 1983, Theorem 2.7). Here c(Pi,pi) = C * c_eps != 0, and k(Pi,pi) = f(Pi,pi,psi), the Rankin-Selberg conductor exponent. This integer f(Pi,pi,psi) is determined by the local Langlands parameters: if sigma_Pi and sigma_pi are the Weil-Deligne representations corresponding to Pi and pi, then f(Pi,pi,psi) = f_Artin(sigma_Pi tensor sigma_pi) + (n^2+n) * a(psi), where f_Artin is the Artin conductor and a(psi) is the conductor exponent of psi. The monomial property in this case comes from the epsilon factor identification, not from torus collapse to a single point.\n\nEXPLICIT VALUES OF k(Pi,pi): In Cases 1 and 2, k(Pi,pi) = 0 (the integral is s-independent). In Case 3, k(Pi,pi) = f(Pi,pi,psi) as defined above. In all cases, k(Pi,pi) is a well-defined integer determined by the Langlands parameters of Pi, pi, and the conductor of psi.\n\nCOMPLETE FACTORIZATION OF c(Pi,pi): In Case 1, c(Pi,pi) = W^circ(I_{n+1}) * vol_K, a product of two positive reals. In Case 2, c(Pi,pi) = W^circ(I_{n+1}) * J_K(0,...,0), where J_K is the nonzero twisted matrix-coefficient integral from Node 1.5.1; since a* = I_n, the Iwasawa measure factors delta_B^{-1}(I_n) = 1 and |det I_n|^{-1/2} = 1 are trivially equal to 1. In Case 3, c(Pi,pi) = C * c_eps where C is the nonzero scalar from the test-vector identification (Node 1.5.2) and c_eps is the leading coefficient of the epsilon factor; the individual Iwasawa factors (delta_B^{-1}(a), q^{k/2} from |det a|^{-1/2}, W^circ-torus values, K-integrals) are all absorbed into the finite sum that constitutes the Laurent polynomial identified with C * epsilon.\n\nUNIFORMITY OF W: In all three cases, W = W^circ is the same function depending only on Pi. The choice of V depends on pi: V_0 (compact Kirillov support, Node 1.3.1) for unramified pi, V^circ (new vector) for supercuspidal ramified pi, and V^circ or V_mod for non-supercuspidal ramified pi. The mechanisms ensuring the monomial property differ by case: compact Kirillov support collapse (Case 1), supercuspidal torus support collapse with conductor-level nonvanishing (Case 2), and epsilon factor identification via test vector theory (Case 3). In each case, the result is a nonzero monomial c(Pi,pi) * q^{-k(Pi,pi) s} in q^{-s}, which by the algebraic characterization (Node 1.2) is finite and nonzero for all s in C. This establishes the claim of Node 1 for all generic irreducible admissible pi.\n\nDEPENDENCIES: This QED node derives its conclusion from the following upstream nodes. Node 1.1: commutation identity (used in all three cases to introduce/analyze the additive twist). Node 1.2: algebraic characterization of monomials (used to conclude finite + nonzero for all s from the monomial property). Node 1.3 (including 1.3.1, 1.3.2): test vector construction (W = W^circ for all cases; V = V_0 for Case 1 with monomial verification; V = V^circ for Cases 2-3). Node 1.4 (including 1.4.1-1.4.4.2): Iwasawa unfolding and conductor analysis for ramified cases (Cases 2-3). Node 1.5 (including 1.5.1, 1.5.2): nonvanishing verification for ramified cases (Case 2: K-integral nonvanishing; Case 3: epsilon factor identification). QED.","owner":"prover-1-6"}