{"type":"node_amended","timestamp":"2026-02-09T13:00:06.0183507Z","node_id":"1.3","previous_statement":"Choice of Test Vectors: Set W = W^circ (the essential Whittaker function / new vector of Pi, the unique-up-to-scalar nonzero vector fixed by K_1(p^{c(Pi)})). This depends only on Pi. For each pi, set V = V^circ (the essential Whittaker function of pi, fixed by K_1(q)). The key property W^circ(I_{n+1}) != 0 is guaranteed by the Matringe-Miyauchi characterization. The choice W = W^circ is made once and for all; only V^circ varies with pi.","new_statement":"Choice of Test Vectors: Set W = W^circ (the essential Whittaker function / new vector of Pi, the unique-up-to-scalar nonzero vector fixed by K_1(p^{c(Pi)})). This depends only on Pi. The key property W^circ(I_{n+1}) != 0 is guaranteed by the Matringe-Miyauchi characterization. The choice W = W^circ is made once and for all; only V varies with pi.\n\nFor each generic irreducible admissible pi of GL_n(F), the test vector V in W(pi, psi) is chosen by case split on the conductor exponent c(pi):\n\nCASE 1 — Ramified (c(pi) \u003e= 1): Set V = V^circ, the essential Whittaker function of pi, the unique-up-to-scalar nonzero vector in W(pi, psi) fixed by K_1(q) where q = p^{c(pi)}. This is the new vector of pi. The K_1(q)-invariance of V^circ is the property used in the conductor-matching analysis of Node 1.4.\n\nCASE 2 — Unramified (c(pi) = 0): V^circ is the spherical (K-fixed) Whittaker function. This choice is NOT used because it yields the standard Rankin-Selberg integral with new vectors, which equals L(s, Pi x pi) and generically has poles (not a monomial). Instead, choose V = V_0 defined via the Kirillov model as follows. Let K(pi, psi) denote the Kirillov model of pi, realized as a space of locally constant functions on F^x. Since pi is an unramified principal series pi = chi_1 x ... x chi_n (with each chi_i unramified), the Kirillov model K(pi, psi) contains the Schwartz space S(F^x) by the Bernstein-Zelevinsky theory (the map from the compact induction is surjective onto S(F^x) inside K(pi, psi)). Define phi_0 in S(F^x) by phi_0 = char(o^x), the characteristic function of the units o^x in F^x. Then phi_0 in K(pi, psi), and we let V_0 in W(pi, psi) be the Whittaker function corresponding to phi_0 under the isomorphism W(pi, psi) -\u003e K(pi, psi) (i.e., V_0 is the unique Whittaker function whose restriction to the mirabolic subgroup P_n, evaluated at diag(a_1,...,a_{n-1},1) with a_i in F^x, equals phi_0 when n = 1, and in general is the Whittaker function whose Kirillov restriction has support contained in a compact subset of F^{n-1} \\ {0}).\n\nFor n = 1 (GL_2 x GL_1 case): V_0(g) for g in GL_1(F) = F^x is phi_0(g) = char(o^x)(g). The RS integral becomes sum_{m in Z} W^circ(diag(varpi^m, 1)) psi^{-1}(Q varpi^m) phi_0(varpi^m) |varpi^m|^{s-1/2} delta_B^{-1}(varpi^m). Since phi_0(varpi^m) = 0 for m != 0 and phi_0(1) = 1, the sum collapses to a single term at m = 0: W^circ(I_2) psi^{-1}(Q) |1|^{s-1/2} = W^circ(I_2) psi^{-1}(Q), which is a nonzero constant (monomial with k = 0), using W^circ(I_2) != 0 from Matringe-Miyauchi.\n\nFor general n \u003e= 2: The construction of V_0 with compact Kirillov support ensuring the integral is a nonzero monomial is deferred to child nodes (Node 1.3.1 and Node 1.3.2).\n\nSummary: W = W^circ works universally. V = V^circ works for all ramified pi. For unramified pi, V = V_0 (a Whittaker function with compact Kirillov-model support) is used instead. In both cases, the integral is a nonzero monomial in q^{-s}.","owner":"prover-1-3"}