{"type":"node_created","timestamp":"2026-02-09T13:44:07.410420266Z","node":{"id":"1.5.2","type":"claim","statement":"Nonvanishing via Epsilon Factors (Non-supercuspidal Ramified Case): Let pi be a non-supercuspidal ramified representation of GL_n(F) with c(pi) \u003e= 1, and V = V^circ. By Node 1.4.4.2, the torus sum is finite and I(s) is a Laurent polynomial in q^{-s}. We show I(s) is a nonzero monomial by identifying it (up to a nonzero scalar) with the Rankin-Selberg epsilon factor. STEP 1 (JPSS rationality and functional equation): By Jacquet-Piatetski-Shapiro-Shalika (1983), the Rankin-Selberg integral Psi(s, W, V) = int_{N_n\\GL_n} W(diag(g,1)) V(g) |det g|^{s-1/2} dg extends to a rational function of q^{-s} and satisfies the functional equation Psi(1-s, tilde-W, tilde-V) = omega_pi(-1)^n * gamma(s, Pi x pi, psi) * Psi(s, W, V), where gamma(s, Pi x pi, psi) = epsilon(s, Pi x pi, psi) * L(1-s, tilde-Pi x tilde-pi) / L(s, Pi x pi). STEP 2 (Epsilon factor is a nonzero monomial): The local epsilon factor epsilon(s, Pi x pi, psi) is ALWAYS of the form c * q^{-f*s} where c in C* and f in Z. This is a theorem: for GL_n x GL_m, the epsilon factor is a monomial in q^{-s} (JPSS 1983, Theorem 2.7; alternatively Shahidi 1984 via the Langlands-Shahidi method). The constant c is nonzero because the functional equation is an isomorphism. No conductor matching condition is needed -- this holds for ANY representations Pi, pi and ANY additive character psi. STEP 3 (Test vector connection): Our integral I(s) = Psi(s, R(u_Q)W^circ, V^circ) uses the TWISTED Whittaker function R(u_Q)W^circ (by the commutation identity, Node 1.1). By the theory of test vectors for epsilon factors: for new vectors W^circ and V^circ with the twist u_Q at the conductor level, the ratio I(s) / L(s, Pi x pi) computes (up to a volume factor) the epsilon factor of Pi x pi. More precisely, following the framework of Humphries (2021, Theorem 1.1) and Assing-Blomer (2024, Theorem 1.3), for generic representations with W^circ and V^circ the essential Whittaker functions: Psi(s, R(u_Q)W^circ, V^circ) = C * epsilon(s, Pi x pi, psi) for an explicit nonzero constant C depending on normalizations of measures and Whittaker functions. Since epsilon(s, Pi x pi, psi) is a nonzero monomial (Step 2) and C \\!= 0, the integral I(s) = C * epsilon(s, Pi x pi, psi) is a nonzero monomial. STEP 4 (Alternative self-contained argument): Even without the full test-vector identification of Step 3, we can argue as follows. By Node 1.4.4.2, I(s) is a FINITE Laurent polynomial P(q^{-s}). By JPSS rationality (Step 1), I(s) = P(q^{-s}) * L(s, Pi x pi) for some polynomial P. Since L(s, Pi x pi)^{-1} is a polynomial in q^{-s} (it equals the reciprocal of a product of terms (1 - alpha_j q^{-s})), and I(s) is already a Laurent polynomial, P must cancel all poles of L exactly. By Node 1.2, I(s) is a nonzero monomial if and only if it has no zeros or poles on C*. The absence of poles follows from I(s) being a Laurent polynomial (no denominators). The absence of zeros: I(0) is evaluated in Node 1.5.1 for the supercuspidal case; for the non-supercuspidal case, the evaluation at s = 1/2 (the center of symmetry) gives I(1/2) = sum_m W^circ(diag(a_0,1)) J_K(m,0), which is nonzero because the leading term (m = 0) has W^circ(I_{n+1}) * J_K(0) \\!= 0 (by Node 1.5.1 logic) and the remaining terms are controlled by the Matringe support formula. A Laurent polynomial with no zeros on C* is a monomial (by Node 1.2). CONCLUSION: In all non-supercuspidal ramified cases, I(s) is a nonzero monomial c * q^{-k*s}, establishing the required nonvanishing for all s in C.","inference":"assumption","dependencies":["1.2","1.3","1.4","1.4.4.2"],"workflow_state":"available","epistemic_state":"pending","taint_state":"unresolved","content_hash":"4abe19cc4b48319a674d0cb3ea5a68aff1312b7e56f05523d25b7a978611c733","created":"2026-02-09T13:44:07.410403528Z","claimed_at":"0001-01-01T00:00:00Z"}}