{"type":"node_created","timestamp":"2026-02-09T13:29:42.246474832Z","node":{"id":"1.4.4.2","type":"claim","statement":"Non-supercuspidal ramified pi case: Reduction via the Langlands classification. For non-supercuspidal ramified pi with c(pi) \u003e= 1, write pi = Ind_P^{GL_n}(Delta_1 tensor ... tensor Delta_r) as its Langlands quotient (standard module), where each Delta_i is an essentially square-integrable representation of GL_{n_i}(F) with n_1 + ... + n_r = n and at least one Delta_i has c(Delta_i) \u003e= 1. The essential Whittaker function V^circ of pi is related to those of the Delta_i by the Matringe (2013) explicit formula (Theorem 5.1): V^circ(diag(a_1,...,a_r)) = product_i V^circ_{Delta_i}(a_i) (on the block-diagonal torus, up to a delta-factor correction). TORUS SUPPORT OF V^circ: By the Matringe formula, V^circ(diag(varpi^{m_1},...,varpi^{m_n})) is nonzero only when the m-vector satisfies the support conditions of EACH Delta_i on its block. For essentially square-integrable Delta_i (generalized Steinberg): Delta_i = St_{k_i}(rho_i) for a supercuspidal rho_i of GL_{d_i}(F) with k_i d_i = n_i. The Whittaker function V^circ_{Delta_i} on the GL_{n_i}-torus has support constrained by the segment structure: V^circ_{Delta_i}(diag(varpi^{m_{j_1}},...,varpi^{m_{j_{n_i}}})) = 0 unless the m-values follow the Steinberg pattern (m_{j_l} = m_{j_1} + l - 1 for the segment part, modulo the supercuspidal support of rho_i). The Steinberg pattern plus the supercuspidal compactness of rho_i constrains the torus support to a finite set. COMBINED WITH W^circ SUPPORT: W^circ(diag(varpi^{m_1},...,varpi^{m_n},1)) requires m_1 \u003e= ... \u003e= m_n = 0. Intersecting with the V^circ torus support gives a finite set of contributing m-tuples. FINITENESS OF THE SUM: The torus sum is finite (not infinite), being constrained to a bounded region of Z^{n-1}. Each term contributes c_m * q^{-|m| s} (where |m| = m_1 + ... + m_{n-1} with appropriate delta-corrections). The resulting I(s) is a FINITE Laurent polynomial in q^{-s}. MONOMIAL PROPERTY: That this finite Laurent polynomial is in fact a monomial (i.e., has exactly one nonzero term) follows from the following argument: (A) I(s) = Psi(s, R(u_Q)W^circ, V^circ) is a specific zeta integral in the JPSS family. (B) By JPSS theory, I(s) = P(q^{-s}) * L(s, Pi x pi) for some Laurent polynomial P. (C) By the functional equation for the RS integral and the characterization of new vectors, the twisted integral Psi(s, R(u_Q)W^circ, V^circ) satisfies the identity Psi(s, R(u_Q)W^circ, V^circ) * L(1-s, Pi~ x pi~)^{-1} = epsilon(s, Pi x pi, psi) * Psi(s, W^circ, V^circ) * L(1-s, Pi~ x pi~)^{-1}... [This step requires careful verification and is the subject of ongoing work. The identity is expected to hold based on the analogy with the GL_2 case where it is verified explicitly, and the general theory of test vectors for epsilon factors (cf. Humphries 2021, Assing-Blomer 2024).] ALTERNATIVE DIRECT ARGUMENT: For cases where the identity in (C) has not been fully verified in the literature, we note that the PROBLEM only requires the existence of SOME V in W(pi, psi) giving a nonzero monomial. For non-supercuspidal ramified pi, we may replace V^circ by a MODIFIED test vector V_mod with compact Kirillov support chosen to match the twist level. Specifically, V_mod is the Whittaker function corresponding to the Kirillov function phi_mod = char(C_Q) where C_Q is a compact-open subset of F^{n-1} setminus {0} chosen so that: (1) the torus sum collapses to a single term (by making supp(phi_mod) sufficiently small), and (2) the twisted K-integral at m = 0 is nonzero (by matching the additive level of psi^{-1}(Q k_{nn}) with the multiplicative structure of phi_mod). The construction of such phi_mod and the nonvanishing verification are deferred to a child node.","inference":"assumption","workflow_state":"available","epistemic_state":"pending","taint_state":"unresolved","content_hash":"4d2eb74ec4b7b7a7cfe97ca1ccc85692c6fef9fbd2196fd5b51599a20bfc8267","created":"2026-02-09T13:29:42.24646131Z","claimed_at":"0001-01-01T00:00:00Z"}}