{"type":"node_amended","timestamp":"2026-02-09T13:43:03.083252433Z","node_id":"1.5","previous_statement":"Gauss Sum Nonvanishing: The generalized Gauss sum tau(pi, psi_Q) arising in the K-integral is nonzero because the conductor of the additive character psi_Q(x) = psi(Qx) (which has conductor q since Q generates q^{-1} and psi has conductor o) exactly matches the conductor of the multiplicative character of pi. This is a classical result: for GL_1, it is Tate thesis; for GL_n, it follows from the Godement-Jacquet theory of local epsilon factors. The essential Whittaker function value W^circ(diag(a,1)) at the selected torus element is nonzero by the Matringe-Miyauchi explicit formula.","new_statement":"Nonvanishing of Surviving Terms (Ramified Case, c(pi) \u003e= 1): This node establishes that the integral I(s) from the Iwasawa unfolding (Node 1.4) is nonzero for each value of s, thereby completing the monomial argument from Node 1.2. By Node 1.4 (specifically Nodes 1.4.2 and 1.4.3), the K-integral J_K(m) vanishes unless m_n = 0. With the test vectors W = W^circ and V = V^circ chosen in Node 1.3, the integral reduces to I(s) = sum_{m_1,...,m_{n-1}} W^circ(diag(varpi^{m_1},...,varpi^{m_{n-1}},1,1)) * delta_B^{-1}(a_0) * |det a_0|^{s-1/2} * J_K(m_1,...,m_{n-1},0), where J_K(m_1,...,m_{n-1},0) = int_{K_n} psi^{-1}(Q k_{nn}) V^circ(a_0 k) dk is the matrix-coefficient integral with partial additive twist from Node 1.4.1 (NOT a Gauss sum for n \u003e= 2). CASE A (Supercuspidal pi): By Node 1.4.4.1, the torus sum collapses to the single point m_1 = ... = m_{n-1} = 0. Nonvanishing of I(s) = W^circ(I_{n+1}) * J_K(0,...,0) requires: (NV1) W^circ(I_{n+1}) \\!= 0, which holds by the Matringe-Miyauchi normalization of the essential Whittaker function (Matringe 2013, Theorem 3.1). (NV2) J_K(0,...,0) \\!= 0, proved in child Node 1.5.1 by explicit evaluation of the K-integral at the identity. CASE B (Non-supercuspidal ramified pi): By Node 1.4.4.2, the torus sum is finite. I(s) is a finite Laurent polynomial in q^{-s}. That I(s) is a nonzero monomial follows from the Rankin-Selberg epsilon factor: epsilon(s, Pi x pi, psi) is ALWAYS a nonzero monomial c * q^{-f*s} with c in C* and f in Z, by the functional equation (JPSS 1983). No conductor matching is needed for n \u003e= 2; the epsilon factor is unconditionally nonzero as a unit in C[q^s, q^{-s}]. The identification of I(s) with epsilon(s, Pi x pi, psi) (up to a nonzero constant) via the test vector theory is established in child Node 1.5.2. CORRECTIONS FROM ORIGINAL: (1) The K-integral is a matrix-coefficient integral with partial additive twist, not a Gauss sum. (2) \"Multiplicative character of pi\" is removed; pi is a representation for n \u003e= 2. (3) The torus element analysis is case-specific: supercuspidal gives one point, non-supercuspidal gives a finite sum. (4) Conductor matching is the GL_1 mechanism (Tate thesis); for n \u003e= 2, epsilon factor nonvanishing is unconditional. DEPENDENCIES: Node 1.3 (test vector choices), Node 1.4 (Iwasawa unfolding and conductor analysis).","owner":"prover-1-5"}