{"type":"challenge_raised","timestamp":"2026-02-09T16:52:28.792785722Z","challenge_id":"ch-8fe1adbc532c1809","node_id":"1.4.4.2","target":"statement","reason":"MATRINGE (2013) THEOREM 5.1 PRODUCT FORMULA IS MISSTATED -- MISSING DELTA-FACTOR AND INDUCTIVE STRUCTURE.\n\nThe node claims: 'V^circ(diag(a_1,...,a_r)) = product_i V^circ_{Delta_i}(a_i) (on the block-diagonal torus, up to a delta-factor correction).'\n\nThis is an oversimplification of what Matringe 2013, Theorem 5.1 actually states. The Matringe formula for the essential Whittaker function of a standard module pi = Ind_P^{GL_n}(Delta_1 x ... x Delta_r) involves:\n\n(1) A product of essential Whittaker functions of the segments Delta_i, BUT with specific normalizations that depend on the ordering of the segments (the Langlands ordering matters for the standard module vs. the Langlands quotient).\n\n(2) A modular character correction delta_P^{1/2} that depends on the parabolic P = M_P N_P. The full formula is: W^circ_{pi}(a) = delta_P^{1/2}(a) * product_i W^circ_{Delta_i}(a_i) (restricted to the block-diagonal torus a = diag(a_1,...,a_r) with a_i in the GL_{n_i}-torus). The delta_P^{1/2} factor is not a constant -- it depends on the m-vector through the half-sum of positive roots of the Levi.\n\n(3) The phrase 'up to a delta-factor correction' is vague and non-rigorous. The delta-factor is crucial for the support analysis: it modifies the effective exponents |m|_s in each summand of the torus sum. Getting this wrong would shift the Laurent polynomial exponents and potentially create or eliminate cancellations.\n\n(4) More critically, the Matringe formula applies to the STANDARD MODULE (Langlands induced representation), not automatically to the Langlands quotient. For generic pi, the standard module and its Langlands quotient share the same Whittaker model (by multiplicity one), so the Whittaker function is the same. But the precise statement should distinguish these and note that genericity is being used.\n\nThe node should state the formula precisely with the delta-factor, explain how it affects the torus sum exponents, and clarify the standard-module vs. Langlands-quotient distinction.","severity":"major","raised_by":""}