{"type":"challenge_raised","timestamp":"2026-02-09T16:53:40.145902926Z","challenge_id":"ch-74681215b3119b40","node_id":"1.4.4.2","target":"gap","reason":"FINITENESS ARGUMENT HAS A GAP: W^circ SUPPORT CONDITION m_1 \u003e= ... \u003e= m_n = 0 IS STATED WITHOUT JUSTIFICATION FOR RAMIFIED Pi.\n\nThe node claims: 'W^circ(diag(varpi^{m_1},...,varpi^{m_n},1)) requires m_1 \u003e= ... \u003e= m_n = 0.'\n\nThis support condition (the anti-dominant/dominant condition on the torus) is well-known for UNRAMIFIED Pi via the Casselman-Shalika formula. For GENERAL (potentially ramified) Pi on GL_{n+1}(F), the support condition is more subtle:\n\n(1) The Casselman-Shalika formula gives W^circ(a) as a Schur polynomial in the Satake parameters times delta_B^{1/2}(a) for UNRAMIFIED Pi with a in the positive Weyl chamber. This formula does not apply to ramified Pi.\n\n(2) For ramified Pi, the torus support of W^circ is governed by the asymptotic expansion of Whittaker functions (Casselman 1980, Jacquet-Shalika 1981). The result is that W^circ(diag(varpi^{m_1},...,varpi^{m_{n+1}})) = 0 unless the m-vector lies in a certain cone. The precise shape of this cone depends on the representation type.\n\n(3) The node cites 'Matringe 2013 Theorem 3.1 for general Pi' for this support condition. This reference should be verified: does Matringe 2013 Theorem 3.1 indeed give the stated support condition m_1 \u003e= m_2 \u003e= ... \u003e= m_n \u003e= 0 for the essential Whittaker function of a general generic Pi on GL_{n+1}? The support condition from the asymptotic expansion typically gives that W(a) is supported on the dominant cone (when the Whittaker function is normalized appropriately), but the essential Whittaker function has a specific normalization that may affect the support.\n\n(4) More fundamentally, the node uses this support condition for W^circ on the GL_{n+1}-side and combines it with the V^circ support on the GL_n-side. But W^circ is the new vector of Pi (the GL_{n+1}-representation), and the problem statement says Pi can be ANY generic irreducible admissible representation. The node does not address whether Pi is ramified or unramified, and the support conditions may differ.\n\nThe finiteness claim is likely correct (it follows from general principles about torus support of Whittaker functions), but the specific support formula m_1 \u003e= ... \u003e= m_n = 0 needs a precise reference that covers the ramified case.","severity":"major","raised_by":""}