{"type":"challenge_raised","timestamp":"2026-02-09T16:58:06.597728275Z","challenge_id":"ch-78d666e92ed81a3e","node_id":"1.4.4.1","target":"statement","reason":"THE W^circ DOMINANCE CONDITION m_1 \u003e= m_2 \u003e= ... \u003e= m_n \u003e= 0 IS STATED WITHOUT ADEQUATE JUSTIFICATION FOR RAMIFIED Pi.\n\nThe node claims: 'For generic Pi on GL_{n+1}(F), the essential Whittaker function W^circ satisfies W^circ(diag(varpi^{m_1},...,varpi^{m_n},1)) = 0 unless m_1 \u003e= m_2 \u003e= ... \u003e= m_n = 0. This is the standard antidominance/support condition for Whittaker functions (it holds for all generic Pi, ramified or unramified, by the asymptotic expansion of Whittaker functions along the torus; cf. Casselman-Shalika for unramified Pi, Matringe 2013 Theorem 3.1 for general Pi).'\n\nPROBLEMS:\n\n(1) CASSELMAN-SHALIKA IS FOR UNRAMIFIED Pi ONLY. The Casselman-Shalika formula gives the spherical Whittaker function W^sph(diag(varpi^{m_1},...,varpi^{m_{n+1}})) in terms of Schur polynomials, with support on the dominant cone. This applies ONLY to unramified Pi with unramified Whittaker function. It does NOT apply to the essential vector W^circ of ramified Pi.\n\n(2) THE ASYMPTOTIC EXPANSION GIVES A DIFFERENT (WEAKER) RESULT. The Casselman asymptotic expansion of Whittaker functions (Casselman 1980, Matringe derivatives approach) expresses the Whittaker function along the torus as a sum of exponentials weighted by Jacquet module characters. For the ESSENTIAL vector W^circ, this gives that W^circ(diag(varpi^{m_1},...,varpi^{m_{n+1}})) is asymptotically 0 when some m_i - m_{i+1} -\u003e -infinity. But the exact vanishing condition for FINITE m_i is more subtle and depends on the specific representation.\n\n(3) MATRINGE 2013 THEOREM 3.1 GIVES THE CORRECT ANSWER BUT THE NODE MISQUOTES IT. Matringe's Theorem 3.1 gives the essential Whittaker function in SIMPLE ROOT COORDINATES z_j = a_j/a_{j+1}. The condition is z_j in o (for j \u003c= r) and z_j in o^x (for j \u003e r), where r is related to the unramified part of Pi. Translating z_j in o to standard coordinates gives m_j \u003e= m_{j+1}, i.e., dominance. So the dominance condition IS correct. However, the node should CITE Matringe Theorem 3.1 PRECISELY rather than hand-waving about asymptotic expansions and lumping it with Casselman-Shalika.\n\n(4) DIRECTION OF INEQUALITY: There is a CONVENTION ISSUE. In some references, the 'dominant' cone is m_1 \u003e= m_2 \u003e= ... \u003e= m_n, while in others it is m_1 \u003c= m_2 \u003c= ... \u003c= m_n (antidominant). The node says m_1 \u003e= m_2 \u003e= ... \u003e= m_n \u003e= 0, which corresponds to DOMINANT. Matringe uses simple root coordinates z_j = a_j/a_{j+1} with z_j in o meaning val(z_j) \u003e= 0, i.e., val(a_j) \u003e= val(a_{j+1}), i.e., m_j \u003e= m_{j+1}. But the SIGN CONVENTION for Matringe depends on whether he parametrizes A_{n-1} or A_n, and on his normalization. The node should verify the convention matches.\n\nWhile the dominance condition is likely correct, the justification is imprecise and conflates different results for unramified and ramified cases.","severity":"major","raised_by":""}