{"type":"node_created","timestamp":"2026-02-08T12:28:10.463432465Z","node":{"id":"1.5.2.3","type":"claim","statement":"PART C — CUMULANT EXPRESSION FOR PHI_N AND LIMITATIONS. Since e_k and kappa_k^{(n)} are related by an invertible polynomial transformation (the partition lattice Mobius inversion), Phi_n can be expressed as a RATIONAL function of the cumulants: Phi_n = N_n(kappa_2,...,kappa_n) / D_n(kappa_2,...,kappa_n), where D_n is related to the discriminant. For n=2 (centered): Phi_2 = 1/kappa_2 (the reciprocal of the second cumulant, exactly analogous to Fisher information = 1/variance in classical probability). For n=3 (centered): Phi_3 = (9/2) * kappa_2^2 / (kappa_2^3 - kappa_3^2/3). CRITICAL LIMITATION: For n \u003e= 3, Phi_n is NOT a polynomial function of the cumulants. The discriminant disc(p) = D_n(e_2,...,e_n) in the denominator has NO simple additive structure under cumulant addition. Specifically, if kappa_k(r) = kappa_k(p) + kappa_k(q), then disc(r) is a complicated polynomial in all of kappa_k(p) AND kappa_k(q) jointly, not decomposable into disc(p) and disc(q) separately. This means the additivity of cumulants alone does NOT directly yield the superadditivity of 1/Phi_n. The naive hope that Phi_n might be a convex function of the cumulant vector (which would immediately give superadditivity from linearity) FAILS because Phi_n is rational, not polynomial. CONCLUSION: The cumulant framework precisely defines additive quantities for MSS convolution and expresses Phi_n as a rational function thereof, but a DIFFERENT technique (such as the derivative recursion from node 1.4) is needed to establish superadditivity. The cumulant approach characterizes the constraint space but does not directly yield the inequality.","inference":"assumption","workflow_state":"available","epistemic_state":"pending","taint_state":"unresolved","content_hash":"8df175061071467ac7281d501fef7ae5ebd9357149d546f3787df3e390149ac1","created":"2026-02-08T12:28:10.463427851Z","claimed_at":"0001-01-01T00:00:00Z"}}