{"type":"challenge_raised","timestamp":"2026-02-08T20:05:10.942120632Z","challenge_id":"ch-140af1a4336cc22e","node_id":"1.6.2.7","target":"gap","reason":"The claim that BG (2020) concentration extends to Lipschitz functionals of the enhanced Phi^4_3 data (phi, :phi^2:, :phi^3:) on the product Besov space X is UNSUBSTANTIATED. Specific errors:\n\n(1) The BG (2020) paper (arXiv:1805.10814) constructs the Phi^4_3 measure via the Boue-Dupuis variational formula and proves sub-Gaussian tails for the FIELD phi, specifically for ||phi||_{C^{-1/2-delta}}. The paper does NOT construct the enhanced data (:phi^2:, :phi^3:) and does NOT prove concentration for functionals of the enhanced data.\n\n(2) The claim that 'the BG construction represents the enhanced data under mu as (phi, :phi^2:, :phi^3:) = Psi(X, u*)' is false. The BG construction gives phi = X + integral_0^1 u_s ds, where X is the GFF and u* is the variational optimizer. The Wick powers :phi^2:, :phi^3: are NOT produced by this construction. They are built through a SEPARATE renormalization procedure (regularity structures / paracontrolled distributions) applied to the REGULARIZED field phi_eps, with subsequent limit extraction. The lift map Psi from phi to (phi, :phi^2:, :phi^3:) is not Lipschitz and involves subtracting divergent renormalization constants.\n\n(3) The LSI claim: 'The LSI for Phi^4_3 on T^3 is established by combining (i) the BG variational representation, (ii) the Polchinski RG flow analysis which gives uniform spectral gap/LSI for the finite-dimensional approximations, and (iii) passage to the continuum limit.' An LSI for mu on the BASE field space (functionals of phi with gradients in L^2) does NOT imply sub-Gaussian concentration for functionals of the ENHANCED data. The Malliavin gradient of F_k(phi, :phi^2:, :phi^3:) = \u003cf, :phi^k:\u003e with respect to the underlying Gaussian structure involves distributional derivatives of Wick powers, which are NOT uniformly bounded. Specifically, the Malliavin derivative of \u003cf, :phi^2:\u003e in direction h is 2\u003cf, :phi: h\u003e which depends on phi and is unbounded. The Herbst argument (LSI =\u003e sub-Gaussian for bounded-gradient functionals) fails here for exactly the same reason identified in the archived node 1.6.2.2, Step 3.\n\n(4) Even if one could establish concentration for the enhanced data, the relevant concentration constant would need to be computed explicitly. The node asserts universal constants C, c \u003e 0 but provides no mechanism to determine them.\n\nCONSEQUENCE: Since node 1.6.2.7 is the sole justification for exponential integrability of \u003cf, :phi^k:\u003e for k=2,3 in node 1.6.2.8, the failure of this node collapses the entire repaired proof for k=2,3.","severity":"critical","raised_by":""}