{"type":"node_created","timestamp":"2026-02-08T21:48:06.589365286Z","node":{"id":"1.6.2.10.2.3.3","type":"claim","statement":"SEVENTH REPAIR -- Step 3: Uniform upper bound on Z_eps^{(alpha)} via Boue-Dupuis and BG (2020) a priori estimates.\n\nCLAIM: Z_eps^{(alpha)} = E_{mu_0}[exp(-V_eps^{(alpha)}(phi))] \u003c= exp(C_+) uniformly in eps, where C_+ = C_+(alpha, f, k, lambda, m^2) is a finite constant independent of eps.\n\nPROOF:\n\n====== STEP 1: BOUE-DUPUIS VARIATIONAL FORMULA ======\n\nBy the Boue-Dupuis variational formula (Boue-Dupuis 1998; Ustunel 2014; used as the starting point of Barashkov-Gubinelli 2020, specifically their Theorem 2.1):\n\n  -log Z_eps^{(alpha)} = inf_{u adapted} H_eps^{(alpha)}(u)\n\nwhere\n\n  H_eps^{(alpha)}(u) := E[ V_eps^{(alpha)}(X + I_u) + (1/2) int_0^1 ||u_s||_{L^2(T^3)}^2 ds ]\n\nHere X is the Gaussian free field with covariance C = (-Delta + m^2)^{-1} on T^3, the infimum is over all progressively measurable (adapted) processes u in L^2([0,1]; L^2(T^3)), and I_u := int_0^t u_s ds is the Bochner integral of the drift (this is an ordinary Bochner integral of an adapted process, NOT a stochastic integral in the Ito sense; the randomness enters through the adaptedness of u to the filtration generated by X, not through stochastic integration).\n\nTo prove Z_eps^{(alpha)} \u003c= exp(C_+), it suffices to show:\n\n  inf_{u adapted} H_eps^{(alpha)}(u) \u003e= -C_+    ...(*)\n\ni.e., that H_eps^{(alpha)}(u) is bounded below by a constant independent of eps and u.\n\nIMPORTANT NOTE ON ADAPTED DRIFTS: The drift h = I_u is NOT deterministic -- it depends on the driving noise of X. One CANNOT naively take expectations to reduce V_eps^{(alpha)}(X + I_u) to a deterministic functional of h. The Wick shift formula :(X + h)_eps^n:_{C_eps} = sum_{j=0}^n (n choose j) :X_eps^j:_{C_eps} h_eps^{n-j} is valid, but when h = I_u is adapted and hence random, one CANNOT conclude that E[:X_eps^j: h_eps^{n-j}] = 0 for j \u003e= 1, because :X_eps^j: and h_eps^{n-j} are correlated. The BG (2020) argument handles adapted drifts correctly through their a priori estimates, as we describe below.\n\n====== STEP 2: STRUCTURAL INPUT FROM NODE 1.6.2.10.2.2.1 ======\n\nBy the validated node 1.6.2.10.2.2.1, the tilted potential V_eps^{(alpha)} is a Wick polynomial of the form:\n\n  V_eps^{(alpha)}(phi) = sum_{j=0}^{4} int_{T^3} g_j(x) :phi_eps^j:_{C_eps}(x) dx\n\nsatisfying:\n\n  (P1) QUARTIC POSITIVITY: g_4 = lambda \u003e 0, unchanged by the perturbation.\n  (P2) SMOOTH COEFFICIENTS: All g_j are in C^inf(T^3) with norms bounded independently of eps.\n  (P3) MASS COUNTERTERM: The mass counterterm delta_m_eps^2 structure is preserved; the divergent part is determined by the one-loop diagram involving only the quartic coupling and C_eps(0), both unchanged.\n  (P4/SUB) QUARTIC SUBORDINATION: For any h in L^4(T^3),\n    lambda int h^4 dx - |alpha| int |f| |h|^k dx \u003e= c(lambda,k) int h^4 dx - K(alpha,f,k,lambda)\n  where c \u003e 0 and K is finite, independent of eps. The cubic coupling has RELEVANT engineering dimension +3/2 in d=3; this is handled by Young inequality, NOT by RG irrelevance.\n  (P5) SPATIAL INHOMOGENEITY: The x-dependent lower-order couplings are compatible with the BG framework.\n\n====== STEP 3: HOW BG (2020) ESTABLISHES UNIFORM PARTITION FUNCTION BOUNDS ======\n\nWe now describe the BG (2020) methodology ACCURATELY and explain why it applies to V_eps^{(alpha)}.\n\nBG (2020) prove their Theorem 1.1 -- construction of the Phi^4_3 measure and uniform bounds on the partition function -- via the following strategy:\n\n(3a) THE BOUE-DUPUIS VARIATIONAL PROBLEM: BG start from the variational formula of Step 1 and need to show that H_eps(u) = E[V_eps(X + I_u) + (1/2)||u||^2] is bounded below uniformly in eps and u. This is a SINGLE variational problem over adapted drifts, NOT a scale-by-scale factored optimization.\n\n(3b) A PRIORI ESTIMATES ON STOCHASTIC OBJECTS (BG 2020, Section 3): The key technical content is the establishment of UNIFORM BOUNDS on the regularized stochastic objects that appear when one expands V_eps(X + I_u) using the Wick shift formula. Using paracontrolled calculus (in the spirit of Gubinelli-Imkeller-Perkowski 2015), BG control the singular products and renormalized quantities. Their Section 3 establishes that the stochastic objects\n\n  :X_eps^j:_{C_eps} for j = 1,2,3 and the resonant products (paraproducts)\n\nsatisfy moment bounds that are UNIFORM in the regularization parameter eps. CRUCIALLY: these bounds depend on the covariance structure of the Gaussian free field X (i.e., on mu_0 and the regularization kernel) but NOT on the specific form of the interaction potential V_eps. The a priori estimates are properties of the GAUSSIAN FREE FIELD, not of the interaction.\n\n(3c) LOWER BOUND ON THE VARIATIONAL FUNCTIONAL: With the stochastic objects controlled uniformly (3b), BG show that for any adapted drift u with finite energy E[int ||u_s||^2 ds] \u003c infinity:\n\n  H_eps(u) \u003e= (positive contribution from quartic coercivity of V_eps) + (drift penalty) - (controlled error terms) - C\n\nThe quartic coercivity of V_eps (the lambda int :phi_eps^4: dx term) ensures that the positive contribution grows as a power of the field strength, dominating the error terms from the stochastic objects. The drift penalty (1/2) int ||u_s||^2 ds penalizes large drifts. The constant C is independent of eps.\n\nThe conclusion is:\n\n  inf_{u adapted} H_eps(u) \u003e= -C    uniformly in eps.    ...(BG-bound)\n\nThis is the content of BG (2020), Theorem 1.1: the uniform partition function bounds established en route to the measure construction.\n\n(3d) GAMMA-CONVERGENCE (BG 2020, Section 4): For the construction of the LIMITING measure as eps -\u003e 0, BG use Gamma-convergence of the variational functionals H_eps. This concerns the eps -\u003e 0 limit and is NOT needed for the uniform-in-eps bound (*). We mention it only for completeness and do NOT rely on it.\n\n====== STEP 4: APPLICATION TO V_eps^{(alpha)} ======\n\nWe argue that the BG methodology applies to V_eps^{(alpha)} and yields the uniform bound (*).\n\n(4a) A PRIORI ESTIMATES ARE UNCHANGED: The paracontrolled a priori estimates of BG Section 3 depend on the Gaussian measure mu_0, the covariance C = (-Delta + m^2)^{-1}, and the regularization kernel. Since V_eps^{(alpha)} uses the SAME Gaussian free field X with the SAME covariance C_eps and the SAME Wick ordering as V_eps, all the stochastic object bounds from BG Section 3 apply IDENTICALLY. The perturbation -alpha \u003cf, :phi_eps^k:\u003e modifies the potential but does NOT alter the Gaussian measure or its covariance. Therefore, the paracontrolled estimates on :X_eps^j:, the resonant products, and their moments are completely unchanged.\n\n(4b) QUARTIC COERCIVITY IS PRESERVED: The lower bound on H_eps^{(alpha)}(u) requires that the quartic term in V_eps^{(alpha)} provides sufficient coercivity. By (P1), g_4 = lambda \u003e 0, IDENTICAL to that of V_eps. The perturbation has Wick degree k \u003c= 3 \u003c 4 and does not touch the quartic coupling.\n\n(4c) THE PERTURBATION IS ABSORBED BY QUARTIC SUBORDINATION: The only new ingredient in V_eps^{(alpha)} compared to V_eps is -alpha int f(x) :phi_eps^k: dx. Within the BG lower bound argument, this introduces additional terms of Wick degree k \u003c= 3 with spatially varying but smooth, bounded, eps-independent coefficients.\n\nThe BG lower bound on H_eps(u) already handles ALL lower-order terms (Wick degree \u003c= 3) that arise from the Wick expansion of V_eps(X + I_u). The mechanism is: (i) the quartic term lambda int :phi_eps^4: dx provides coercivity; (ii) each lower-order term is bounded (in expectation, using the a priori estimates from 3b) by a small fraction of the quartic contribution plus a finite constant (this is where Young inequality enters); (iii) the mass counterterm cancels the divergent C_eps(0) contributions.\n\nThe perturbation -alpha int f(x) :phi_eps^k: dx adds terms that are STRUCTURALLY IDENTICAL to the lower-order terms already present in V_eps. Specifically:\n\n  - The new terms have Wick degree \u003c= 3 (same as existing lower-order terms).\n  - The coefficients are smooth and bounded independently of eps (by P2).\n  - The quartic subordination (P4/SUB from 1.6.2.10.2.2.1) ensures that these new terms are dominated by the quartic coercivity: the perturbation consumes at most a fraction of the quartic contribution, leaving enough coercivity for the rest of the argument.\n  - The mass counterterm delta_m_eps^2 is the SAME, because the divergent part (proportional to lambda * C_eps(0)) depends only on the quartic coupling and C_eps(0), both unchanged by the perturbation. The bounded, eps-independent shift from the perturbation is absorbed into the O(1) constants.\n\nTherefore, the BG Theorem 1.1 argument, applied with V_eps^{(alpha)} in place of V_eps, yields:\n\n  inf_{u adapted} H_eps^{(alpha)}(u) \u003e= -C_+(alpha, f, k, lambda, m^2)    ...(BG-bound-alpha)\n\nwhere C_+ depends on alpha, f, k (through the perturbation coefficients) and on lambda, m^2 (through the original potential), but is INDEPENDENT of eps.\n\n====== STEP 5: CONCLUSION ======\n\nFrom (*) and (BG-bound-alpha):\n\n  -log Z_eps^{(alpha)} = inf_{u adapted} H_eps^{(alpha)}(u) \u003e= -C_+(alpha, f, k, lambda, m^2)\n\nTherefore:\n\n  Z_eps^{(alpha)} \u003c= exp(C_+(alpha, f, k, lambda, m^2)) =: C_1(alpha, f, k)    ...(UPPER)\n\nwhere C_1 is FINITE and INDEPENDENT of eps. This completes the proof.\n\n====== RESOLUTION OF ALL PREVIOUS REFUTATION ISSUES ======\n\n(R1) ADAPTED DRIFT: We do NOT treat h = I_u as deterministic and do NOT claim E[:X_eps^j: h_eps^{n-j}] = 0 for adapted drifts. The BG argument handles adapted drifts through the a priori estimates on stochastic objects (Section 3), which provide uniform moment bounds for ALL adapted drifts with bounded energy.\n\n(R2) CUBIC COUPLING: We do NOT claim the cubic is RG-irrelevant. The cubic coupling has RELEVANT engineering dimension +3/2 in d=3. We invoke QUARTIC SUBORDINATION (P4/SUB from node 1.6.2.10.2.2.1) via Young inequality.\n\n(R3) ACCURATE DESCRIPTION OF BG METHODOLOGY: We describe the BG approach ACCURATELY: (a) Boue-Dupuis variational formula (Theorem 2.1); (b) a priori estimates on stochastic objects via paracontrolled calculus (Section 3); (c) uniform lower bound on the variational functional using quartic coercivity (Theorem 1.1); (d) Gamma-convergence for the eps -\u003e 0 limit (Section 4, not needed for the uniform bound). We do NOT describe a fictitious scale-by-scale running-coupling Polchinski flow with factored scale-by-scale optimizations.\n\n(R4) CORRECT CITATIONS: We cite BG (2020) Theorem 1.1 (main result: construction and uniform bounds), Theorem 2.1 (Boue-Dupuis formula), and Section 3 (a priori estimates). Section 4 concerns Gamma-convergence, mentioned only for context. We do NOT cite non-existent Propositions 4.1 or 4.3.\n\n(R5) DEPENDENCY: This node formally depends on 1.6.2.10.2.2.1 for (P1)-(P5) and (SUB).\n\n(R6) TERMINOLOGY: I_u = int_0^1 u_s ds is correctly identified as a Bochner integral of an adapted process, NOT a stochastic integral.\n\nREFERENCES: Barashkov-Gubinelli (2020) [Duke Math. J. 169(17), 3339-3415], Theorem 1.1, Theorem 2.1, Section 3; Boue-Dupuis (1998) [Ann. Probab. 26(4), 1641-1659]; Ustunel (2014); Gubinelli-Imkeller-Perkowski (2015) [Forum Math. Pi 3, e6]; node 1.6.2.10.2.2.1 (structural verification: P1-P5, SUB).","inference":"assumption","dependencies":["1.6.2.10.2.2.1"],"workflow_state":"available","epistemic_state":"pending","taint_state":"unresolved","content_hash":"3106f68f3fc59663bcf5ed298010bc0a1470cb505a6ef13a5b8a548ce7c99da9","created":"2026-02-08T21:48:06.589349957Z","claimed_at":"0001-01-01T00:00:00Z"}}