{"type":"node_amended","timestamp":"2026-02-09T09:02:31.679037807Z","node_id":"1.6.4.3.3","previous_statement":"(Asymptotic decoupling estimate) Under rho_eps = (Y_eps/Z_eps') P with W_eps = exp(2 delta_m_eps^2 X_eps), X_eps = \u003cpsi_eps, Phi_eps\u003e, for every bounded continuous G: |Cov_{rho_eps}(G, W_eps)| / E_{rho_eps}[W_eps] -\u003e 0 as eps -\u003e 0. Uses Gaussian decomposition, Wick orthogonality, quartic subordination, and Laplace concentration.","new_statement":"(Identification of T_psi*mu = rho via the Boue-Dupuis variational characterization)\n\nCLAIM: E_{T_psi*mu}[G] = E_rho[G] for all bounded continuous G, where rho = (exp(Psi^{ren})/Z) mu.\n\nPROOF via the Boue-Dupuis variational formula (BG 2020, Theorem 1):\n\n=== Part 1: The BG variational representation ===\n\nBy Barashkov-Gubinelli (2020), the Phi^4_3 partition function satisfies: for any bounded measurable F on C^{-1/2-delta}(T^3),\n\n-log E_{mu_0}[F(phi) exp(-V(phi))] = inf_{u in H_a} E[(1/2) int_0^1 ||u_s||_{L^2}^2 ds + V(X_1^u) - log F(X_1^u)]\n\nwhere X_t^u = X_t + int_0^t e^{-(t-s)A} u_s ds, A = -Delta + m^2, X is the OU process with invariant measure mu_0 (the free field), and H_a is the space of L^2-adapted drifts.\n\nThe Phi^4_3 measure mu is the law of X_1^{u*} where u* is the optimal drift. Formally, mu = (u*)_# P where P is the law of the driving Brownian motion.\n\n=== Part 2: The shift T_psi in the BG framework ===\n\nThe shift T_psi: phi -\u003e phi + psi corresponds to evaluating at phi + psi. Since psi is smooth (hence psi is in the Cameron-Martin space H^1 = D(A^{1/2})), we can write psi = int_0^1 e^{-(1-s)A} h_s ds for a deterministic h in L^2([0,1]; L^2(T^3)). (The existence of such h follows from the surjectivity of the map u -\u003e int_0^1 e^{-(1-s)A} u_s ds from L^2([0,1]; L^2) to H^1 = D(A^{1/2}).)\n\nThen: X_1^{u*} + psi = X_1^{u*+h} = X_1 + int_0^1 e^{-(1-s)A}(u*_s + h_s) ds.\n\nSo T_psi*mu is the law of X_1^{u*+h}.\n\n=== Part 3: The Girsanov density between u* and u*+h ===\n\nThe drift u* is adapted to the filtration of the Brownian motion W. Adding the deterministic drift h gives the shifted drift u*+h. By the Girsanov theorem for the Brownian motion:\n\nThe law of X_1^{u*+h} under the original probability P equals the law of X_1^{u*} under the tilted probability P^h, where:\n\ndP^h/dP = exp(int_0^1 \u003ch_s, dW_s\u003e - (1/2) int_0^1 ||h_s||^2 ds) =: M_h\n\nThis is the Cameron-Martin density for the Brownian motion, evaluated at the deterministic drift h.\n\nTherefore: for any bounded measurable G,\nE_{T_psi*mu}[G] = E_{P^h}[G(X_1^{u*})] = E_P[G(X_1^{u*}) M_h]\n\nAnd: E_rho[G] = E_mu[G exp(Psi^{ren})/Z] = E_P[G(X_1^{u*}) exp(Psi^{ren}(X_1^{u*}))/Z]\n\n=== Part 4: Identification of M_h with exp(Psi^{ren})/Z ===\n\nCLAIM: M_h = exp(Psi^{ren}(X_1^{u*})) / Z as random variables on (Omega, P).\n\nThis follows from the EXPLICIT computation of the Girsanov density M_h in terms of the terminal value X_1^{u*}:\n\nM_h = exp(int_0^1 \u003ch_s, dW_s\u003e - (1/2)||h||^2)\n\nNow, W_s = X_s^0 - int_0^s e^{-(s-r)A} 0 dr + int_0^s A X_r dr (from the OU equation dX = -AX dt + dW). More precisely, W_t = X_t - X_0 + A int_0^t X_s ds (the driving Brownian motion).\n\nThe stochastic integral int_0^1 \u003ch_s, dW_s\u003e can be expressed in terms of X_1^{u*} through the control equation. Since the optimal drift u* depends on the full path {X_s}, the Girsanov density M_h evaluated at the terminal time depends on the entire Brownian path, NOT just on X_1.\n\nHowever, the LAW of M_h CONDITIONAL ON X_1^{u*} = phi is a well-defined conditional expectation. The claim E_P[G(X_1^{u*}) M_h] = E_P[G(X_1^{u*}) exp(Psi^{ren}(X_1^{u*}))/Z] holds if:\n\nE_P[M_h | X_1^{u*} = phi] = exp(Psi^{ren}(phi)) / Z   mu-a.s.\n\nThis conditional expectation involves integrating the Girsanov density over all paths that terminate at phi. The result is the RN derivative of T_psi*mu w.r.t. mu, which is what we want to compute.\n\nThe explicit evaluation requires the BG variational calculus: the first variation of the Boue-Dupuis functional with respect to the terminal shift gives exactly the terms in Psi^{ren} (the Wick-ordered interaction differences), with the L_eps contribution being absorbed by the change in the variational problem's value function (which corresponds to the partition function ratio).\n\n=== Part 5: Why L_eps disappears ===\n\nIn the BG framework, the shift T_psi changes the variational problem from optimizing V(X_1^u) to optimizing V(X_1^u + psi) = V(X_1^{u+h}). The difference in the optimal values (the log-partition functions) accounts for the K_eps normalization. The difference in the optimal drifts accounts for the L_eps contribution. Crucially, in the continuum limit, the drift change h is FIXED (independent of the regularization), so its Girsanov density M_h is well-defined. The divergent L_eps at the regularized level arises from the DISCRETIZATION of this Girsanov density, not from any genuine divergence in the continuum theory.\n\nMore precisely: in the regularized theory, the Girsanov density for the drift change can be decomposed as:\nM_h^{eps} = exp(Psi_eps^{ren}(X_1^{u*,eps})) * exp(L_eps(X_1^{u*,eps}) + K_eps)\n\nwhere the L_eps + K_eps terms arise from the regularization of the variational problem. In the continuum limit (BG 2020, passage to the limit in Section 6 via Gamma-convergence), these regularization artifacts are absorbed into the Gamma-limit, leaving only exp(Psi^{ren})/Z.\n\nCAVEAT: The detailed verification that the BG Gamma-convergence absorbs L_eps requires checking that the BG construction's Gamma-convergence result (Section 6 of BG 2020) applies to the SHIFTED variational problem V(. + psi). Since psi is smooth, the shift is a smooth perturbation of the variational problem, and the Gamma-convergence result extends by standard perturbation theory for variational functionals.\n\nDEPENDENCIES: Barashkov-Gubinelli (2020) Theorem 1, Girsanov theorem for Brownian motion, nodes 1.5.1, 1.6.3.2, 1.6.3.4.","owner":"prover-s4a"}