{"type":"node_amended","timestamp":"2026-02-08T10:23:23.07571788Z","node_id":"1.6.2","previous_statement":"PART (a) — INJECTIVITY OF SIGMA. By hypothesis (node 1.5), omega_1 : C^+ -\u003e C^+ is a Herglotz function, hence (when extended to R by continuity) it is monotone increasing on each connected component of R minus {poles of omega_1}. Suppose sigma(k) = sigma(ell) = j for k != ell, so omega_1(nu_k) = omega_1(nu_ell) = lambda_j. Since lambda_j is a root of p (hence a regular value — not a pole — of omega_1), both nu_k and nu_ell lie in regular intervals of omega_1. A Herglotz function restricted to a single monotone interval is strictly monotone, hence injective. Even if nu_k, nu_ell lie in different monotone intervals, the degree of omega_1 as a rational map (which equals n-1 from the construction in node 1.5) constrains the total number of real preimages. Since omega_1 maps n distinct real points {nu_1,...,nu_n} into {lambda_1,...,lambda_n} (which also has n elements), injectivity of sigma follows from a counting argument: omega_1 has at most n-1 poles on R (from the Herglotz representation), dividing R into at most n intervals, on each of which omega_1 is monotone. Each lambda_j can be hit at most once per interval, giving at most n preimages total for all lambda_j combined. Since we need exactly n preimages (one per nu_k), each lambda_j is hit exactly once.","new_statement":"PART (a) — INJECTIVITY OF SIGMA. We prove sigma is injective (and in fact order-preserving) by showing omega_1 has no real poles, hence is globally strictly increasing on R.\n\nSTEP 1 (Pole-matching principle). By the subordination identity G_p(omega_1(z)) = G_r(z) (node 1.5(a)), the poles of G_p(omega_1(z)) and G_r(z) as rational functions of z must coincide. The poles of G_r(z) = (1/n) r'(z)/r(z) are precisely the n simple roots {nu_1, ..., nu_n} of r. On the other side, G_p(omega_1(z)) = (1/n) p'(omega_1(z)) / p(omega_1(z)) has a simple pole at z_0 if and only if p(omega_1(z_0)) = 0 (i.e., omega_1(z_0) is a root of p) and omega_1 is regular at z_0. [At a pole q of omega_1, omega_1(z) -\u003e infinity, so G_p(omega_1(z)) -\u003e G_p(infinity) = 0, giving a zero, not a pole.] Therefore:\n\n  omega_1^{-1}({lambda_1, ..., lambda_n}) cap (R \\ {poles of omega_1}) = {nu_1, ..., nu_n}.\n\nIn other words: every real number z_0 (not a pole of omega_1) satisfying omega_1(z_0) = lambda_j for some j must be a root of r.\n\nSTEP 2 (omega_1 has no real poles). From the Herglotz property (node 1.5(b)), omega_1 has a representation omega_1(x) = x + B + sum_{i=1}^m c_i/(p_i - x) with c_i \u003e 0 and real poles p_1 \u003c ... \u003c p_m. This gives omega_1'(x) = 1 + sum c_i/(p_i - x)^2 \u003e 0 on R \\ {p_1,...,p_m}, so omega_1 is strictly increasing on each of the m+1 intervals of R \\ {p_1,...,p_m}. On each such interval, omega_1 is continuous and ranges over all of R (from -infinity to +infinity), so each value lambda_j in R is achieved exactly once per interval. The total number of distinct real preimages of the n values {lambda_1,...,lambda_n} across all m+1 intervals is therefore n(m+1). (These are distinct because: preimages in different intervals are in disjoint sets, and within a single interval, strict monotonicity ensures distinct lambda_j values have distinct preimages.) By Step 1, all n(m+1) of these preimage points lie in {nu_1,...,nu_n}, which has cardinality n. Hence n(m+1) \u003c= n, giving m+1 \u003c= 1, so m = 0.\n\nSTEP 3 (Global monotonicity implies injectivity). Since m = 0, omega_1 has no poles on R and is strictly increasing on all of R. For any k \u003c l (so nu_k \u003c nu_l), strict monotonicity gives omega_1(nu_k) \u003c omega_1(nu_l), i.e., lambda_{sigma(k)} \u003c lambda_{sigma(l)}, hence sigma(k) \u003c sigma(l). In particular, sigma is injective (and in fact strictly order-preserving).\n\nBy identical reasoning applied to omega_2 and G_q (replacing p by q and sigma by tau), tau is also injective and order-preserving.","owner":"prover-inject"}