{"type":"node_amended","timestamp":"2026-02-08T10:17:41.308018389Z","node_id":"1.5.4","previous_statement":"RATIONALITY (omega_1 extends to a rational function on hat(C)). The function omega_1(z) is defined implicitly by the polynomial equation F(z, w) := r'(z) p(w) - p'(w) r(z) = 0, where F is a polynomial of degree n in w with coefficients that are rational functions of z (in fact polynomials in z of degree at most n). By Step 1.5.2 and Step 1.5.3, we have selected a single-valued holomorphic branch omega_1: C^+ -\u003e C^+ from the algebraic curve {(z,w) : F(z,w) = 0}. CLAIM: omega_1 extends to a rational function on hat(C). PROOF SKETCH: omega_1 is holomorphic on C^+ and continuous up to R (away from finitely many points). By the Schwarz reflection principle, omega_1 extends to a meromorphic function on C (since it maps C^+ to C^+ and R to R generically, reflection across R gives the extension to C^-). As a meromorphic function on hat(C) that satisfies an algebraic equation of degree n, omega_1 is algebraic. An algebraic function on hat(C) that is single-valued (i.e., defines a section of the algebraic curve) must be rational. GAP: The extension from C^+ to all of hat(C) requires showing: (1) omega_1 extends continuously to R away from finitely many points (plausible from the implicit function theorem applied to F(z,w) = 0 at real points where F_w != 0), (2) the Schwarz reflection principle applies (requires knowing omega_1 maps R to R, which follows from the real-coefficient structure of F and the selection of the branch), (3) the resulting meromorphic function on hat(C) is single-valued (this is where we use that omega_1 is already defined as a single-valued function on C^+, and the reflection gives a single-valued extension). STATUS: This step is PLAUSIBLE but has minor gaps in the details of boundary regularity and the reflection argument. The key mathematical content (that a single-valued holomorphic branch of an algebraic function on a simply connected domain extends to a rational function) is a standard result in complex analysis.","new_statement":"ALGEBRAIC STRUCTURE OF SUBORDINATION FUNCTIONS. The function omega_1(z) is defined implicitly by the polynomial equation F(z, w) := r'(z) p(w) - p'(w) r(z) = 0, where F is a polynomial of degree n in w with coefficients that are polynomials in z of degree at most n. By Step 1.5.2 and Step 1.5.3, we have selected a single-valued holomorphic branch omega_1: C^+ -\u003e C^+ from the algebraic curve {(z,w) : F(z,w) = 0}.\n\nCORRECTED CLAIM: omega_1 is an ALGEBRAIC function of degree n over C(z), NOT a rational function. Specifically:\n\n(A) ALGEBRAIC EQUATION: omega_1 satisfies F(z, omega_1(z)) = 0 where F(z,w) is a polynomial of degree n in w. For each z in C^+, the equation F(z,w) = 0 has n solutions in w (counted with multiplicity). By Step 1.5.2, exactly one of these n solutions lies in C^+.\n\n(B) HOLOMORPHICITY ON C^+: By the implicit function theorem, omega_1 is holomorphic at any z_0 in C^+ where F_w(z_0, omega_1(z_0)) != 0 (i.e., where the selected root is simple as a root of w -\u003e F(z_0,w)). At the finitely many z_0 where F_w = 0, omega_1 remains continuous (since it is constrained to stay in C^+ by the Herglotz property, it cannot jump to a C^- branch) and hence holomorphic by Riemann's removable singularity theorem. Thus omega_1 is holomorphic on all of C^+.\n\n(C) NON-RATIONALITY FOR n \u003e= 2: The claim in the previous version that omega_1 extends to a rational function on hat(C) is FALSE. Explicit computation at n=2 shows omega_1(z) involves a square root of a degree-4 polynomial in z, making it algebraic of degree 2 (with two branches). More generally, for degree-n polynomials p,r, omega_1 is algebraic of degree n over C(z), and the algebraic curve F(z,w) = 0 generically has genus \u003e 0 for n \u003e= 3, so omega_1 cannot be rational.\n\n(D) BOUNDARY BEHAVIOR: omega_1 extends analytically through R \\ S, where S is a finite set (the z-values where the discriminant of F(z,w) with respect to w vanishes). On R \\ S, omega_1 takes real values (since F has real coefficients and the branches are locally separated). At points of S, omega_1 may have algebraic branch points.\n\n(E) HERGLOTZ PROPERTY PRESERVED: Despite being algebraic rather than rational, omega_1 still satisfies Im(omega_1(z)) \u003e 0 when Im(z) \u003e 0 (the Herglotz/Nevanlinna property), as established in Step 1.5.3. This is the essential property needed for the chain rule (node 1.6).\n\n(F) CONSEQUENCE FOR DOWNSTREAM NODES: Since omega_1 is NOT rational, the partial-fraction Herglotz representation omega_1(z) = z + c + sum_j m_j/(z - p_j) (which applies only to rational Herglotz functions) is INVALID. The correct representation is the Herglotz integral representation omega_1(z) = a + bz + integral_R [1/(t-z) - t/(1+t^2)] dmu(t) with b \u003e= 0 and mu a positive measure. However, for the algebraic omega_1, the measure mu may have continuous density (not just atoms), fundamentally changing the structure of the curvature corrections alpha_k = omega_1''(nu_k)/2.\n\nSTATUS: This corrects a fundamental error in the previous version. The key properties needed downstream (holomorphicity on C^+, Herglotz property, subordination identity G_r = G_p . omega_1) all hold for the algebraic omega_1. The rationality claim was used in node 1.7.3 constraint (ii) and must be corrected there as well.","owner":"prover-alg"}