{"type":"node_amended","timestamp":"2026-02-08T10:24:43.36150568Z","node_id":"1.5.2","previous_statement":"SELECTION PRINCIPLE VIA ARGUMENT PRINCIPLE (Exactly one preimage in C^+). For c in C^-, the equation G_p(w) = c has exactly n solutions counted with multiplicity (since G_p is a degree-n rational map). We claim exactly one solution lies in C^+. PROOF ATTEMPT: Consider nG_p(w) - nc on C^+. The function nG_p(w) = sum_{i=1}^n 1/(w - lambda_i) maps C^+ to C^- (since Im(1/(w - lambda_i)) \u003c 0 when Im(w) \u003e 0 and lambda_i in R). On the real axis R, nG_p has simple poles at lambda_1 \u003c ... \u003c lambda_n. On each interval (lambda_i, lambda_{i+1}), nG_p decreases continuously from +infty to -infty (since nG_p'(x) = -sum 1/(x-lambda_i)^2 \u003c 0). On (-infty, lambda_1), nG_p decreases from 0 to -infty. On (lambda_n, +infty), nG_p decreases from +infty to 0. So nG_p maps the real line (with poles) onto R, crossing any value c in R exactly n-1 times (once in each of the n-1 bounded intervals). For c in C^- (with Im(c) \u003c 0), by a continuity/homotopy argument, the number of solutions in C^+ should be 1. ARGUMENT PRINCIPLE DETAILS: Integrate (nG_p)'(w)/(nG_p(w) - nc) over the boundary of the upper half-disk D_R = {w : |w| \u003c R, Im(w) \u003e 0} for R large. On the semicircular arc, nG_p(w) ~ n/w -\u003e 0, so the integrand contributes negligibly. On the real segment [-R, R], nG_p(w) is real (away from poles), and nc has negative imaginary part, so nG_p(w) - nc never vanishes on R. The winding number equals (1/2pi i) times this integral. GAP: The precise computation of this winding number requires tracking how the image curve nG_p([-R,R]) winds around the point nc. Since nG_p maps R to R (with poles going to +/-infty), the image curve lies on the real axis, and nc is off the real axis, so the winding number counts the number of times the real-axis image crosses the real part Re(nc) in a specific direction. The n-1 crossings (one per bounded interval) each contribute, but the winding number for a point OFF the image curve depends on the topology. Since nc is in C^- (below the real line), and the image curve is ON the real line, the winding number around nc equals (1/2) times the net crossing count, which by the behavior at the poles gives (n-1)/2... this does NOT give an integer. STATUS: THIS STEP HAS A GENUINE GAP. The naive argument principle on the half-plane is delicate because the boundary is non-compact and the function has poles on the boundary. A more careful approach: use the principle that a proper holomorphic map f: C^+ -\u003e C^- of degree d has exactly d preimages (with multiplicity) for every point in C^-. The map nG_p: C^+ -\u003e C^- is proper and holomorphic; its degree as a map C^+ -\u003e C^- must be determined. By examining the boundary behavior (n-1 intervals where nG_p sweeps R, plus behavior at infinity), the degree of nG_p|_{C^+} as a proper map to C^- equals 1. This would give exactly one preimage. But proving this degree-1 claim rigorously requires either: (A) an explicit computation showing nG_p is a bijection C^+ -\u003e C^- (FALSE for n \u003e= 2, since nG_p has critical points in C^+), or (B) showing the degree is 1 despite critical points. ALTERNATIVE: nG_p: C^+ -\u003e C^- is NOT degree 1 as a map to C^-; rather G_p maps C^+ to C^- with degree 1 when counted correctly. Actually by a result of Duren (or by direct verification), the function G_p restricted to C^+ is univalent (injective) on C^+ if and only if n = 1. For n \u003e= 2, G_p|_{C^+} is NOT injective. REVISED APPROACH: The correct count uses the fact that nG_p = p'/p is a logarithmic derivative. The equation p'(w)/p(w) = nc, i.e., p'(w) - nc p(w) = 0, is a polynomial of degree n in w. For c in C^- (Im(c) \u003c 0), all n roots of this polynomial lie in C^- union R union C^+. The number in C^+ equals 1. This can be proved by Gauss-Lucas applied to p'(w) - nc p(w) = -nc[p(w) - p'(w)/(nc)], but this is circular. The correct argument uses the fact that f(w) = p'(w) - nc p(w) is a polynomial of degree n, and by examining its behavior on R: f(lambda_i) = p'(lambda_i) (since p(lambda_i) = 0), and the signs of p'(lambda_i) alternate (since roots are simple and interlace with critical points). So f has at least n-1 real roots (one between each consecutive pair of lambda_i). Since f has degree n, it has exactly n roots total, so at most 1 non-real root. Since non-real roots come in conjugate pairs, there are either 0 or 2 non-real roots, but we can have at most 1, so there are 0 non-real roots... WAIT: this proves all roots are REAL, which contradicts having a root in C^+. RE-EXAMINATION: Actually f(w) = p'(w) - nc p(w) where c in C^- means nc has nonzero imaginary part. So f is NOT a real polynomial — it has complex coefficients. The sign-change argument does not apply. STATUS: GENUINE GAP REMAINS. The argument principle approach is the right framework but the details of counting preimages in C^+ specifically are subtle for this non-compact domain with poles on the boundary.","new_statement":"SELECTION PRINCIPLE (All n preimages in C^+). For p in P_n (monic, degree n, simple real roots lambda_1 \u003c ... \u003c lambda_n) and c in C^- (lower half-plane), the equation G_p(w) = c has exactly n solutions (counted with multiplicity) and ALL n solutions lie in C^+. In particular, at least one solution lies in C^+, which is what is needed for the construction of the subordination function omega_1 in node 1.5.3. PROOF: Define f(w) := p'(w) - nc p(w), a polynomial of degree n whose roots are exactly the solutions of G_p(w) = c (away from the roots of p, which are verified to not be roots of f). We show: (A) f has no real roots, and (B) f has no roots in C^-. Hence all n roots lie in C^+. Part (A): For real w, decompose f(w) = f_R(w) + i f_I(w) where f_R(w) = p'(w) - Re(nc) p(w) and f_I(w) = -Im(nc) p(w). A real root requires f_I(w) = 0, i.e., -Im(nc) p(w) = 0. Since Im(nc) = n Im(c) \u003c 0 (hence -Im(nc) \u003e 0), this forces p(w) = 0, i.e., w = lambda_i. But f(lambda_i) = p'(lambda_i) \\!= 0 (since p has simple roots). Contradiction. So f has no real roots. Part (B): Suppose w_0 in C^- satisfies f(w_0) = 0. Then p'(w_0) = nc p(w_0), and since p(w_0) \\!= 0 (roots of p are real), we get p'(w_0)/p(w_0) = nc, i.e., nG_p(w_0) = nc. But for w_0 in C^- (Im(w_0) \u003c 0), Im(nG_p(w_0)) = Im(sum 1/(w_0 - lambda_i)) = sum -Im(w_0)/|w_0 - lambda_i|^2 = sum |Im(w_0)|/|w_0 - lambda_i|^2 \u003e 0, so nG_p(w_0) is in C^+. This contradicts nc in C^- (since Im(nc) = n Im(c) \u003c 0). So f has no roots in C^-. Combining (A) and (B): all n roots of f lie in C^+. QED. NOTE: The original claim stated 'exactly one solution lies in C^+', which is FALSE for n \u003e= 2. A counterexample: p(w) = w(w-1), c = -i/2. Then f(w) = iw^2 + (2-i)w - 1 has roots w = (1 +/- i(2 +/- sqrt(3)))/2, both with positive imaginary part. The correct result -- ALL n solutions lie in C^+ -- is both stronger and easier to prove.","owner":"prover-select"}