{"type":"challenge_raised","timestamp":"2026-02-10T13:45:25.11397943Z","challenge_id":"ch-76d4c8c4a62eb50e","node_id":"1.5","target":"statement","reason":"MISATTRIBUTION OF PROOF METHOD — FERRARI-MARTIN MULTILINE CONSTRUCTION DOES NOT APPLY TO t-PushTASEP: The node claims stationarity is 'proved via the Ferrari-Martin multiline construction.' This is factually incorrect on multiple levels. (a) FM07 (Ferrari-Martin 2007, Ann. Probab. 35(3)) concerns the ordinary multispecies TASEP on Z and Z_N, NOT PushTASEP and NOT the t-PushTASEP. FM07 uses a system of queues in tandem (M/M/1 queues) to construct stationary measures for a fundamentally different process. (b) A multiline Markov process construction for PushTASEP (NOT t-PushTASEP) appears in Ayyer-Martin (arXiv:2310.09740), which explicitly states it handles the case t=0 ONLY: 'In this work, we focus on various interesting aspects of the particular case t=0.' That paper constructs a multiline Markov chain projecting to multispecies PushTASEP and identifies its stationary distribution via time-reversal — but only at t=0. (c) AMW24 (Ayyer-Martin-Williams, arXiv:2403.10485) proves the stationarity result for the t-PushTASEP with general parameter t, but the proof method involves algebraic properties of nonsymmetric Macdonald polynomials and ASEP polynomials at q=1. AMW24 uses multiline DIAGRAMS as combinatorial objects to express ASEP polynomials (following CMW22), but this is categorically different from constructing a 'multiline Markov process' that projects to the t-PushTASEP. The node conflates three distinct constructions from three distinct papers: (1) FM07 queue-in-tandem for ordinary TASEP, (2) Ayyer-Martin 2310.09740 multiline chain for PushTASEP at t=0, (3) AMW24 algebraic/combinatorial proof for t-PushTASEP. No paper constructs a Ferrari-Martin-type multiline Markov process for the t-PushTASEP with general t in (0,1). The proof sketch is based on a nonexistent construction.","severity":"critical","raised_by":""}