{"type":"node_amended","timestamp":"2026-02-10T14:36:58.689914932Z","node_id":"1.7","previous_statement":"NONTRIVIALITY: The t-PushTASEP rates are local functions of adjacent particle species and site parameters (1/x_i, t). They are NOT described using the F*_mu polynomials, which are global symmetric-function objects. The chain is nontrivial in the required sense.","new_statement":"NONTRIVIALITY OF THE t-PushTASEP. DOMAIN. Throughout, lambda = (lambda_1 \u003e ... \u003e lambda_n \u003e= 0) is a restricted partition with distinct parts, n \u003e= 3, x_i \u003e 0 for all i, and t in (0,1). DEFINITION OF NONTRIVIALITY. The problem statement requires a Markov chain whose transition probabilities are 'not described using the polynomials F*_mu(x_1,...,x_n; q, t).' We formalize this as follows. Define the TRIVIAL CHAIN on S_n(lambda) to be the Markov chain with transition matrix P^{triv}(mu, nu) := pi(nu) = F*_nu(x; q=1, t) / P*_lambda(x; q=1, t) for all mu, nu in S_n(lambda). This is the unique Markov chain on S_n(lambda) whose transition probabilities are given by evaluations of the ratio F*_nu / P*_lambda — i.e., every row of its transition matrix is the vector (pi(nu))_{nu}. The trivial chain's transition probabilities are literally 'described using F*_mu': for each pair (mu, nu), we have P^{triv}(mu, nu) = F*_nu(x; 1, t) / P*_lambda(x; 1, t). We say the t-PushTASEP is NONTRIVIAL if its transition matrix P^{tP} is not equal to P^{triv}, i.e., there exist mu, nu in S_n(lambda) such that P^{tP}(mu, nu) \\!= P^{triv}(mu, nu). (This is the natural mathematical content of 'nontrivial': the chain is not the trivial i.i.d. sampler that ignores its current state and draws the next state from pi.) NOTE ON INTERPRETATION. The definition above captures interpretation (D) from the challenges: the chain is not the rank-1 matrix with identical rows pi. We do NOT claim the stronger statement that no algebraic expression relates P^{tP}(mu, nu) to the F*_mu family — indeed, the Hecke algebra framework (Demazure-Lusztig operators T_i) connects both the chain's generator and the polynomials F*_mu through the same algebraic structure, so the chain is algebraically related to the F*_mu. The problem asks for nontriviality in the sense that the chain is a genuinely interesting dynamical object, not a trivial restatement of the stationary distribution. CLAIM. The t-PushTASEP transition matrix P^{tP} is nontrivial: P^{tP} \\!= P^{triv}. PROOF (sparsity argument). Step 1: Structure of P^{triv}. The trivial chain has P^{triv}(mu, nu) = pi(nu) \u003e 0 for all mu, nu in S_n(lambda) (since all stationary weights are strictly positive by AMW24 Thm 1.1 for x_i \u003e 0, t in (0,1)). In particular, P^{triv}(mu, nu) \u003e 0 for ALL pairs (mu, nu), so the transition matrix P^{triv} is a STRICTLY POSITIVE matrix (all n\\! x n\\! entries are positive). Step 2: Sparsity of P^{tP}. Consider the discrete-time transition matrix P^{tP} of the t-PushTASEP obtained by uniformization (embed the continuous-time chain in a Poisson process with total rate R = sum_i 1/x_i; at each jump, site i is selected with probability (1/x_i)/R, and the t-PushTASEP transition at site i is applied). In a single transition of the t-PushTASEP, when a clock rings at site i, the activated species at site i initiates a pushing cascade. The cascade is a sequence of displacements: each displaced particle moves to the position of the next weaker particle it encounters (with the geometric/t-dependent distribution), and the newly displaced particle continues until a vacancy absorbs. Crucially, in a SINGLE transition step, only particles involved in the cascade change positions. All particles NOT in the cascade path remain at their sites. For n \u003e= 3, there exist pairs (mu, nu) in S_n(lambda) x S_n(lambda) that differ in MORE positions than any single cascade can affect. Specifically, consider two configurations mu and nu that differ in the positions of TWO DISJOINT PAIRS of species, where no single cascade originating from any one site can rearrange both pairs simultaneously. For concreteness, let n = 3 with lambda = (3, 2, 0). Then S_3(lambda) consists of the 6 permutations of (3, 2, 0). Consider mu = (3, 2, 0) and nu = (2, 0, 3). To go from mu to nu in a single step, we would need species 3 to move from site 1 to site 3, species 2 to move from site 2 to site 1, AND species 0 (vacancy) to move from site 3 to site 2. But a single clock event activates exactly one site. If site 1's clock rings: species 3 at site 1 scans clockwise for a weaker species, finds species 2 at site 2 or species 0 at site 3. It displaces one of them (with the t-dependent geometric distribution). The cascade involves species 3 pushing one weaker species, which then may push another. The resulting configuration after the cascade is a cyclic shift of at most the species in the cascade path, but it can only produce configurations reachable by the specific cascade originating at site 1. Similarly for sites 2 and 3. Let us verify explicitly. From mu = (3, 2, 0): (a) Clock at site 1 (species 3): scans clockwise, finds species 2 at site 2 (weaker). With prob (1-t)/(1-t^2) = 1/(1+t), displaces species 2 at site 2; species 2 then scans from site 2 clockwise, finds species 0 at site 3, displaces it (deterministic since 0 is the only target). Result: (3, 0, 2) -- wait, no: species 3 MOVES to site 2 and species 2 moves to site 3, vacancy moves to site 1? No. Let us be precise. When species 3 at site 1 displaces species 2 at site 2: species 3 goes to site 2, species 2 becomes activated AT site 2. Activated species 2 scans clockwise from site 2: site 3 has species 0 (weaker). Species 2 displaces species 0: species 2 goes to site 3, vacancy goes to site 2? No. The CASCADE mechanics: when species b at site j is displaced by species a, species a takes site j, and species b is now activated and scans clockwise from site j for a weaker species. Let me re-do: Initial mu = (3, 2, 0) at sites (1, 2, 3). Clock rings at site 1. Species 3 at site 1 scans clockwise: site 2 has species 2 (weaker), site 3 has species 0 (weaker). Geometric distribution with parameter t over these two targets: species 3 goes to site 2 with prob 1/(1+t), goes to site 3 with prob t/(1+t). Case (i): species 3 displaces species 2 at site 2. Now species 3 is at site 2, species 2 is activated at site 2 and scans clockwise: site 3 has species 0 (weaker). Species 2 displaces vacancy at site 3. Species 0 is activated but 0 is a vacancy, cascade terminates. Result: site 1 has vacancy (0), site 2 has species 3, site 3 has species 2. Configuration: (0, 3, 2). Case (ii): species 3 bypasses species 2, displaces species 0 at site 3. Species 3 goes to site 3, vacancy at site 3 is displaced = cascade terminates. Result: site 1 has vacancy, site 2 has species 2, site 3 has species 3. Configuration: (0, 2, 3). So from site 1 clock: mu = (3,2,0) can go to (0,3,2) with prob (1/x_1)/R * 1/(1+t) or (0,2,3) with prob (1/x_1)/R * t/(1+t). Clock at site 2 (species 2): scans clockwise from site 2, site 3 has species 0 (weaker, and only target). Species 2 displaces vacancy. Result: (3, 0, 2). Prob: (1/x_2)/R * 1 (deterministic, only one weaker target). Clock at site 3 (species 0 = vacancy): nothing happens. P^{tP}(mu, mu) += (1/x_3)/R. So from mu = (3, 2, 0), the reachable configurations in one step are: (3, 2, 0) itself (prob (1/x_3)/R, vacancy clock), (0, 3, 2) (prob (1/x_1)/(R(1+t))), (0, 2, 3) (prob (1/x_1)*t/(R(1+t))), (3, 0, 2) (prob (1/x_2)/R). The configuration nu = (2, 0, 3) is NOT reachable from mu = (3, 2, 0) in a single step. Therefore P^{tP}((3,2,0), (2,0,3)) = 0. Step 3: Conclusion. We have P^{tP}((3,2,0), (2,0,3)) = 0, but P^{triv}((3,2,0), (2,0,3)) = pi((2,0,3)) = F*_{(2,0,3)}(x;1,t) / P*_lambda(x;1,t) \u003e 0. Therefore P^{tP} \\!= P^{triv}, proving the t-PushTASEP is nontrivial. REMARK ON THE RELATIONSHIP BETWEEN THE CHAIN AND F*_mu. The t-PushTASEP's stationary distribution IS described by F*_mu / P*_lambda (Nodes 1.5, 1.6). The chain's algebraic structure is connected to the Hecke algebra operators T_i that also define the F*_mu. What is NOT true is that the chain is the trivial i.i.d. sampler from pi. The t-PushTASEP is a genuine dynamical system: its transition matrix depends on the current state (the cascade mechanism is state-dependent), it has sparse transition structure (many zero entries for n \u003e= 3), and it mixes over time to the stationary distribution F*_mu/P*_lambda. This is precisely the content of 'nontrivial' as required by the problem. DEPENDENCIES. This node depends on: Node 1.1 (definition of S_n(lambda) and particle system identification), Node 1.2 (definition of F*_mu as nonsymmetric interpolation ASEP polynomials), Node 1.4 (definition of the t-PushTASEP dynamics, including the pushing cascade mechanism), Node 1.5 (AMW24 Thm 1.1: strict positivity of stationary weights F_mu(x;1,t) for the t-PushTASEP). INFERENCE TYPE. This is a deduction: from the explicit t-PushTASEP dynamics (Node 1.4) and the positivity of the trivial chain's entries (Node 1.5), we deduce P^{tP} \\!= P^{triv} by exhibiting a zero entry in P^{tP} at a position where P^{triv} is positive.","owner":"prover-s3-1.7"}