{"type":"node_amended","timestamp":"2026-02-10T14:31:13.938707239Z","node_id":"1.5","previous_statement":"STATIONARITY VIA MULTILINE PROCESS: The stationary distribution of the t-PushTASEP is proportional to f_mu(x;q=1,t). This is proved via the Ferrari-Martin multiline construction: a Markov process on arrays of configurations that projects to the t-PushTASEP on the bottom row and has product-form stationary distribution. The marginal on the bottom row gives weights f_mu(x;q=1,t).","new_statement":"STATIONARITY OF THE t-PushTASEP VIA AMW24.\n\nNOTATION. Following BDW25 (arXiv:2510.02587) and AMW24 (arXiv:2403.10485): AMW24 uses F_eta(x;q,t) (uppercase F, no asterisk) for the ASEP polynomials, which are polynomials in x_1,...,x_n with coefficients that are rational functions of q and t (AMW24 Definition 3.9, following CdGW15/CdGW20/CMW22). BDW25 uses f_mu(x;q,t) (lowercase f, no asterisk) for the homogeneous ASEP polynomial, defined as the top-degree homogeneous component of the interpolation ASEP polynomial f*_mu (BDW25 Theorem 2.3). These are the SAME object: AMW24's F_eta = BDW25's f_mu (both denote the ASEP polynomial of CMW22, a permuted-basement Macdonald polynomial). The notation difference is cosmetic. We write F_eta (AMW24 notation) when citing AMW24 and f_mu (BDW25 notation) when connecting to the interpolation framework. P_lambda(x;q,t) denotes the Macdonald symmetric polynomial associated to partition lambda.\n\nCLAIM (AMW24, Theorem 1.1). Consider the inhomogeneous multispecies t-PushTASEP on a ring with n sites, content lambda = (lambda_1 \u003e= ... \u003e= lambda_n \u003e= 0) with at least one vacancy (lambda_n = 0 or equivalently m_0 \u003e= 1), site parameters x_1,...,x_n \u003e 0, and pushing parameter t in [0,1). For each composition eta in S_n(lambda), the stationary probability of configuration eta is:\n\n  pi_lambda(eta) = F_eta(x_1,...,x_n; 1, t) / P_lambda(x_1,...,x_n; 1, t)\n\nwhere F_eta(x;q,t) is the ASEP polynomial (AMW24 Definition 3.9) and P_lambda(x;q,t) is the Macdonald polynomial, both evaluated at q=1.\n\nDOMAIN. (i) x_1,...,x_n \u003e 0 (so jump rates 1/x_i are well-defined and positive). (ii) t in [0,1): at t=0 the chain reduces to the PushTASEP (AM23, arXiv:2310.09740); for t in (0,1) the chain has the full t-PushTASEP displacement mechanism; at t=1 displacement never occurs and every state is absorbing, so the chain is reducible and the theorem does not apply. (iii) lambda must have at least one vacancy (m_0 \u003e= 1). No restriction to distinct parts is needed for this theorem; AMW24 Theorem 1.1 holds for general partitions.\n\nWELL-DEFINEDNESS OF THE DENOMINATOR. P_lambda(x;1,t) \u003e 0 for x_i \u003e 0, t in [0,1), since P_lambda(x;1,t) = sum_{eta in S_n(lambda)} F_eta(x;1,t) and each summand F_eta(x;1,t) is a stationary weight, hence nonneg, with at least one being strictly positive (the chain has at least one state). In fact AMW24's proof shows all F_eta(x;1,t) \u003e 0 for x_i \u003e 0 (since the chain is irreducible and the stationary distribution has full support).\n\nIRREDUCIBILITY AND UNIQUENESS. AMW24 asserts irreducibility of the t-PushTASEP (Proposition 2.4 proof states \"Since the t-PushTASEP is irreducible\"). For t in (0,1) and x_i \u003e 0, irreducibility holds because: any transition that occurs in the PushTASEP (t=0) also occurs with positive probability in the t-PushTASEP (since the rejection probability t \u003c 1 means each weaker particle is reached with probability t^{k-1}/[m]_t \u003e 0). The PushTASEP at t=0 is irreducible on S_n(lambda) when m_0 \u003e= 1 (any configuration can reach any other via a sequence of push transitions). Therefore the t-PushTASEP inherits irreducibility for t in [0,1). By the Perron-Frobenius theorem for irreducible continuous-time Markov chains on finite state spaces, the stationary distribution is unique. This justifies the use of the definite article \"the stationary distribution.\" Node 1.4 provides the formal chain definition.\n\nWHY q=1. The ASEP polynomials F_eta(x;q,t) are defined for general q,t via multiline queue weights (CMW22, arXiv:1811.01024). The parameter q in the general ASEP encodes the left/right hopping asymmetry: particles hop right with rate 1 and left with rate q. The t-PushTASEP is totally asymmetric (particles move clockwise only), which corresponds to the q=1 specialization of the ASEP where left and right rates coincide. More precisely, AMW24 Section 4 establishes that at q=1, nonsymmetric Macdonald polynomials E_eta(x;q,t) develop special properties (Proposition 4.1, Corollary 4.6) that enable the stationarity proof — in particular, certain ratios become symmetric (Proposition 4.3). These q=1 properties are essential to the AMW24 proof and do not hold for general q.\n\nPROOF METHOD (AMW24, Section 6). The AMW24 proof is ALGEBRAIC and COMBINATORIAL — it does NOT use a Ferrari-Martin-type multiline Markov process. The proof proceeds in two stages:\n\n(A) Distinct parts case (Section 6.1): When lambda has distinct parts and no part equal to 1, AMW24 uses multiline DIAGRAMS (combinatorial objects from CMW22, not Markov processes) together with properties of nonsymmetric Macdonald polynomials at q=1. The key steps are: (i) Lemma 6.1 shows row 1 and row 2 of a random multiline diagram (weighted by wt(D)) have the same distribution, using Corollary 4.6 (a q=1 property). (ii) Lemma 5.4 connects the transition probability p_j(eta, eta') of the t-PushTASEP to the operation of moving from row 2 to row 1 in a multiline diagram. (iii) Combining: the common distribution of rows 1 and 2 is a stationary distribution for the averaged transition matrix p(eta,eta') = sum_j (x_j^{-1} / sum_k x_k^{-1}) p_j(eta,eta'), and hence for the continuous-time t-PushTASEP. This common distribution is proportional to F_eta(x;1,t) by Theorem 5.5.\n\n(B) General case (Section 6.2): For partitions with repeated parts, AMW24 applies a recoloring/lumping argument (Proposition 2.3) to reduce to the distinct-parts case via weakly order-preserving functions phi, using Corollary 4.6 of the q=1 Macdonald polynomial properties.\n\nNOTE ON MULTILINE DIAGRAMS VS MULTILINE MARKOV PROCESSES. AMW24 uses multiline diagrams as STATIC combinatorial objects whose weighted enumeration yields ASEP polynomials (following CMW22). This is categorically different from constructing a DYNAMICAL multiline Markov process (as in FM07 for ordinary TASEP or AM23 for PushTASEP at t=0). No multiline Markov process construction exists for the t-PushTASEP at general t in (0,1). The previous version of this node incorrectly attributed the proof to a \"Ferrari-Martin multiline construction\" — this was a misattribution. FM07 (Ferrari-Martin, Ann. Probab. 35(3), 2007) concerns ordinary TASEP, not t-PushTASEP. AM23 (Ayyer-Martin, arXiv:2310.09740) constructs a multiline Markov process only at t=0. The correct attribution is AMW24 Theorem 1.1.\n\nMARGINAL-TO-POLYNOMIAL CLARIFICATION. The stationary probabilities pi_lambda(eta) are nonneg reals summing to 1. The ASEP polynomials F_eta(x;1,t) are polynomials in x_1,...,x_n with coefficients in Q(t). The connection is: for FIXED positive reals x_1,...,x_n \u003e 0 and t in [0,1), evaluating F_eta(x;1,t) yields a positive real number, and the ratios F_eta(x;1,t)/P_lambda(x;1,t) give the stationary probabilities. The polynomial structure means the stationary probabilities depend on the site parameters x_i in a polynomial (hence smooth, computable) manner — but the probabilities themselves are real numbers, not polynomials.\n\nDEPENDENCIES. This node depends on: Node 1.4 (definition of the t-PushTASEP as a continuous-time Markov chain on S_n(lambda), including transition rates, cascade mechanism, and irreducibility). This node also depends on Node 1.2 (identification of ASEP polynomials and their Hecke-algebraic definition). The inference type should be read as EXTERNAL THEOREM (citing AMW24 Theorem 1.1 as a published result), not as an assumption. The af framework's available inference types do not include 'external_theorem'; we use 'assumption' as a placeholder but the logical role is that of citing an established theorem.","owner":"prover-s3-1.5"}