{"type":"node_amended","timestamp":"2026-02-10T14:42:03.116673416Z","node_id":"1.4","previous_statement":"MARKOV CHAIN CONSTRUCTION: Define a continuous-time Markov chain on S_n(lambda) via the inhomogeneous multispecies t-PushTASEP: at each site i of the ring, a clock rings at rate 1/x_i; when it rings, the particle at site i pushes into the next weaker particle clockwise, displacing it with probability (1-t) or continuing with probability t. Transition rates depend only on local species comparisons, site parameters x_i, and t.","new_statement":"MARKOV CHAIN CONSTRUCTION (by definition).\n\nREFERENCE. The inhomogeneous multispecies t-PushTASEP is defined in AMW24 (Ayyer-Martin-Williams, arXiv:2403.10485), Section 2, Definition 2.1. Our description follows AMW24 verbatim, specialized to the ring topology with n sites and content lambda.\n\nPARAMETER DOMAINS. Fix: (i) site parameters x_1, ..., x_n \u003e 0 (so that the jump rates 1/x_i are well-defined, finite, and strictly positive); (ii) pushing parameter t in [0,1) (so that (1-t) \u003e 0 is a valid displacement probability; at t = 1, displacement never occurs, every state is absorbing, and the chain is trivially reducible — this degenerate case is excluded).\n\nSTATE SPACE. The state space is S_n(lambda) as defined in Node 1.1: the set of all compositions (mu_1, ..., mu_n) that are permutations of the restricted partition lambda = (lambda_1 \u003e ... \u003e lambda_n \u003e= 0). Each state mu in S_n(lambda) encodes a configuration on the ring, where mu_i is the species of the particle at site i. Species 0 represents a vacancy. Since lambda is restricted (distinct parts, unique 0, no part 1), there is exactly one vacancy in each configuration.\n\nCONTINUOUS-TIME DYNAMICS (t-PushTASEP on the ring). Attach to each site i an independent exponential clock with rate 1/x_i. When the clock at site i rings, a TRANSITION EVENT is initiated as follows.\n\nStep 0 (VACANCY CHECK). Let b := mu_i be the species at site i. If b = 0 (the site is vacant), NOTHING HAPPENS — the clock event produces no state change, since species 0 is the minimum and there are no strictly weaker species to push. The system remains in state mu.\n\nStep 1 (ACTIVATION). If b \u003e 0, the particle of species b at site i becomes ACTIVATED.\n\nStep 2 (SCANNING AND DISPLACEMENT). An activated particle of species b at position j performs the following procedure. It scans clockwise from position j (i.e., through positions j+1, j+2, ..., modulo n, wrapping around the ring), PASSING OVER all sites occupied by species \u003e= b (stronger or equal), until it encounters a site occupied by species c with c \u003c b (strictly weaker). At this point:\n  - With probability (1-t): the activated particle DISPLACES the weaker particle. The species-b particle moves to the position of the species-c particle, and species c becomes ACTIVATED at that position (it must now itself scan and displace, see Step 3).\n  - With probability t: the activated particle CONTINUES scanning further clockwise past this weaker particle, looking for the NEXT site with a strictly weaker species c' \u003c b. This scan-and-decide process repeats at each successive strictly-weaker species encountered.\nEquivalently, if there are z strictly weaker species located clockwise from position j (in clockwise order at positions carrying species c_1 \u003c b, c_2 \u003c b, ..., c_z \u003c b), then the activated species-b particle displaces the k-th weaker species encountered with probability t^{k-1}(1-t) for k = 1, 2, ..., z-1, and displaces the z-th (last) weaker species with probability t^{z-1}. (The probabilities sum to 1 since sum_{k=1}^{z-1} t^{k-1}(1-t) + t^{z-1} = 1.)\n\nStep 3 (CASCADE). When a particle of species c is displaced in Step 2, it becomes ACTIVATED at its current position and repeats Step 2 with species c in place of b. The displaced species-c particle scans clockwise for a species strictly weaker than c, and the displacement/continuation rule with parameter t applies identically. This cascade continues: each displaced particle becomes activated and pushes further.\n\nStep 4 (TERMINATION). The cascade terminates when a VACANCY (species 0) is displaced. Since species 0 has no strictly weaker species, the activation cannot propagate further. The vacancy simply moves to the position vacated by the last displacing particle, absorbing the cascade. The transition is now complete and the system is in a new state nu.\n\nLONG-RANGE NATURE. A single clock event at site i can trigger a cascade of displacements involving particles at many sites around the ring. The transition outcome depends on the species at potentially every site clockwise of i (to determine the scanning targets and cascade path). The dynamics are therefore LONG-RANGE, not nearest-neighbor. Only the clock RATES 1/x_i are site-specific; the transition mechanism involves global configuration-dependent scanning.\n\nSTATE SPACE PRESERVATION. Each displacement in the cascade is a SWAP: species b moves to the position of species c, and species c becomes activated at the position previously occupied by b (or equivalently, at the position from which it was just displaced). The cascade is a sequence of such swaps, terminating when a vacancy absorbs. Therefore: (1) no species is created or destroyed — only rearranged among sites; (2) the multiset of species {mu_1, ..., mu_n} is invariant under every transition; (3) since S_n(lambda) consists of all permutations of the parts of lambda, and transitions only permute species among sites, the chain maps S_n(lambda) to S_n(lambda). The t-PushTASEP is well-defined on S_n(lambda).\n\nIRREDUCIBILITY. For t in [0,1), the t-PushTASEP on S_n(lambda) is irreducible. Argument: At t = 0 (ordinary PushTASEP), each activated particle displaces the FIRST strictly weaker species encountered (deterministic). The PushTASEP (t=0) is known to be irreducible on S_n(lambda) when lambda has at least one vacancy — any configuration can be reached from any other via a sequence of push transitions (AMW24 Proposition 2.4; see also Ayyer-Martin arXiv:2310.09740 for the t=0 case). For t in (0,1), every transition that occurs with positive probability at t = 0 also occurs with positive probability at t in (0,1): the probability of displacing the first weaker species encountered is (1-t) \u003e 0, so the t=0 transition (which always displaces the first weaker species) is realized with probability at least (1-t) \u003e 0 for each step of the cascade. Therefore, any sequence of transitions achievable at t = 0 is also achievable (with positive probability) at t in (0,1). Since the t=0 chain is irreducible, so is the t in (0,1) chain. At t = 1, displacement never occurs (probability 1-t = 0), so the chain is trivially the identity (every state is absorbing); hence t = 1 is excluded from the parameter domain.\n\nCONTINUOUS-TIME TO DISCRETE-TIME BRIDGE. The t-PushTASEP as defined above is a continuous-time Markov chain with generator matrix Q, where Q(mu, nu) for mu != nu is the total rate of transitioning from mu to nu (summing over all sites i whose clock event produces the transition mu -\u003e nu), and Q(mu, mu) = -sum_{nu != mu} Q(mu, nu). The rows of Q sum to 0. The problem statement asks for a Markov chain with a transition MATRIX P whose rows sum to 1 (discrete-time). We obtain P from Q by UNIFORMIZATION: set the uniformization rate R := sum_{i=1}^n 1/x_i (the total clock rate), and define P := I + Q/R. Then P is a stochastic matrix (rows sum to 1), and P(mu, nu) \u003e= 0 for all mu, nu. The discrete-time chain with transition matrix P has the SAME stationary distribution as the continuous-time chain: if pi * Q = 0, then pi * P = pi * (I + Q/R) = pi + pi * Q / R = pi. Conversely, any stationary distribution of P is stationary for Q. Therefore, all stationarity results proved for the continuous-time t-PushTASEP (Node 1.5) carry over to the discrete-time chain with transition matrix P.\n\nDEPENDENCIES. This node depends on Node 1.1 (definition of S_n(lambda), ring topology, species ordering, vacancy convention). The inference type is by_definition: we are CONSTRUCTING/DEFINING a specific Markov chain, not assuming its existence.","owner":"prover-s3-1.4"}