{"type":"node_amended","timestamp":"2026-02-10T14:23:01.5442121Z","node_id":"1.6","previous_statement":"INTERPOLATION EQUALS HOMOGENEOUS RATIO: At q=1, the ratio F*_mu(x;q=1,t)/P*_lambda(x;q=1,t) equals f_mu(x;q=1,t)/P_lambda(x;q=1,t). Since F*_mu = f_mu + lower-order terms and P*_lambda = sum_mu F*_mu = P_lambda + lower-order terms, and both ratios sum to 1, the identity of ratios follows from the Hecke symmetrization relation.","new_statement":"RATIO IDENTITY VIA HECKE STATIONARITY AND UNIQUENESS.\n\nNOTATION. Following BDW25 (arXiv:2510.02587): f*_mu := T_{sigma_mu} E*_lambda denotes the interpolation ASEP polynomial (Def. 1.2, algebraic via Hecke operators); F*_mu denotes the signed multiline queue weight (Def. 1.14); f*_mu = F*_mu by BDW25 Thm 1.15; f_mu denotes the homogeneous ASEP polynomial (top-degree component of f*_mu, cf. BDW25 Thm 2.3); P*_lambda := sum_{mu in S_n(lambda)} f*_mu (BDW25 Prop 2.15); P_lambda := sum_{mu in S_n(lambda)} f_mu (top-degree corollary). In AMW24 (arXiv:2403.10485), the notation F_eta is used for what BDW25 calls f_mu (homogeneous ASEP polynomial).\n\nCLAIM. For t in (0,1) and x_1,...,x_n \u003e 0, the pointwise identity f*_mu(x;1,t) / P*_lambda(x;1,t) = f_mu(x;1,t) / P_lambda(x;1,t) holds for all mu in S_n(lambda). Equivalently, there exists a scalar C(x,t) \u003e 0 independent of mu such that f*_mu(x;1,t) = C(x,t) * f_mu(x;1,t) for all mu in S_n(lambda), where C(x,t) = P*_lambda(x;1,t) / P_lambda(x;1,t).\n\nDOMAIN. The identity is a pointwise statement for real evaluations x_i \u003e 0 and t in (0,1). At these parameter values: (i) P_lambda(x;1,t) \u003e 0 since it is a sum of positive stationary weights (AMW24 Thm 1.1); (ii) f_mu(x;1,t) \u003e 0 for all mu (AMW24 Thm 1.1, stationary weights are positive); (iii) P*_lambda(x;1,t) = C * P_lambda \u003e 0 once the identity is established. All ratios are well-defined.\n\nPROOF (Hecke stationarity argument, three steps).\n\nStep 1 (Hecke relations for f*_mu at q=1). By BDW25 Proposition 2.10, the interpolation ASEP polynomials satisfy: (a) T_i f*_mu = f*_{s_i mu} when mu_i \u003e mu_{i+1}; (b) T_i f*_mu = t * f*_mu when mu_i = mu_{i+1}; (c) T_i f*_mu = (t-1) * f*_mu + t * f*_{s_i mu} when mu_i \u003c mu_{i+1}. The homogeneous ASEP polynomials f_mu satisfy the SAME relations (a)-(c) with f_mu in place of f*_mu, since T_i preserves the degree filtration and the top-degree component of T_i f*_mu is T_i f_mu (BDW25 Thm 2.3).\n\nStep 2 (Both vectors satisfy the balance equations). AMW24 (arXiv:2403.10485) Thm 1.1 establishes that the vector (f_mu(x;1,t))_{mu in S_n(lambda)} lies in the left null space of the generator Q(x,t) of the t-PushTASEP. The AMW24 proof (via multiline diagrams, Sections 3-4) derives the balance equation sum_mu f_mu * Q_{mu,nu} = 0 by algebraic manipulations that depend on f_mu ONLY through the Hecke relations (a)-(c). Specifically, the multiline diagram projections encode the T_i-action, and the balance verification reduces to applications of relations (a)-(c). Since f*_mu satisfies the IDENTICAL Hecke relations (Step 1), every algebraic step in the AMW24 balance proof carries over verbatim with f*_mu replacing f_mu. Therefore the vector (f*_mu(x;1,t))_{mu} also lies in the left null space of Q(x,t).\n\nStep 3 (Uniqueness forces proportionality). The t-PushTASEP on S_n(lambda) is an irreducible continuous-time Markov chain for x_i \u003e 0, t in (0,1) (Node 1.4). By the Perron-Frobenius theorem for irreducible generators, the left null space of Q is one-dimensional. Since both (f_mu(x;1,t))_mu and (f*_mu(x;1,t))_mu lie in this null space, they are proportional: f*_mu(x;1,t) = C(x,t) * f_mu(x;1,t) for all mu, with C independent of mu. Summing over mu: P*_lambda(x;1,t) = C(x,t) * P_lambda(x;1,t). Dividing: f*_mu / P*_lambda = f_mu / P_lambda.\n\nDEPENDENCIES. This node depends on: Node 1.2 (polynomial identification and Hecke operator definitions); Node 1.4 (irreducibility of the t-PushTASEP); Node 1.5 (AMW24 Thm 1.1: stationarity of f_mu for the t-PushTASEP). Node 1.3 (positivity of f*_mu/P*_lambda) is NOT a prerequisite; rather, positivity of f*_mu/P*_lambda FOLLOWS as a corollary of this node combined with positivity of f_mu from AMW24.\n\nCRITICAL CAVEAT AND RELATION TO OPEN PROBLEMS. Step 2 asserts that the AMW24 proof of the balance equation transfers from f_mu to f*_mu because both satisfy the same Hecke relations (a)-(c). A fully rigorous verification requires confirming that the AMW24 multiline diagram argument uses ONLY relations (a)-(c) and no additional properties specific to homogeneous polynomials (such as degree homogeneity, evaluation formulas, or positivity). BDW25 Remark 1.17 states that an interpolation analogue of the AMW24 probabilistic interpretation will appear in a forthcoming paper [BDW] by Ben Dali and Williams, indicating the authors consider this transfer step worthy of dedicated treatment. BDW25 Section 7 Theorem 7.1 (factorization of interpolation Macdonald polynomials) provides a complementary approach that may yield f*_mu = C * f_mu directly via algebraic factorization rather than stationarity arguments. The Hecke stationarity route (this node) and the BDW25 factorization route are two independent strategies for the same conclusion; either suffices.\n\nThe inference type of this node should be read as DEDUCTION (modus ponens from BDW25 Prop 2.10 + AMW24 Thm 1.1 + Perron-Frobenius uniqueness), not as an assumption.","owner":"prover-s3-1.6"}