{"type":"node_amended","timestamp":"2026-02-10T14:52:20.445986733Z","node_id":"1.8","previous_statement":"CONCLUSION: The answer is YES. The inhomogeneous multispecies t-PushTASEP on S_n(lambda) with rates 1/x_i has stationary distribution pi(mu) = F*_mu(x;q=1,t)/P*_lambda(x;q=1,t), and its transition probabilities do not involve the F*_mu polynomials.","new_statement":"CONCLUSION (DEDUCTION FROM NODES 1.1-1.7): The answer is YES. For a restricted partition λ = (λ_1 \u003e λ_2 \u003e ... \u003e λ_n ≥ 0) with distinct parts (exactly one part equals 0, no part equals 1), site parameters x_1,...,x_n \u003e 0, and pushing parameter t ∈ (0,1), there exists a nontrivial Markov chain on S_n(λ) whose stationary distribution is pi(μ) = f*_μ(x;q=1,t) / P*_λ(x;q=1,t) for μ ∈ S_n(λ), where the transition probabilities are not described using the polynomials f*_μ. NOTATION. Following BDW25 (arXiv:2510.02587): f*_μ denotes the interpolation ASEP polynomial (Def. 1.2, algebraic via Hecke operators; equivalently F*_μ by BDW25 Thm 1.15); P*_λ = sum_{μ ∈ S_n(λ)} f*_μ (BDW25 Prop 2.15). Equivalently, by the ratio identity (Node 1.6), pi(μ) = f_μ(x;q=1,t) / P_λ(x;q=1,t), where f_μ is the homogeneous ASEP polynomial (top-degree component of f*_μ, BDW25 Thm 2.3) and P_λ = sum_μ f_μ. DEPENDENCIES AND LOGICAL CHAIN. This conclusion synthesizes ALL sibling nodes: Node 1.1 (STATE SPACE SETUP): Defines S_n(λ) as the set of all permutations of λ, establishes the particle/vacancy interpretation on a ring with periodic boundary, and fixes the species ordering 0 \u003c 2 \u003c 3 \u003c .... Essential for specifying the state space of the Markov chain. Node 1.2 (POLYNOMIAL IDENTIFICATION): Establishes the notation and algebraic identities for f*_μ, f_μ, P*_λ, P_λ, and cross-references to AMW24 (F_η) and CMW22 (f_w). Provides the polynomial definitions needed to express the stationary distribution. The domain requirement (t ∈ (0,1), x_i \u003e 0) for the probabilistic interpretation originates here. Node 1.3 (POSITIVITY AND NORMALIZATION): Proves pi(μ) ≥ 0, pi(μ) \u003e 0 for all μ, sum_μ pi(μ) = 1, and P*_λ \u003e 0, establishing that pi is a well-defined probability distribution with full support. This is a corollary of Nodes 1.5 and 1.6. Node 1.4 (MARKOV CHAIN CONSTRUCTION): Defines the inhomogeneous multispecies t-PushTASEP as a continuous-time Markov chain on S_n(λ) with exponential clocks at rates 1/x_i, pushing cascade mechanism with parameter t, and proves irreducibility for t ∈ (0,1). Provides the explicit chain whose stationary distribution is claimed. Node 1.5 (STATIONARITY via AMW24): Cites AMW24 Theorem 1.1 (arXiv:2403.10485) establishing that the t-PushTASEP has stationary distribution pi_λ(μ) = f_μ(x;1,t) / P_λ(x;1,t) (in AMW24 notation, F_η / P_λ). This is the key external theorem giving stationarity of the homogeneous ASEP polynomial ratios. Node 1.6 (RATIO IDENTITY): Proves the pointwise identity f*_μ(x;1,t) / P*_λ(x;1,t) = f_μ(x;1,t) / P_λ(x;1,t) for all μ ∈ S_n(λ) via the Hecke stationarity argument: both (f*_μ)_μ and (f_μ)_μ satisfy the same Hecke relations (BDW25 Prop 2.10), hence both lie in the one-dimensional left null space of the t-PushTASEP generator, forcing proportionality. This bridges the interpolation polynomials f*_μ/P*_λ to the homogeneous polynomials f_μ/P_λ. Node 1.7 (NONTRIVIALITY): Proves the t-PushTASEP transition matrix is not the trivial i.i.d. sampler (the rank-1 matrix with identical rows pi). Explicitly exhibits a pair (μ,ν) with P^{tP}(μ,ν) = 0 (unreachable in one step) while P^{triv}(μ,ν) = pi(ν) \u003e 0, using the sparsity of the cascade dynamics. This ensures the chain is a genuine dynamical system, not merely a restatement of the stationary distribution. LOGICAL SYNTHESIS. Combining these nodes: (1) Nodes 1.1 and 1.4 define the state space S_n(λ) and the t-PushTASEP Markov chain on it. (2) Node 1.5 (AMW24 Thm 1.1) gives stationarity of f_μ / P_λ. (3) Node 1.6 proves f*_μ / P*_λ = f_μ / P_λ, transferring stationarity to the interpolation ratios. (4) Node 1.3 confirms pi(μ) = f*_μ / P*_λ is a probability distribution with full support. (5) Node 1.7 confirms the chain is nontrivial. (6) Node 1.2 provides the notation and domains tying everything together. Hence the answer to the root question is YES: the t-PushTASEP is the required Markov chain. INFERENCE TYPE. This is a deduction (modus ponens): from the premises established in Nodes 1.1-1.7, the conclusion follows by logical combination.","owner":"prover-s3-1.8"}