{"type":"challenge_raised","timestamp":"2026-02-10T22:08:13.994625853Z","challenge_id":"ch-9c0557e7a2eb76a3","node_id":"1.5","target":"gap","reason":"VERTEX SMOOTHING BOUNDARY CONDITIONS — TROPICAL RESOLUTION vs FLAT FACES. After Phase A, the vertex smoothing within B_delta(v) must transition to the ORIGINAL flat faces at the boundary of B_delta(v). But tropical resolution for Type A vertices changes the local topology: a single 4-valent vertex becomes two 3-valent vertices connected by a new edge, with faces rearranged.\n\nConsider the standard Type A example: Pi_1 = span{e1,e2}, Pi_2 = span{e1,e4}, Pi_3 = span{e3,e4}, Pi_4 = span{e2,e3} (using coordinates (x1,x2,y1,y2) with omega = dx1^dy1 + dx2^dy2, so e1=partial_x1, e2=partial_x2, e3=partial_y1, e4=partial_y2). The tropical resolution partitions the 4 faces into two groups, say {Pi_1,Pi_2} and {Pi_3,Pi_4}. This creates a 3-valent vertex v' where {Pi_1,Pi_2,Pi_new} meet and another v'' where {Pi_3,Pi_4,Pi_new} meet, where Pi_new is a new intermediate Lagrangian plane.\n\nNear the boundary of B_delta(v), the original surface K consists of 4 sectors in the 4 planes Pi_1,...,Pi_4 emanating from v. The tropical resolution REARRANGES these: near v', faces Pi_1 and Pi_2 are separated by the new face Pi_new, and similarly near v''. At the boundary of B_delta(v), one must transition from the rearranged (resolved) face configuration back to the original 4-sector configuration.\n\nThis transition is NOT trivial because the tropical resolution introduces a TOPOLOGICAL change (one vertex becomes two), and this change must be confined to the interior of B_delta(v). At the boundary sphere S^3_{delta}(v), the intersection of the resolved surface with S^3 must agree with the intersection of the original polyhedral surface with S^3 (which is the link — a simple closed curve consisting of 4 great circle arcs).\n\nThe Matessi-Mikhalkin pair-of-pants construction is designed for tropical curve singularities and produces a smooth Lagrangian surface that agrees with the piecewise-linear tropical surface outside a compact region. But the 'outside' region in the Matessi construction is a tropical curve (1-dimensional skeleton), not the 4-sector tangent cone. The mapping from the tropical resolution setting to the vertex ball setting requires a careful argument that is entirely absent.","severity":"major","raised_by":""}