{"type":"challenge_raised","timestamp":"2026-02-10T22:06:35.292892559Z","challenge_id":"ch-eef2890585c06e47","node_id":"1.5","target":"gap","reason":"CRITICAL GAP: TROPICAL RESOLUTION CREATES NEW EDGES THAT ARE NOT ACCOUNTED FOR. Node 1.2 verification established that ONLY Type A vertices exist (Type B is impossible). Node 1.3 handles Type A vertices via tropical resolution: split each 4-valent vertex into two 3-valent vertices connected by a NEW EDGE, then smooth each 3-valent vertex via the Matessi-Mikhalkin pair-of-pants.\n\nAfter Phase A (tropical resolution + pair-of-pants at each original vertex), the surface K has CHANGED COMBINATORICS. The original vertex v has been replaced by two 3-valent vertices v', v'' connected by a new edge e_new. The pair-of-pants smoothing handles v' and v'' individually, but the new edge e_new is now a DIHEDRAL SINGULARITY that must also be smoothed.\n\nThe node's Phase B says 'smooth all remaining edge singularities.' But it only accounts for the ORIGINAL edges of K, not the new edges created by tropical resolution. After Phase A:\n- Original edges: still singular (V-shaped) outside vertex balls.\n- New edges from tropical resolution: these are internal to the vertex balls B_delta(v), so they may or may not be singular.\n\nIf the tropical resolution + pair-of-pants smoothing is done correctly, the new edges e_new should be smoothed WITHIN Phase A (as part of the vertex smoothing in B_delta(v)). But this means the pair-of-pants construction must smooth not just the 3-valent vertices v', v'' but also the connecting edge e_new — i.e., the entire resolution must be smooth, not just the vertices.\n\nThe claim in node 1.3 ('smooth each using the Matessi-Mikhalkin Lagrangian pair-of-pants construction') does not clarify whether the new edge is also smoothed. If the pair-of-pants only smooths the 3-valent vertices and leaves the connecting edge singular, then Phase A produces a surface with ADDITIONAL singular edges (one per original vertex) inside the vertex balls. Phase B would then need to smooth these edges too, but they are INSIDE the vertex balls, not 'away from vertex balls' as claimed.\n\nThis creates a logical inconsistency: Phase B is described as having 'disjoint supports away from vertex balls,' but some singular edges (from tropical resolution) are INSIDE vertex balls. The two-phase structure as described does not account for the intermediate singularities introduced by tropical resolution.","severity":"critical","raised_by":""}