{"type":"node_amended","timestamp":"2026-02-11T08:50:26.637800742Z","node_id":"1.3","previous_statement":"Local vertex smoothing via Lagrangian surgery: Each vertex singularity admits a local Lagrangian smoothing supported in an arbitrarily small ball B_delta(v). For Type B vertices (two transverse Lagrangian planes), apply Polterovich-Lalonde-Sikorav surgery: the neck H_lambda = {(z_1,z_2) in C^2 : Im(z_1 bar{z_2})=0, |z_1|^2-|z_2|^2=lambda} is a smooth Lagrangian converging to L_1 union L_2 as lambda-\u003e0. For Type A vertices (4 distinct planes), apply tropical resolution: split the 4-valent configuration into two 3-valent configurations connected by an edge, then smooth each using the Matessi-Mikhalkin Lagrangian pair-of-pants construction. In both cases the surgery is generated by a compactly supported Hamiltonian.","new_statement":"Local vertex smoothing via cotangent generating functions (Construction). Depends on: Node 1.2 (vertex classification). Inference type: construction.\n\nSTATEMENT (Lemma). Let v be a vertex of the polyhedral Lagrangian surface K in (R^4, omega_std) where 4 faces meet. For every delta \u003e 0 sufficiently small, there exists a smooth embedded Lagrangian disk L_v in B_delta(v) and a compactly supported Hamiltonian H: R^4 -\u003e R with supp(H) subset B_delta(v) such that the time-1 flow phi_H^1 satisfies phi_H^1(K cap B_delta(v)) = L_v. The Lagrangian L_v agrees with K outside an arbitrarily small neighborhood of v.\n\nCONVENTIONS. Coordinates (x_1, x_2, y_1, y_2) on R^4 with omega = dx_1 ^ dy_1 + dx_2 ^ dy_2. We identify R^4 = T*R^2 with base (x_1, x_2) and fiber (y_1, y_2). Standard fact: the graph {(x, dF(x)) : x in U} of an exact 1-form dF is a Lagrangian submanifold. This is the foundational tool of the construction.\n\nPROOF.\n\nSTEP 1 (VERTEX NORMAL FORM). Translate v to 0. By Node 1.2, only Type A vertices occur: the 4 Lagrangian half-planes lie in 4 pairwise-distinct Lagrangian planes Pi_1, Pi_2, Pi_3, Pi_4 (cyclically ordered), with consecutive planes intersecting in a line (the shared edge) and non-consecutive planes transverse. After Sp(4,R)-normalization, these depend on a single real parameter gamma:\n\n  Pi_1 = span{e_1, e_2},  Pi_2 = span{e_1, e_4},\n  Pi_3 = span{e_4, gamma*e_1 + e_3},  Pi_4 = span{e_2, gamma*e_1 + e_3},\n\nwith shared edges e_{12} = R*e_1, e_{23} = R*e_4, e_{34} = R*(gamma*e_1 + e_3), e_{41} = R*e_2. The tangent cone C_v consists of 4 sectors S_i subset Pi_i forming a topological disk; its link in S^3 is a simple closed curve of 4 great circle arcs.\n\nSTEP 2 (TRANSVERSALITY LEMMA). We require all 4 planes to be simultaneously transverse to a single Lagrangian reference plane Lambda, so that each Pi_i can be written as a cotangent graph.\n\nLemma (Simultaneous transversality). Given k Lagrangian planes Pi_1,...,Pi_k in R^{2n} in general position, there exists a Lagrangian plane Lambda transverse to every Pi_i, provided k \u003c= dim LG(n,2n) = n(n+1)/2 + 1 (which holds for k=4, n=2 since dim LG(2,4) = 3).\n\nProof: The Maslov cycle Sigma(Pi_i) = {Lambda in LG(n,2n) : Lambda cap Pi_i != 0} is a codimension-1 algebraic subvariety of LG(n,2n). For k planes, the union Sigma(Pi_1) cup ... cup Sigma(Pi_k) has codimension 1 in the 3-manifold LG(2,4). The complement is open and dense. Since LG(2,4) is connected (it is U(2)/O(2)), the complement of k codimension-1 subvarieties is nonempty (in fact dense) for any finite k. Hence Lambda exists.\n\nFor the EXPLICIT standard form, we exhibit Lambda directly. Set Lambda = span{e_1 + e_3, e_2 + e_4} when gamma = 0, which is Lagrangian (omega(e_1+e_3, e_2+e_4) = 0) and transverse to all 4 planes (verified by checking that Pi_i + Lambda = R^4 for each i; equivalently, the 4x4 matrix formed by bases of Pi_i and Lambda has nonzero determinant for each i). For general gamma, a smooth family Lambda(gamma) can be chosen (by openness of the transversality condition and connectedness of the parameter space R).\n\nSTEP 3 (COTANGENT GRAPH COORDINATES). Apply the linear symplectomorphism Phi that sends Lambda to the standard fiber F = span{e_3, e_4} and a complementary Lagrangian plane to the base B = span{e_1, e_2}. In the new Darboux coordinates (X_1, X_2, Y_1, Y_2), each Pi_i is transverse to F and hence takes the form:\n\n  Pi_i = {(X, A_i X) : X in R^2},\n\nwhere A_i is a symmetric 2x2 matrix (symmetry is equivalent to the Lagrangian condition for a linear graph). On sector Omega_i in the base (X_1, X_2)-plane, the face of K is the graph of X -\u003e A_i X. The piecewise-linear generating function is:\n\n  F_PL(X) = (1/2) X^T A_i X,  for X in Omega_i.\n\nContinuity: along the shared edge between sectors Omega_i and Omega_{i+1}, the two linear forms dF_i = A_i X and dF_{i+1} = A_{i+1} X agree on the edge direction (because the edge lies in Pi_i cap Pi_{i+1}, so A_i and A_{i+1} give the same fiber value along that direction). Hence F_PL is continuous and piecewise smooth, with creases along the 4 edge projections.\n\nSTEP 3 VERIFICATION (gamma = 0 explicit). For gamma = 0, choosing Lambda = span{e_1+e_3, e_2+e_4}, the symplectomorphism Phi has the following effect on the 4 planes (computed in full in the worked example below):\n\n  A_1 = (1/2)Id,  A_2 = diag(1/2, -1/2),  A_3 = -(1/2)Id,  A_4 = diag(-1/2, 1/2).\n\nThe sectors Omega_1,...,Omega_4 are the four quadrants of the (X_1,X_2)-plane, separated by the axes (which are the projections of the edge rays). The generating functions are F_1 = (X_1^2+X_2^2)/4, F_2 = (X_1^2-X_2^2)/4, F_3 = -(X_1^2+X_2^2)/4, F_4 = (-X_1^2+X_2^2)/4. One verifies: along the positive X_1-axis (edge between Omega_1 and Omega_2), dF_1(X_1,0) = (X_1/2, 0) = dF_2(X_1,0). Along the positive X_2-axis (edge between Omega_1 and Omega_4), dF_1(0,X_2) = (0, X_2/2) = dF_4(0,X_2). The other edges match similarly.\n\nSTEP 4 (SMOOTH GENERATING FUNCTION). Let theta = theta(X) denote the angular coordinate in the base R^2 (measured from the positive X_1-axis). The 4 sectors Omega_i are separated by 4 angular values theta_1 \u003c theta_2 \u003c theta_3 \u003c theta_4 (the angles of the edge projections). Choose a smooth partition of unity {rho_i(theta)}_{i=1}^4 subordinate to slightly enlarged sectors, depending only on theta, with rho_i = 1 on the interior of Omega_i and transition regions of angular width alpha \u003e 0 (which may be chosen arbitrarily small). Define the smooth generating function:\n\n  F_smooth(X) = sum_{i=1}^{4} rho_i(theta(X)) * (1/2) X^T A_i X.\n\nProperties of F_smooth:\n(a) F_smooth is smooth on R^2 setminus {0} (smooth partition of smooth quadratic forms).\n(b) F_smooth is homogeneous of degree 2: F_smooth(lambda X) = lambda^2 F_smooth(X) for lambda \u003e 0. This follows because each (1/2) X^T A_i X is homogeneous of degree 2 and rho_i depends only on theta (not on r = |X|).\n(c) F_smooth extends smoothly to the origin with F_smooth(0) = 0, dF_smooth(0) = 0, and D^2 F_smooth(0) = sum_i rho_i(theta) A_i (which is a smooth function of theta, hence F_smooth is smooth at the origin by homogeneity degree 2).\n(d) In the interior of each sector Omega_i, rho_i = 1 and rho_j = 0 for j != i, so F_smooth = F_i = (1/2) X^T A_i X, and graph(dF_smooth) = Pi_i. The smooth Lagrangian matches the original PL faces in sector interiors.\n\nThe graph L_smooth = {(X, dF_smooth(X)) : X in R^2} is a smooth exact Lagrangian submanifold of T*R^2 = R^4.\n\nSTEP 5 (COMPACTLY SUPPORTED SMOOTHING). Define the final generating function with radial cutoff:\n\n  F_final(X) = F_PL(X) + phi(|X|/delta) * (F_smooth(X) - F_PL(X)),\n\nwhere phi: [0,infinity) -\u003e [0,1] is smooth with phi(t) = 1 for t \u003c= 1/2 and phi(t) = 0 for t \u003e= 1.\n\nKey observations:\n(a) The difference D(X) := F_smooth(X) - F_PL(X) is supported in the angular transition strips near the edge projections (in sector interiors, F_smooth = F_PL). It is smooth on R^2 setminus {0} and homogeneous of degree 2, hence smooth everywhere (including the origin).\n(b) For |X| \u003e= delta: phi = 0, so F_final = F_PL, and graph(dF_final) = K (the original polyhedral surface).\n(c) For |X| \u003c= delta/2: phi = 1, so F_final = F_smooth, and graph(dF_final) = L_smooth (the smooth Lagrangian).\n(d) In the annular region delta/2 \u003c= |X| \u003c= delta: F_final is a smooth interpolation. The function D(X) is smooth (even across edge rays, where F_PL has creases, because D = F_smooth - F_PL and both F_smooth and the individual pieces of F_PL are smooth; the crease of F_PL is canceled by F_smooth which smoothly interpolates across the crease). The product phi(|X|/delta) * D(X) is smooth, so F_final = F_PL + phi * D is smooth wherever D is smooth AND wherever phi = 0. In the annular region near an edge ray, D is smooth (it is the smooth correction to the crease), so F_final is smooth. In the annular region in a sector interior, D = 0, so F_final = F_PL = (1/2)X^T A_i X, which is smooth.\n(e) L_final = graph(dF_final) is Lagrangian (it is the graph of the exact 1-form dF_final).\n\nSTEP 6 (EMBEDDEDNESS). L_final is embedded because it is a global graph over R^2: the map X -\u003e (X, dF_final(X)) is an injective immersion (the projection to the base is a diffeomorphism). Graph Lagrangians are always embedded.\n\nSTEP 7 (HAMILTONIAN ISOTOPY). Define the 1-parameter family of generating functions:\n\n  G_t(X) = F_PL(X) + t * phi(|X|/delta) * D(X),  for t in [0,1].\n\nFor each t, L_t = graph(dG_t) is an exact Lagrangian (graph of exact 1-form). At t = 0, L_0 = graph(dF_PL) = K. At t = 1, L_1 = L_final. The family {L_t} is a Lagrangian isotopy.\n\nThe generating Hamiltonian for this isotopy is: H_t(X, Y) = phi(|X|/delta) * D(X), evaluated at the point (X, Y) = (X, dG_t(X)) on L_t. This is independent of t and compactly supported in B_delta(v) (since phi(|X|/delta) = 0 for |X| \u003e= delta). Thus the smoothing is realized by a compactly supported Hamiltonian flow.\n\nSTEP 8 (BOUNDARY CONDITIONS FOR GLOBAL ASSEMBLY). For the interface with Node 1.4 (edge smoothing) and Node 1.5 (global assembly): on the boundary of B_delta(v), L_final agrees EXACTLY with the original polyhedral surface K. The 4 faces of K exit B_delta(v) as flat Lagrangian half-planes, and L_final matches them. There is no topological modification (no tropical resolution, no introduction of new edges or vertices). The smooth Lagrangian L_final is topologically a disk (same as the PL cone), and its boundary circle on partial B_delta(v) is the same link curve as K's. The edge singularities of K (V-shaped dihedral angles along the 4 edge rays) are smoothed inside B_delta(v), but outside B_delta(v) the edges remain singular and are handled by Node 1.4 in the subsequent global assembly (Node 1.5, Phase B).\n\nWORKED EXAMPLE (gamma = 0 in full). Coordinates: (x_1, x_2, y_1, y_2), omega = dx_1 ^ dy_1 + dx_2 ^ dy_2. Planes: Pi_1 = span{e_1,e_2}, Pi_2 = span{e_1,e_4}, Pi_3 = span{e_3,e_4}, Pi_4 = span{e_2,e_3}. Edges: e_{12} = R*e_1, e_{23} = R*e_4, e_{34} = R*e_3, e_{41} = R*e_2.\n\nReference plane: Lambda = span{e_1+e_3, e_2+e_4}. Lagrangian check: omega(e_1+e_3, e_2+e_4) = omega(e_1,e_2) + omega(e_1,e_4) + omega(e_3,e_2) + omega(e_3,e_4) = 0+0+0+0 = 0. Transversality to each Pi_i is verified by checking rank conditions (det != 0 for each Pi_i + Lambda; done by direct 4x4 determinant computations, all nonzero).\n\nSymplectomorphism: Let f_1 = (e_1-e_3)/2, f_2 = (e_2-e_4)/2, f_3 = e_1+e_3, f_4 = e_2+e_4. Verify: omega(f_1,f_3) = (1/2)*(omega(e_1,e_1)+omega(e_1,e_3)-omega(e_3,e_1)-omega(e_3,e_3)) = (1/2)*(0+1+1+0) = 1. omega(f_2,f_4) = 1 similarly. All other pairs give omega = 0. So (f_1,f_2,f_3,f_4) is a Darboux basis. The symplectomorphism Phi sends this basis to (e_1,e_2,e_3,e_4), i.e., new coordinates (X_1,X_2,Y_1,Y_2) with X_i = f_i-component and Y_i = f_{i+2}-component.\n\nIn new coordinates: the images of the 4 planes are:\n  Phi(Pi_1) = graph(A_1), A_1 = (1/2)Id. [F_1 = (X_1^2+X_2^2)/4]\n  Phi(Pi_2) = graph(A_2), A_2 = diag(1/2,-1/2). [F_2 = (X_1^2-X_2^2)/4]\n  Phi(Pi_3) = graph(A_3), A_3 = -(1/2)Id. [F_3 = -(X_1^2+X_2^2)/4]\n  Phi(Pi_4) = graph(A_4), A_4 = diag(-1/2,1/2). [F_4 = (-X_1^2+X_2^2)/4]\n\nEdge projections to (X_1,X_2)-plane: (1,0), (0,-1), (-1,0), (0,1) — the four semi-axes, dividing the base into quadrants. Smooth generating function: F_smooth(X) = [X_1^2 * alpha(theta) + X_2^2 * beta(theta)]/4, where alpha(theta) = sum_i rho_i(theta) * a_i with (a_1,a_2,a_3,a_4) = (1,1,-1,-1) and beta(theta) = sum_i rho_i(theta) * b_i with (b_1,b_2,b_3,b_4) = (1,-1,-1,1). Both alpha and beta are smooth functions of theta, with alpha = +-1 and beta = +-1 in sector interiors. The graph of dF_smooth is a smooth Lagrangian surface.\n\nAt the origin: dF_smooth(0) = 0 (the smoothed surface passes through the origin). The tangent plane at the origin is determined by D^2 F_smooth(0), which interpolates smoothly among the A_i — the vertex singularity is resolved to a smooth point.\n\nEND OF PROOF.","owner":"prover-1.3"}