{"type":"node_amended","timestamp":"2026-02-11T09:17:48.641968722Z","node_id":"1.4","previous_statement":"Edge smoothing via Lagrangian rounding: Along each edge e of K where exactly 2 Lagrangian faces meet, the dihedral singularity admits a local Lagrangian smoothing supported in a tubular neighborhood of e. In adapted symplectic coordinates the two half-planes differ only in a transverse profile; replace the V-shaped profile with a smooth convex curve, then apply a Moser-type correction (using omega|_{K_mollified} = d(alpha_epsilon) with |alpha_epsilon|=O(epsilon)) to restore the exact Lagrangian condition. The correction is generated by a compactly supported Hamiltonian.","new_statement":"Edge smoothing via explicit Lagrangian profile replacement (Construction). Depends on: Node 1.2 (vertex classification and edge structure). Inference type: construction.\n\nSTATEMENT. Let e be an edge of the polyhedral Lagrangian surface K in (R^4, omega_std) where exactly 2 Lagrangian faces F_1, F_2 meet. There exists a smooth embedded Lagrangian surface L_e, defined in a tubular neighborhood of e (away from vertex balls), that replaces the dihedral singularity along e and agrees with the original polyhedral faces outside the smoothing region. The construction is explicit and the Lagrangian condition holds exactly (no correction needed). Endpoint compatibility with vertex smoothings from Node 1.3 is deferred to Node 1.5 (global assembly).\n\nCONVENTIONS. Coordinates (x_1, x_2, y_1, y_2) on R^4 with omega = dx_1 ^ dy_1 + dx_2 ^ dy_2, following Node 1.2.\n\nPROOF.\n\nSTEP 1 (EDGE CONFIGURATION). Two Lagrangian faces F_1, F_2 share an edge e. Each face lies in a Lagrangian plane (Pi_1, Pi_2 respectively), and Pi_1 cap Pi_2 contains the edge direction v (a nonzero vector). The two planes are distinct (different faces) but share exactly a line along e (from Node 1.2, Step 1: consecutive planes share a 1-dimensional intersection).\n\nSTEP 2 (LINEAR SYMPLECTIC COORDINATES — FROM FIRST PRINCIPLES). We construct a Darboux basis adapted to the edge by LINEAR ALGEBRA in Sp(4,R). This is NOT a neighborhood theorem and does NOT invoke any PL Darboux theorem (which does not exist; cf. Jauberteau-Rollin 2024). The construction uses only the global linear symplectic structure of (R^4, omega_std).\n\nSub-step 2a. Set e_1 = v/|v| (unit vector along the edge). Since Pi_1 is Lagrangian and contains e_1, we have omega(e_1, w) = 0 for all w in Pi_1. Similarly omega(e_1, w) = 0 for all w in Pi_2. Write Pi_1 = span{e_1, w_1} and Pi_2 = span{e_1, w_2} where w_1, w_2 are linearly independent vectors not parallel to e_1.\n\nSub-step 2b. Since Pi_1 is Lagrangian: omega(e_1, w_1) = 0. Since Pi_2 is Lagrangian: omega(e_1, w_2) = 0. The symplectic complement of e_1 is the 3-dimensional space {e_1}^omega = ker(omega(e_1, -)). Both w_1 and w_2 lie in {e_1}^omega. Choose f_1 in R^4 with omega(e_1, f_1) = 1. Then f_1 is NOT in {e_1}^omega, and R^4 = {e_1}^omega oplus R*f_1.\n\nSub-step 2c. Project: the quotient V = {e_1}^omega / R*e_1 is a 2-dimensional symplectic vector space with the induced form omega_bar. The images bar{w}_1, bar{w}_2 of w_1, w_2 in V are nonzero (since Pi_1 != Pi_2, so w_1 and w_2 are not proportional modulo e_1 generically; even if they happen to be parallel mod e_1, we can choose w_1, w_2 to avoid this). Choose e_2 in {e_1}^omega representing bar{w}_1 (i.e., the component of w_1 orthogonal to e_1 in {e_1}^omega). Then omega(e_1, e_2) = 0 and omega(e_2, f_1) is some scalar; adjust f_1 to ensure omega(e_2, f_1) = 0 (replace f_1 by f_1 - omega(e_2, f_1)*e_1/omega(e_1, f_1) if needed — but simpler: choose f_2 with omega(e_2, f_2) = 1 and omega(e_1, f_2) = 0, omega(f_1, f_2) = 0).\n\nSub-step 2d. Explicitly: choose any f_1 with omega(e_1, f_1) = 1. Set e_2 = w_1 - omega(w_1, f_1)*e_1 (ensuring omega(e_2, f_1) = 0 while keeping e_2 in span of {e_1}^omega). Then choose f_2 with omega(e_2, f_2) = 1, omega(e_1, f_2) = 0, omega(f_1, f_2) = 0. The basis (e_1, e_2, f_1, f_2) is a Darboux basis: omega(e_i, f_j) = delta_{ij}, omega(e_i, e_j) = 0, omega(f_i, f_j) = 0.\n\nSub-step 2e. In the Darboux coordinates (x_1, x_2, y_1, y_2) defined by this basis:\n- The edge e lies along the x_1-axis.\n- Pi_1 = span{e_1, e_2} = {y_1 = 0, y_2 = 0}. (By construction, e_2 was chosen from w_1.)\n- Pi_2 = span{e_1, w_2}. Since omega(e_1, w_2) = 0 (Lagrangian condition), the f_1-component of w_2 vanishes: w_2 has no y_1-component. So Pi_2 lies in {y_1 = 0}. The projection of w_2 to the (x_2, y_2)-plane is a nonzero vector (since Pi_2 != Pi_1 and the edge direction e_1 is common).\n\nCONCLUSION OF STEP 2. In adapted coordinates:\n- The edge is the x_1-axis.\n- BOTH faces lie in the hyperplane {y_1 = 0}. This is because both face planes contain e_1, and the Lagrangian condition omega(e_1, -) = 0 forces dy_1 = 0 on both faces (since the f_1 = y_1 direction is the omega-dual of e_1).\n- Face F_1 has transverse profile along the ray r_1 = (1, 0) in the (x_2, y_2)-plane (we normalized e_2 along w_1).\n- Face F_2 has transverse profile along a ray r_2 = (cos(theta), sin(theta)) in the (x_2, y_2)-plane, where theta != 0 (mod pi) is the angle between the two face profiles.\n\nThe two faces, near the edge, look like:\n  F_1: {(x_1, t, 0, 0) : t \u003e= 0} (the half-plane x_2 \u003e= 0 in {y_1 = y_2 = 0}),\n  F_2: {(x_1, t*cos(theta), 0, t*sin(theta)) : t \u003e= 0} (the half-plane along r_2 in {y_1 = 0}).\n\nTheir union is a \"V-shaped\" surface: a product of the x_1-line with a V-shape (two rays from the origin) in the (x_2, y_2)-plane, embedded in the 3-dimensional hyperplane {y_1 = 0}.\n\nSTEP 3 (THE EXPLICIT CONSTRUCTION). Replace the V-shaped profile (two rays r_1, r_2 in the (x_2, y_2)-plane) by a smooth curve gamma connecting r_1 to r_2. Precisely:\n\nLet gamma: R -\u003e R^2 be a smooth embedded curve in the (x_2, y_2)-plane such that:\n- gamma(t) = t * r_1 for t \u003e= T (agrees with ray r_1 for large t),\n- gamma(t) = |t| * r_2 for t \u003c= -T (agrees with ray r_2 for large |t|),\n- gamma is a simple (non-self-intersecting) curve for all t,\n- gamma(t) != 0 for all t (the curve avoids the origin — this is the \"rounding\").\n\nWrite gamma(t) = (gamma_1(t), gamma_2(t)). Define the smoothed surface:\n\n  L_e = {(x_1, gamma_1(s), 0, gamma_2(s)) : x_1 in R, s in R}.\n\nSTEP 4 (LAGRANGIAN VERIFICATION). Compute the pullback of omega to L_e. The surface is parametrized by (x_1, s), with embedding:\n\n  iota(x_1, s) = (x_1, gamma_1(s), 0, gamma_2(s)).\n\nThe differentials are:\n  d(x_1) = dx_1,  d(y_1) = d(0) = 0,\n  d(x_2) = gamma_1'(s) ds,  d(y_2) = gamma_2'(s) ds.\n\nPullback:\n  iota*(omega) = iota*(dx_1 ^ dy_1) + iota*(dx_2 ^ dy_2)\n               = dx_1 ^ 0 + gamma_1'(s) ds ^ gamma_2'(s) ds\n               = 0 + gamma_1'(s) gamma_2'(s) (ds ^ ds)\n               = 0.\n\nThe pullback is IDENTICALLY ZERO for ANY smooth curve gamma. The smoothed surface L_e is exactly Lagrangian. No Moser correction, no symplectic error, no perturbation argument needed. The Lagrangian condition is automatic because: (i) y_1 = 0 everywhere kills dx_1 ^ dy_1, and (ii) x_2 and y_2 both depend on the single parameter s, so dx_2 ^ dy_2 = (function) * ds ^ ds = 0.\n\nSTEP 5 (EMBEDDEDNESS). The map iota(x_1, s) = (x_1, gamma_1(s), 0, gamma_2(s)) is an embedding if and only if:\n(a) gamma is an embedding (injective immersion): gamma(s_1) = gamma(s_2) implies s_1 = s_2, and gamma'(s) != 0 for all s.\n(b) This is automatic: choose gamma to be a simple smooth curve. For example, take gamma to be a convex curve in the (x_2, y_2)-plane that rounds the corner of the V at the origin. Since the two rays r_1 and r_2 span distinct directions, a smooth convex interpolation exists and is automatically injective.\n\nThe map iota is then injective (x_1 is recovered from the first coordinate, s from the remaining coordinates via gamma), and its differential has rank 2 everywhere (partial_{x_1} iota = (1,0,0,0) and partial_s iota = (0, gamma_1'(s), 0, gamma_2'(s)) are linearly independent since gamma' != 0).\n\nTherefore L_e is an embedded smooth Lagrangian surface.\n\nSTEP 6 (COMPACT SUPPORT ALONG THE EDGE AND TRANSITION ZONES). The construction of Step 3 uses a CONSTANT profile gamma, independent of x_1. In this form, L_e replaces the V-shape everywhere along the edge. For the purposes of Node 1.4, this is the core local construction.\n\nFor the global assembly (Node 1.5, Phase B), the profile must be made x_1-dependent in order to:\n(a) match the vertex smoothing from Node 1.3 at edge endpoints (where edges meet vertex balls B_delta(v)),\n(b) transition from the smoothed profile back to the original PL profile if needed.\n\nWhen the profile gamma depends on x_1, the Lagrangian condition is no longer automatically satisfied: the pullback acquires a cross-term from the x_1-dependence of gamma. Specifically, if iota(x_1, s) = (x_1, gamma_1(x_1, s), 0, gamma_2(x_1, s)), then:\n\n  iota*(omega) = dx_1 ^ d(0) + (partial_{x_1} gamma_1 dx_1 + partial_s gamma_1 ds) ^ (partial_{x_1} gamma_2 dx_1 + partial_s gamma_2 ds)\n               = (partial_{x_1} gamma_1 * partial_s gamma_2 - partial_s gamma_1 * partial_{x_1} gamma_2) dx_1 ^ ds.\n\nThis vanishes iff partial_{x_1} gamma_1 * partial_s gamma_2 = partial_s gamma_1 * partial_{x_1} gamma_2, which is the condition that the x_1-flow preserves the curve gamma up to reparametrization. Equivalently, the x_1-deformation of gamma must be through REPARAMETRIZATIONS of the curve (not deformations of its image). This is a nontrivial matching condition.\n\nRESOLUTION: The endpoint matching and x_1-dependent transition are properly the concern of Node 1.5 (global assembly). Node 1.4 establishes the LOCAL edge smoothing with constant profile: for any finite segment of the edge bounded away from vertices, the V-shape can be replaced by a smooth Lagrangian with the same boundary. Node 1.5 handles the transition zones where the edge meets vertex balls. This separation is appropriate because:\n- The constant-profile construction is the core mathematical content (Lagrangian condition for free).\n- The transition matching requires information about the vertex smoothing (Node 1.3 output) that Node 1.4 should not assume.\n\nSTEP 7 (HAMILTONIAN ISOTOPY). Define a 1-parameter family of curves gamma_t (t in [0,1]) in the (x_2, y_2)-plane:\n- gamma_0 is the V-shape (two rays r_1, r_2 meeting at the origin).\n- gamma_1 = gamma (the smooth rounded curve from Step 3).\n- Each gamma_t is a simple curve coinciding with r_1 and r_2 outside a compact set.\n\nFor each t, the surface L_t = {(x_1, gamma_t(s), 0) : x_1, s in R} is Lagrangian (by the computation of Step 4, which is independent of the choice of curve). So {L_t}_{t in [0,1]} is a Lagrangian isotopy from K (restricted to the edge region) to L_e.\n\nSince we work in R^4 (which is simply connected with H^1(R^4; R) = 0), every Lagrangian isotopy with compact support is Hamiltonian: the flux homomorphism vanishes identically. The isotopy {L_t} has compact support in the (x_2, y_2)-plane (gamma_t agrees with the V-shape outside a compact set), so it is generated by a Hamiltonian H_t that is compactly supported in the transverse directions. The x_1-direction is untouched (the profile is constant in x_1).\n\nMore explicitly: the isotopy velocity field X_t is tangent to the (x_2, y_2)-plane (since only the profile varies) and is Hamiltonian because iota_{X_t} omega = -dH_t for a function H_t depending only on (x_2, y_2). The function H_t has compact support in the (x_2, y_2)-plane (the isotopy is stationary outside a compact region where gamma_t differs from the V-shape).\n\nSTEP 8 (COMPATIBILITY WITH NODE 1.2 AND NODE 1.3).\n\nDependency on Node 1.2: The edge configuration (2 Lagrangian faces sharing an edge with distinct tangent planes) is established by Node 1.2, Step 1 (consecutive planes share exactly a line). The linear symplectic normalization (Step 2 above) uses only the Sp(4,R) structure of (R^4, omega_std), consistent with the coordinate conventions of Node 1.2.\n\nInterface with Node 1.3: Node 1.3 constructs vertex smoothings via cotangent generating functions, producing a smooth Lagrangian L_v inside B_delta(v) that agrees with K on the boundary. At each vertex v, four edge rays emerge from B_delta(v). On the boundary of B_delta(v), the surface is still piecewise-linear (the cotangent generating function equals the PL generating function for |X| \u003e= delta). The edge smoothing (this node) applies to the portion of each edge OUTSIDE all vertex balls. In the constant-profile construction, L_e already matches K outside the smoothing region, ensuring compatibility. The detailed transition within the overlap region (where the vertex ball boundary meets the edge smoothing region) is handled by Node 1.5.\n\nWORKED EXAMPLE. In Node 1.2's standard form (gamma = 0):\n  Pi_1 = span{e_1, e_2}, Pi_2 = span{e_1, e_4}.\n  Shared edge: e_{12} = R*e_1 (the x_1-axis).\n\nStep 2 gives: e_1 along x_1-axis, Pi_1 = {y_1 = 0, y_2 = 0}, Pi_2 = {y_1 = 0, x_2 = 0}.\nFace profiles in (x_2, y_2)-plane: r_1 = (1, 0) (positive x_2-axis), r_2 = (0, 1) (positive y_2-axis). Angle theta = pi/2.\n\nThe V-shape is {(t, 0) : t \u003e= 0} union {(0, t) : t \u003e= 0} (two perpendicular rays in the first quadrant of the (x_2, y_2)-plane).\n\nA smooth replacement: gamma(s) = (cos(s), sin(s)) for s in [0, pi/2], extended linearly along the rays. Or more explicitly: parametrize the smoothed profile as a quarter-circle of radius epsilon near the origin, transitioning to the rays for |s| large. The surface L_e = {(x_1, gamma_1(s), 0, gamma_2(s))} is a smooth embedded Lagrangian.\n\nEND OF PROOF.\n\nSUMMARY. The edge smoothing is an explicit construction:\n(1) Linear symplectic change of coordinates places the edge along x_1 and both faces in {y_1 = 0}.\n(2) Replace the V-shaped profile in the (x_2, y_2)-plane with any smooth embedded curve.\n(3) The resulting surface is EXACTLY Lagrangian (omega pulls back to zero identically).\n(4) The surface is embedded (graph of x_1 cross embedded curve).\n(5) The isotopy from V to smooth curve is Hamiltonian with compact support.\n(6) Endpoint compatibility with vertex smoothings is deferred to Node 1.5.","owner":"prover-1.4"}