{"type":"challenge_raised","timestamp":"2026-02-11T10:24:00.220856875Z","challenge_id":"ch-9400ca28248da050","node_id":"1.5","target":"inference","reason":"STEP 4 EXTENDED RADIUS: PHASE A AT |X|=delta+eta STILL HAS F_final=F_PL, CREATING A CREASE. Step 4 proposes replacing phi(|X|/delta) with phi(|X|/(delta+eta)) in Node 1.3's formula. With this modification: for |X| \u003e= delta+eta, F_final = F_PL (PL surface with creases along edge projections); for |X| \u003c= (delta+eta)/2, F_final = F_smooth. The claim is: 'The surface is smooth everywhere inside B_{delta+eta}(v).' But F_final in the annular region (delta+eta)/2 \u003c= |X| \u003c= delta+eta is F_PL + phi(|X|/(delta+eta)) * D(X). Near the outer boundary |X| = delta+eta, phi is tapering to 0 and D(X) is the smooth correction to the crease. As phi -\u003e 0, the correction D vanishes, and F_final -\u003e F_PL which has creases. The surface transitions from smooth (where phi=1) to creased (where phi=0) through a smooth interpolation. IN THE ANNULAR REGION ITSELF, F_final is smooth because it is a smooth combination of smooth functions (phi is smooth, D is smooth away from origin, and the annular region is away from origin). So F_final is indeed smooth for (delta+eta)/2 \u003c= |X| \u003c= delta+eta. AT the boundary |X| = delta+eta, F_final = F_PL exactly. The crease reappears AT the boundary. The claim 'smooth everywhere inside B_{delta+eta}(v)' is correct (the boundary is not inside). But Phase B must then handle the crease exactly at |X| = delta+eta. If Phase B's chi_long = 0 at |X| = delta+eta (as stated), then Phase B does NOT smooth the crease there, and the crease persists. This means the surface L has a crease at |X| = delta+eta along the edge. The matching argument fails: Phase A leaves a crease at its support boundary, and Phase B does not start acting until distance epsilon beyond that boundary. There is a RESIDUAL CREASE at |X| = delta+eta that neither phase smooths.","severity":"major","raised_by":""}