{"type":"node_amended","timestamp":"2026-02-11T09:17:47.208357797Z","node_id":"1.6","previous_statement":"Hamiltonian isotopy verification: The Lagrangian isotopy K_t is automatically Hamiltonian. Since (R^4, omega_std) is exact symplectic with primitive lambda = (1/2)(x_1 dy_1 - y_1 dx_1 + x_2 dy_2 - y_2 dx_2) and H^1(R^4;R)=0, the flux class of any compactly supported Lagrangian isotopy vanishes identically (Banyaga). Each local smoothing is generated by a compactly supported Hamiltonian, and the finite composition of such Hamiltonians (vertex surgeries, then edge roundings) is itself Hamiltonian.","new_statement":"Hamiltonian isotopy verification (Lemma). Depends on: Node 1.3 (vertex smoothing via cotangent generating functions), Node 1.4 (edge smoothing via Lagrangian rounding), Node 1.5 (global assembly). Inference type: lemma.\n\nSTATEMENT. The Lagrangian isotopy K_t constructed in Nodes 1.3–1.5 is Hamiltonian. That is, there exists a (possibly time-dependent) Hamiltonian H_t: R^4 -\u003e R such that the flow phi_t^H satisfies phi_t^H(K) = K_t for t in [0,1], with K_0 = K and K_1 smooth Lagrangian.\n\nPROOF.\n\nThe argument proceeds in three steps: (1) each local smoothing is Hamiltonian by construction, (2) the global Hamiltonian is a well-defined sum, (3) the Hamiltonian flow is complete (including the non-compact case).\n\nSTEP 1 (LOCAL SMOOTHINGS ARE HAMILTONIAN BY CONSTRUCTION).\n\nStep 1a (Vertex smoothing — Node 1.3). At each vertex v, Node 1.3 constructs a 1-parameter family of generating functions G_t(X) = F_PL(X) + t * phi(|X|/delta) * D(X), where D = F_smooth - F_PL is the smoothing correction and phi is a radial cutoff with phi = 0 for |X| \u003e= delta. The family L_t = graph(dG_t) is a Lagrangian isotopy from K (at t=0) to a smooth Lagrangian (at t=1). The generating Hamiltonian is:\n\n  H_v(X, Y) = phi(|X|/delta) * D(X),\n\nevaluated at points (X, Y) on L_t. This Hamiltonian is:\n- independent of t,\n- compactly supported in B_delta(v) (since phi(|X|/delta) = 0 for |X| \u003e= delta),\n- smooth (D is smooth by the homogeneity argument in Node 1.3, Step 5(d)).\n\nStep 1b (Edge smoothing — Node 1.4). Along each edge e, Node 1.4 replaces the V-shaped transverse profile with a smooth curve gamma_epsilon(t) in the (x_2, y_2)-plane, producing L_epsilon = {(x_1, 0, gamma_epsilon(t))}. By the explicit computation in Node 1.4, this is Lagrangian for ANY smooth profile: the pullback omega|_{L_epsilon} = dx_1 ^ dy_1 + dx_2 ^ dy_2 = 0 + (single-parameter dependence in (x_2,y_2)) = 0.\n\nThe smoothing isotopy interpolates: gamma_epsilon^s = (1-s) * gamma_V + s * gamma_epsilon for s in [0,1], where gamma_V is the V-shaped profile and gamma_epsilon is the smooth profile. Each gamma_epsilon^s produces a Lagrangian surface (the Lagrangian condition depends only on the profile being a curve, not on which curve). The generating Hamiltonian H_e is determined by:\n\n  omega(dL_s/ds, .) = dH_e on L_s.\n\nFor a FINITE edge (connecting two vertices v, w), the smoothing requires a cutoff chi(x_1) along the edge to transition between the already-smoothed vertex regions and the edge interior. This cutoff breaks the product structure and introduces a symplectic error of order O(epsilon * |chi'|). By the Weinstein Lagrangian neighborhood theorem (applied to the nearly-Lagrangian surface), there exists a nearby exact Lagrangian surface, and the correction is generated by a compactly supported Hamiltonian H_e^corr with supp(H_e^corr) contained in the tubular neighborhood of e (outside the vertex balls B_delta(v), B_delta(w)). The total edge Hamiltonian H_e + H_e^corr is compactly supported for finite edges.\n\nFor an INFINITE edge (a ray or line extending to infinity in non-compact K), the profile replacement is uniform along the edge: gamma_epsilon is the same curve at every x_1. No cutoff chi(x_1) is needed along the infinite direction. The Hamiltonian H_e(x_1, x_2, y_1, y_2) depends only on (x_2, y_2) (transverse coordinates), not on x_1. In particular:\n- H_e is NOT compactly supported (it extends to infinity along x_1),\n- H_e IS bounded and has bounded derivatives of all orders (the profile replacement is a fixed smooth deformation in the compact (x_2, y_2)-directions),\n- H_e has bounded transverse support: supp(H_e) is contained in the strip {|x_2|^2 + |y_2|^2 \u003c r_epsilon^2} for some finite r_epsilon.\n\nSTEP 2 (GLOBAL HAMILTONIAN VIA SUMMATION).\n\nFollowing the two-phase assembly of Node 1.5:\n\nPhase A (vertices): H_A = sum_v H_v. All vertex Hamiltonians H_v have disjoint supports (supp(H_v) subset B_delta(v), and the balls are disjoint by Node 1.5). Therefore {H_v, H_w} = 0 for v != w (Poisson bracket vanishes for functions with disjoint support). The sum H_A is a well-defined smooth function, and its Hamiltonian flow is:\n\n  phi_t^{H_A} = composition of phi_t^{H_v} over all v = simultaneous application of all vertex smoothings.\n\nThis uses the standard fact: if {H_1, H_2} = 0, then phi_t^{H_1 + H_2} = phi_t^{H_1} o phi_t^{H_2} (McDuff-Salamon, Introduction to Symplectic Topology, 3rd ed., Proposition 5.4.2).\n\nFor compact K (finitely many vertices): H_A is a finite sum of compactly supported functions, hence compactly supported.\n\nFor non-compact K (infinitely many vertices): H_A is a locally finite sum (each point of R^4 belongs to at most one B_delta(v)), so H_A is smooth and locally agrees with a single H_v (or is zero).\n\nPhase B (edges): After Phase A, the surface phi_1^{H_A}(K) has smooth vertex regions but singular edges. Define H_B = sum_e H_e (sum over all edges). The edge Hamiltonians have pairwise disjoint supports (tubular neighborhoods of distinct edges outside vertex balls are disjoint, by the locally finite property of the polyhedral complex and a sufficiently small choice of tubular radius). So {H_e, H_f} = 0 for distinct edges e, f. The sum H_B is well-defined (locally finite).\n\nThe total smoothing is generated by the concatenated Hamiltonian:\n  H_t = H_A for t in [0, 1/2] (rescaled to [0,1]),\n  H_t = (phi_1^{H_A})^* H_B for t in [1/2, 1] (rescaled),\nwhere (phi_1^{H_A})^* H_B denotes H_B composed with the inverse of the Phase A flow. This is a standard concatenation of Hamiltonian isotopies (the composition of Hamiltonian diffeomorphisms is Hamiltonian; see McDuff-Salamon, 3rd ed., Proposition 5.4.6).\n\nSTEP 3 (COMPLETENESS OF THE HAMILTONIAN FLOW).\n\nCase 1: Compact K. The polyhedral complex K has finitely many cells. All vertices lie in a bounded region, all edges are finite (connecting pairs of vertices). Every H_v and H_e is compactly supported. Their sums H_A, H_B are compactly supported. Compactly supported Hamiltonian vector fields on R^4 are complete (the flow exists for all t in R), by the standard ODE existence theorem applied to a vector field that vanishes outside a compact set (McDuff-Salamon, 3rd ed., Section 5.4). This is the primary case.\n\nCase 2: Non-compact K with finitely many vertices but infinite edges. All H_v are compactly supported; H_A is compactly supported. For infinite edges, H_e is not compactly supported but has the following properties:\n  (i) H_e is bounded: |H_e| \u003c= C (the profile deformation has finite energy).\n  (ii) The Hamiltonian vector field X_{H_e} is bounded: |X_{H_e}| \u003c= C' (derivatives of H_e are bounded).\n  (iii) X_{H_e} points only in the transverse (x_2, y_2)-directions (since H_e is x_1-independent, the x_1 and y_1 components of X_{H_e} vanish).\n\nA bounded Hamiltonian vector field on R^4 has a complete flow (the integral curves cannot escape to infinity in finite time because |dx/dt| \u003c= C'). Therefore H_B generates a well-defined Hamiltonian diffeomorphism phi_1^{H_B}: R^4 -\u003e R^4.\n\nReference: For completeness of flows of bounded vector fields, see Lang, Differential and Riemannian Manifolds, Theorem IV.1.6, or equivalently, the global existence theorem for ODEs with globally Lipschitz right-hand sides.\n\nCase 3: Non-compact K with infinitely many vertices. Use an exhaustion argument. Let K_n = K cap B_n(0) (intersection with balls of radius n). Each K_n is a compact polyhedral surface with boundary (possibly with fewer than 4 faces at boundary vertices; treat boundary vertices by extending K_n slightly beyond B_n(0)). By Case 1, K_n admits a Hamiltonian smoothing phi_n with Hamiltonian H_n supported in B_{n+1}(0). On any compact subset of R^4, the sequence H_n stabilizes for n large enough (by local finiteness of the polyhedral structure). The limit H_infinity = lim H_n is a well-defined smooth function on R^4, and its flow is the limit of the flows phi_n (which stabilize on compact sets). The resulting flow phi_infinity is a Hamiltonian diffeomorphism smoothing all of K.\n\nSTEP 4 (FLUX VANISHING — CORRECT FORMULATION).\n\nThe Lagrangian flux of an isotopy L_t is an element of H^1(L_0; R), defined by:\n  Flux({L_t})(gamma) = integral_0^1 (integral_gamma omega(V_t, .)) dt,\nwhere V_t = dL_t/dt is the variation vector field and gamma is a loop in L_0.\n\nIMPORTANT DISTINCTION: The Lagrangian flux lives in H^1(L_0; R), NOT in H^1(R^4; R). These are different cohomology groups. The vanishing of H^1(R^4; R) = 0 does not directly imply the vanishing of the Lagrangian flux when H^1(L_0; R) != 0.\n\nHowever, this distinction is MOOT for our construction, because our isotopy is Hamiltonian BY CONSTRUCTION (Steps 1-3 above). Here is why flux vanishes independently:\n\n(a) Construction-based argument (primary): The isotopy K_t = phi_t^H(K) is generated by an ambient Hamiltonian vector field X_H on R^4. For any Hamiltonian isotopy, the Lagrangian flux vanishes: the variation vector field V_t = X_H|_{L_t} is Hamiltonian, so i_{V_t} omega = dH_t is exact on R^4 and hence exact when restricted to L_t. The flux integral over any loop gamma becomes integral_gamma dH_t = 0.\n\n(b) Exactness argument (secondary, independent verification): Each K_t in the isotopy is an exact Lagrangian: the Liouville 1-form lambda = sum x_i dy_i restricts to an exact 1-form on K_t. This is because K_t = graph(dG_t) in cotangent coordinates (from the generating function construction of Node 1.3), and the pullback of lambda to graph(dG_t) is dG_t, which is exact. For the edge smoothing, the product structure L_epsilon = {(x_1, 0, gamma(t))} satisfies lambda|_{L_epsilon} = x_1 * 0 + gamma_1(t) * gamma_2'(t) dt, which is exact in t. An isotopy through exact Lagrangians has vanishing flux.\n\nSTEP 5 (ATTRIBUTION AND REFERENCES).\n\nThe key facts used are:\n(1) Hamiltonian vector fields with compact support are complete: standard ODE theory; see McDuff-Salamon, Introduction to Symplectic Topology, 3rd ed., Section 5.4.\n(2) Bounded Hamiltonian vector fields on R^{2n} are complete: Global existence for ODEs with globally Lipschitz vector fields; see Lang, Differential and Riemannian Manifolds, Thm IV.1.6.\n(3) Composition/concatenation of Hamiltonian isotopies is Hamiltonian: McDuff-Salamon, 3rd ed., Prop. 5.4.6.\n(4) Hamiltonians with disjoint support Poisson-commute, and their sum generates the simultaneous flow: McDuff-Salamon, 3rd ed., Prop. 5.4.2.\n(5) Flux homomorphism for symplectomorphisms: Symp_0^c(M)/Ham^c(M) -\u003e H^1(M; R); when H^1(M; R) = 0, every compactly supported symplectomorphism isotopic to identity is Hamiltonian. Originally due to Banyaga (1978) for compact manifolds; extended to compactly supported diffeomorphisms on non-compact manifolds in McDuff-Salamon, 3rd ed., Theorem 10.2.5. We do NOT use this abstract result; it is mentioned only as additional confirmation.\n(6) Lagrangian flux: H^1(L; R)-valued invariant of Lagrangian isotopies, DISTINCT from the ambient symplectomorphism flux in (5). See Auroux, A Beginner's Introduction to Fukaya Categories, Section 2, or Solomon, Involutions, obstructions, and mirror symmetry.\n\nEND OF PROOF.","owner":"prover-1.6"}