{"type":"node_amended","timestamp":"2026-02-11T12:09:32.993279715Z","node_id":"1.6","previous_statement":"Hamiltonian isotopy verification (Lemma). Depends on: Node 1.3 (vertex smoothing via cotangent generating functions), Node 1.4 (edge smoothing via Lagrangian rounding), Node 1.5 (global assembly). Inference type: lemma.\n\nSTATEMENT. The Lagrangian isotopy K_t constructed in Nodes 1.3–1.5 is Hamiltonian. That is, there exists a (possibly time-dependent) Hamiltonian H_t: R^4 -\u003e R such that the flow phi_t^H satisfies phi_t^H(K) = K_t for t in [0,1], with K_0 = K and K_1 smooth Lagrangian.\n\nPROOF.\n\nThe argument proceeds in three steps: (1) each local smoothing is Hamiltonian by construction, (2) the global Hamiltonian is a well-defined sum, (3) the Hamiltonian flow is complete (including the non-compact case).\n\nSTEP 1 (LOCAL SMOOTHINGS ARE HAMILTONIAN BY CONSTRUCTION).\n\nStep 1a (Vertex smoothing — Node 1.3). At each vertex v, Node 1.3 constructs a 1-parameter family of generating functions G_t(X) = F_PL(X) + t * phi(|X|/delta) * D(X), where D = F_smooth - F_PL is the smoothing correction and phi is a radial cutoff with phi = 0 for |X| \u003e= delta. The family L_t = graph(dG_t) is a Lagrangian isotopy from K (at t=0) to a smooth Lagrangian (at t=1). The generating Hamiltonian is:\n\n  H_v(X, Y) = phi(|X|/delta) * D(X),\n\nevaluated at points (X, Y) on L_t. This Hamiltonian is:\n- independent of t,\n- compactly supported in B_delta(v) (since phi(|X|/delta) = 0 for |X| \u003e= delta),\n- smooth (D is smooth by the homogeneity argument in Node 1.3, Step 5(d)).\n\nStep 1b (Edge smoothing — Node 1.4). Along each edge e, Node 1.4 replaces the V-shaped transverse profile with a smooth curve gamma_epsilon(t) in the (x_2, y_2)-plane, producing L_epsilon = {(x_1, 0, gamma_epsilon(t))}. By the explicit computation in Node 1.4, this is Lagrangian for ANY smooth profile: the pullback omega|_{L_epsilon} = dx_1 ^ dy_1 + dx_2 ^ dy_2 = 0 + (single-parameter dependence in (x_2,y_2)) = 0.\n\nThe smoothing isotopy interpolates: gamma_epsilon^s = (1-s) * gamma_V + s * gamma_epsilon for s in [0,1], where gamma_V is the V-shaped profile and gamma_epsilon is the smooth profile. Each gamma_epsilon^s produces a Lagrangian surface (the Lagrangian condition depends only on the profile being a curve, not on which curve). The generating Hamiltonian H_e is determined by:\n\n  omega(dL_s/ds, .) = dH_e on L_s.\n\nFor a FINITE edge (connecting two vertices v, w), the smoothing requires a cutoff chi(x_1) along the edge to transition between the already-smoothed vertex regions and the edge interior. This cutoff breaks the product structure and introduces a symplectic error of order O(epsilon * |chi'|). By the Weinstein Lagrangian neighborhood theorem (applied to the nearly-Lagrangian surface), there exists a nearby exact Lagrangian surface, and the correction is generated by a compactly supported Hamiltonian H_e^corr with supp(H_e^corr) contained in the tubular neighborhood of e (outside the vertex balls B_delta(v), B_delta(w)). The total edge Hamiltonian H_e + H_e^corr is compactly supported for finite edges.\n\nFor an INFINITE edge (a ray or line extending to infinity in non-compact K), the profile replacement is uniform along the edge: gamma_epsilon is the same curve at every x_1. No cutoff chi(x_1) is needed along the infinite direction. The Hamiltonian H_e(x_1, x_2, y_1, y_2) depends only on (x_2, y_2) (transverse coordinates), not on x_1. In particular:\n- H_e is NOT compactly supported (it extends to infinity along x_1),\n- H_e IS bounded and has bounded derivatives of all orders (the profile replacement is a fixed smooth deformation in the compact (x_2, y_2)-directions),\n- H_e has bounded transverse support: supp(H_e) is contained in the strip {|x_2|^2 + |y_2|^2 \u003c r_epsilon^2} for some finite r_epsilon.\n\nSTEP 2 (GLOBAL HAMILTONIAN VIA SUMMATION).\n\nFollowing the two-phase assembly of Node 1.5:\n\nPhase A (vertices): H_A = sum_v H_v. All vertex Hamiltonians H_v have disjoint supports (supp(H_v) subset B_delta(v), and the balls are disjoint by Node 1.5). Therefore {H_v, H_w} = 0 for v != w (Poisson bracket vanishes for functions with disjoint support). The sum H_A is a well-defined smooth function, and its Hamiltonian flow is:\n\n  phi_t^{H_A} = composition of phi_t^{H_v} over all v = simultaneous application of all vertex smoothings.\n\nThis uses the standard fact: if {H_1, H_2} = 0, then phi_t^{H_1 + H_2} = phi_t^{H_1} o phi_t^{H_2} (McDuff-Salamon, Introduction to Symplectic Topology, 3rd ed., Proposition 5.4.2).\n\nFor compact K (finitely many vertices): H_A is a finite sum of compactly supported functions, hence compactly supported.\n\nFor non-compact K (infinitely many vertices): H_A is a locally finite sum (each point of R^4 belongs to at most one B_delta(v)), so H_A is smooth and locally agrees with a single H_v (or is zero).\n\nPhase B (edges): After Phase A, the surface phi_1^{H_A}(K) has smooth vertex regions but singular edges. Define H_B = sum_e H_e (sum over all edges). The edge Hamiltonians have pairwise disjoint supports (tubular neighborhoods of distinct edges outside vertex balls are disjoint, by the locally finite property of the polyhedral complex and a sufficiently small choice of tubular radius). So {H_e, H_f} = 0 for distinct edges e, f. The sum H_B is well-defined (locally finite).\n\nThe total smoothing is generated by the concatenated Hamiltonian:\n  H_t = H_A for t in [0, 1/2] (rescaled to [0,1]),\n  H_t = (phi_1^{H_A})^* H_B for t in [1/2, 1] (rescaled),\nwhere (phi_1^{H_A})^* H_B denotes H_B composed with the inverse of the Phase A flow. This is a standard concatenation of Hamiltonian isotopies (the composition of Hamiltonian diffeomorphisms is Hamiltonian; see McDuff-Salamon, 3rd ed., Proposition 5.4.6).\n\nSTEP 3 (COMPLETENESS OF THE HAMILTONIAN FLOW).\n\nCase 1: Compact K. The polyhedral complex K has finitely many cells. All vertices lie in a bounded region, all edges are finite (connecting pairs of vertices). Every H_v and H_e is compactly supported. Their sums H_A, H_B are compactly supported. Compactly supported Hamiltonian vector fields on R^4 are complete (the flow exists for all t in R), by the standard ODE existence theorem applied to a vector field that vanishes outside a compact set (McDuff-Salamon, 3rd ed., Section 5.4). This is the primary case.\n\nCase 2: Non-compact K with finitely many vertices but infinite edges. All H_v are compactly supported; H_A is compactly supported. For infinite edges, H_e is not compactly supported but has the following properties:\n  (i) H_e is bounded: |H_e| \u003c= C (the profile deformation has finite energy).\n  (ii) The Hamiltonian vector field X_{H_e} is bounded: |X_{H_e}| \u003c= C' (derivatives of H_e are bounded).\n  (iii) X_{H_e} points only in the transverse (x_2, y_2)-directions (since H_e is x_1-independent, the x_1 and y_1 components of X_{H_e} vanish).\n\nA bounded Hamiltonian vector field on R^4 has a complete flow (the integral curves cannot escape to infinity in finite time because |dx/dt| \u003c= C'). Therefore H_B generates a well-defined Hamiltonian diffeomorphism phi_1^{H_B}: R^4 -\u003e R^4.\n\nReference: For completeness of flows of bounded vector fields, see Lang, Differential and Riemannian Manifolds, Theorem IV.1.6, or equivalently, the global existence theorem for ODEs with globally Lipschitz right-hand sides.\n\nCase 3: Non-compact K with infinitely many vertices. Use an exhaustion argument. Let K_n = K cap B_n(0) (intersection with balls of radius n). Each K_n is a compact polyhedral surface with boundary (possibly with fewer than 4 faces at boundary vertices; treat boundary vertices by extending K_n slightly beyond B_n(0)). By Case 1, K_n admits a Hamiltonian smoothing phi_n with Hamiltonian H_n supported in B_{n+1}(0). On any compact subset of R^4, the sequence H_n stabilizes for n large enough (by local finiteness of the polyhedral structure). The limit H_infinity = lim H_n is a well-defined smooth function on R^4, and its flow is the limit of the flows phi_n (which stabilize on compact sets). The resulting flow phi_infinity is a Hamiltonian diffeomorphism smoothing all of K.\n\nSTEP 4 (FLUX VANISHING — CORRECT FORMULATION).\n\nThe Lagrangian flux of an isotopy L_t is an element of H^1(L_0; R), defined by:\n  Flux({L_t})(gamma) = integral_0^1 (integral_gamma omega(V_t, .)) dt,\nwhere V_t = dL_t/dt is the variation vector field and gamma is a loop in L_0.\n\nIMPORTANT DISTINCTION: The Lagrangian flux lives in H^1(L_0; R), NOT in H^1(R^4; R). These are different cohomology groups. The vanishing of H^1(R^4; R) = 0 does not directly imply the vanishing of the Lagrangian flux when H^1(L_0; R) != 0.\n\nHowever, this distinction is MOOT for our construction, because our isotopy is Hamiltonian BY CONSTRUCTION (Steps 1-3 above). Here is why flux vanishes independently:\n\n(a) Construction-based argument (primary): The isotopy K_t = phi_t^H(K) is generated by an ambient Hamiltonian vector field X_H on R^4. For any Hamiltonian isotopy, the Lagrangian flux vanishes: the variation vector field V_t = X_H|_{L_t} is Hamiltonian, so i_{V_t} omega = dH_t is exact on R^4 and hence exact when restricted to L_t. The flux integral over any loop gamma becomes integral_gamma dH_t = 0.\n\n(b) Exactness argument (secondary, independent verification): Each K_t in the isotopy is an exact Lagrangian: the Liouville 1-form lambda = sum x_i dy_i restricts to an exact 1-form on K_t. This is because K_t = graph(dG_t) in cotangent coordinates (from the generating function construction of Node 1.3), and the pullback of lambda to graph(dG_t) is dG_t, which is exact. For the edge smoothing, the product structure L_epsilon = {(x_1, 0, gamma(t))} satisfies lambda|_{L_epsilon} = x_1 * 0 + gamma_1(t) * gamma_2'(t) dt, which is exact in t. An isotopy through exact Lagrangians has vanishing flux.\n\nSTEP 5 (ATTRIBUTION AND REFERENCES).\n\nThe key facts used are:\n(1) Hamiltonian vector fields with compact support are complete: standard ODE theory; see McDuff-Salamon, Introduction to Symplectic Topology, 3rd ed., Section 5.4.\n(2) Bounded Hamiltonian vector fields on R^{2n} are complete: Global existence for ODEs with globally Lipschitz vector fields; see Lang, Differential and Riemannian Manifolds, Thm IV.1.6.\n(3) Composition/concatenation of Hamiltonian isotopies is Hamiltonian: McDuff-Salamon, 3rd ed., Prop. 5.4.6.\n(4) Hamiltonians with disjoint support Poisson-commute, and their sum generates the simultaneous flow: McDuff-Salamon, 3rd ed., Prop. 5.4.2.\n(5) Flux homomorphism for symplectomorphisms: Symp_0^c(M)/Ham^c(M) -\u003e H^1(M; R); when H^1(M; R) = 0, every compactly supported symplectomorphism isotopic to identity is Hamiltonian. Originally due to Banyaga (1978) for compact manifolds; extended to compactly supported diffeomorphisms on non-compact manifolds in McDuff-Salamon, 3rd ed., Theorem 10.2.5. We do NOT use this abstract result; it is mentioned only as additional confirmation.\n(6) Lagrangian flux: H^1(L; R)-valued invariant of Lagrangian isotopies, DISTINCT from the ambient symplectomorphism flux in (5). See Auroux, A Beginner's Introduction to Fukaya Categories, Section 2, or Solomon, Involutions, obstructions, and mirror symmetry.\n\nEND OF PROOF.","new_statement":"Hamiltonian isotopy verification (Lemma). Depends on: Node 1.3 (vertex smoothing via cotangent generating functions), Node 1.4 (edge smoothing via Lagrangian rounding), Node 1.5 (global assembly). Inference type: lemma.\n\nSTATEMENT. The Lagrangian isotopy K_t constructed in Nodes 1.3–1.5 is Hamiltonian. That is, there exists a (possibly time-dependent) Hamiltonian H_t: R^4 -\u003e R such that the flow phi_t^H satisfies phi_t^H(K) = K_t for t in [0,1], with K_0 = K and K_1 smooth Lagrangian.\n\nPROOF.\n\nThe argument proceeds in four steps: (1) each local smoothing is Hamiltonian by construction, (2) the global Hamiltonian is a well-defined sum with smooth time reparametrization for concatenation, (3) the Hamiltonian flow is complete (including the non-compact case), (4) the Lagrangian flux vanishes.\n\nSTEP 1 (LOCAL SMOOTHINGS ARE HAMILTONIAN BY CONSTRUCTION).\n\nStep 1a (Vertex smoothing — Node 1.3, two-zone construction). At each vertex v, Node 1.3 (rewritten, Session 5) constructs a smooth generating function via a TWO-ZONE construction:\n\n  F_smooth(X) = F^{(epsilon)}(X) = chi(|X|/epsilon) * F_angular(X),\n\nwhere chi: R -\u003e [0,1] is smooth with chi(t) = 0 for t \u003c= 1, chi(t) = 1 for t \u003e= 2 (flat at both transitions), F_angular(X) = sum_i rho_i(theta(X)) * (1/2) X^T A_i X is smooth on R^2 \\ {0}, and epsilon = delta/8.\n\nSMOOTHNESS OF F_smooth: (i) For |X| \u003c epsilon: F_smooth = 0, trivially C^infinity. All derivatives are zero at the origin, including D^2 F_smooth(0) = 0 (a well-defined zero bilinear form). (ii) For epsilon \u003c= |X| \u003c= 2*epsilon: product of two C^infinity functions (chi and F_angular, both smooth since |X| \u003e 0). (iii) For |X| \u003e 2*epsilon: F_smooth = F_angular, smooth. (iv) At the boundary |X| = epsilon: chi and all its derivatives vanish, so by Leibniz rule the product matches the zero function from the inner zone to all orders. The old challenges about angular partition of unity smoothness at the origin (ch-718a9a57ae5, ch-7313ffe7860, ch-34ff33544ce) are ALL RESOLVED by this construction: the inner zone avoids the origin entirely.\n\nThe Hamiltonian isotopy is generated by the shrinking-inner-zone family (Node 1.3, Step 8). Define G_t(X) = F^{(epsilon(t))}(X) = chi(|X|/epsilon(t)) * F_angular(X) where epsilon(t) = (delta/8)*tau(t) and tau is a smooth step function flat at t=0. The time-dependent Hamiltonian is H_v(X,Y) = (d/dt)G_t(X), which is:\n- supported on the shrinking annulus {epsilon(t) \u003c= |X| \u003c= 2*epsilon(t)},\n- smooth (for each fixed X != 0, H_v is nonzero only for t in a bounded interval, and vanishes near t = 0 since epsilon(t) \u003c |X|/2 for t small; at X = 0, H_v = 0 for all t),\n- compactly supported in B_delta(v) (since 2*epsilon(t) \u003c= delta/4 \u003c delta for all t).\n\nStep 1b (Edge smoothing — Node 1.4, constant-profile construction). Along each edge e, Node 1.4 replaces the V-shaped transverse profile with a smooth curve gamma(s) in the (x_2, y_2)-plane. In the edge-adapted Darboux coordinates (Node 1.4, Step 2), BOTH faces lie in the hyperplane {y_1 = 0}. The smoothed surface L_e = {(x_1, gamma_1(s), 0, gamma_2(s))} is exactly Lagrangian for ANY smooth curve gamma, because:\n\n  iota*(omega) = dx_1 ^ d(0) + gamma_1'(s) ds ^ gamma_2'(s) ds = 0.\n\nThe Lagrangian condition is AUTOMATIC from the product structure (dy_1 = 0 kills the first term; both x_2 and y_2 depend on the single parameter s, making ds ^ ds = 0). No correction of any kind is needed — in particular, NO Weinstein correction. Node 1.4 uses a CONSTANT profile along the edge (no x_1-dependent cutoff), and the Lagrangian condition holds EXACTLY.\n\nThe smoothing isotopy interpolates: gamma_t for t in [0,1], where gamma_0 is the V-shape and gamma_1 is the smooth curve. Each intermediate surface L_t = {(x_1, gamma_t(s), 0, gamma_t(s))} is Lagrangian. The Hamiltonian H_e generating this isotopy depends only on the transverse coordinates (x_2, y_2) and has compact support in the (x_2, y_2)-plane (the isotopy is stationary outside the region where gamma_t differs from the V-shape).\n\nFor FINITE edges: The profile replacement is constant along x_1 throughout the support of Phase B (which is bounded away from vertex balls, per Node 1.5 Step 5). The Lagrangian condition is automatic. The Hamiltonian H_e is supported in {d(p, e^o) \u003c epsilon_e} (a tubular neighborhood of the edge exterior, bounded away from vertex balls). Since the edge segment is compact, the support is compact.\n\nFor INFINITE edges (non-compact K): H_e depends only on (x_2, y_2) and is not compactly supported in x_1. However, H_e is bounded with bounded derivatives of all orders, and the Hamiltonian vector field X_{H_e} is tangent to the transverse (x_2, y_2)-plane with bounded norm. The flow is complete (see Step 3 Case 2 below).\n\nCOMPATIBILITY NOTE: The vertex-to-edge transition is handled by Node 1.5's two-phase sequential strategy. Phase A (vertex smoothing) smooths the surface inside vertex balls. Phase B (edge smoothing) acts on edge exteriors that are BOUNDED AWAY from vertex balls. At the Phase B support boundary near a vertex ball, H_B = 0 (Phase B does nothing), and the surface is already smooth from Phase A. At the other boundary (along edge interiors), the constant profile is applied. The junction is smooth because Phase A has already ensured the surface is smooth past the vertex ball boundary (Node 1.3 smoothes the crease in the annular zone), and Phase B begins acting only where the surface is still PL. See Node 1.5 Step 4 for the detailed matching argument.\n\nSTEP 2 (GLOBAL HAMILTONIAN VIA SUMMATION AND SMOOTH CONCATENATION).\n\nFollowing the two-phase assembly of Node 1.5:\n\nPhase A (vertices): H_A = sum_v H_v. All vertex Hamiltonians H_v have disjoint supports (supp(H_v) subset B_delta(v), and the balls are disjoint by Node 1.5 Step 1). Therefore {H_v, H_w} = 0 for v != w (Poisson bracket vanishes for functions with disjoint support). The sum H_A is a well-defined smooth function, and its Hamiltonian flow is the simultaneous application of all vertex smoothings:\n\n  phi_t^{H_A} = composition of phi_t^{H_v} over all v.\n\nReference: McDuff-Salamon, Introduction to Symplectic Topology, 3rd ed., Proposition 5.4.2.\n\nPhase B (edges): After Phase A, the surface phi_1^{H_A}(K) has smooth vertex regions but singular edges (outside vertex balls). Define H_B = sum_e H_e. The edge Hamiltonians have pairwise disjoint supports (tubular neighborhoods of distinct edge exteriors are disjoint by Node 1.5 Step 2). So {H_e, H_f} = 0 for distinct edges e, f. The sum H_B is well-defined.\n\nPHASE B SUPPORT CLARIFICATION: H_A is supported in the union of vertex balls; H_B is supported in the edge tubular neighborhoods, which are OUTSIDE the vertex balls. Therefore supp(H_A) and supp(H_B) are disjoint. In particular, on supp(H_B), the Phase A flow phi_1^{H_A} acts as the identity (since H_A = 0 there). Consequently, the pullback (phi_1^{H_A})* H_B = H_B circ (phi_1^{H_A})^{-1} equals H_B on supp(H_B) (because (phi_1^{H_A})^{-1} = id on supp(H_B)). So the concatenation formula simplifies: the pullback notation is technically correct but equals the identity transformation on the relevant support.\n\nSMOOTH TIME REPARAMETRIZATION FOR CONCATENATION. The naive concatenation H_t = 2*H_A on [0,1/2] then 2*H_B on [1/2,1] would be discontinuous at t = 1/2 (jumping from 2*H_A to 2*H_B). We use smooth bump reparametrization instead.\n\nLet rho: [0,1] -\u003e [0,1] be a smooth monotone function with:\n  rho(t) = 0 for t \u003c= 0,\n  rho(t) = 1 for t \u003e= 1,\n  rho flat at both endpoints (all derivatives zero at t = 0 and t = 1).\n\nSuch rho exists (e.g., rho(t) = exp(-1/t) / [exp(-1/t) + exp(-1/(1-t))] on (0,1)).\n\nDefine the time-reparametrized Hamiltonians:\n  H_t^{Phase A} = rho'(2t) * H_A,     for t in [0, 1/2],\n  H_t^{Phase B} = rho'(2t - 1) * H_B,  for t in [1/2, 1].\n\nThe concatenated Hamiltonian is:\n  H_t = H_t^{Phase A}   for t in [0, 1/2],\n  H_t = H_t^{Phase B}   for t in [1/2, 1].\n\nSMOOTHNESS AT t = 1/2: For t near 1/2 from below: H_t^{Phase A} = rho'(2t) * H_A. Since rho(s) = 1 for s \u003e= 1 (and we have 2t -\u003e 1 as t -\u003e 1/2), rho' and all higher derivatives vanish at s = 1. So H_t^{Phase A} and all its time-derivatives vanish as t -\u003e 1/2^-. For t near 1/2 from above: H_t^{Phase B} = rho'(2t-1) * H_B. Since rho(s) = 0 for s \u003c= 0 (and 2t-1 -\u003e 0 as t -\u003e 1/2), rho' and all higher derivatives vanish at s = 0. So H_t^{Phase B} and all its time-derivatives vanish as t -\u003e 1/2^+. Both pieces and all their time-derivatives are zero at t = 1/2. The concatenation is C^infinity in t.\n\nFLOW VERIFICATION: The Phase A flow integral_0^{1/2} rho'(2t) dt = (1/2) integral_0^1 rho'(s) ds = (1/2)(rho(1) - rho(0)) = 1/2. Wait — we need the flow to complete the full Phase A deformation by t = 1/2. The correct normalization: the flow of rho'(2t)*H_A on [0,1/2] is phi_{rho(2t)}^{H_A}. At t = 1/2: rho(1) = 1, so the flow is phi_1^{H_A}. Similarly, the flow of rho'(2t-1)*H_B on [1/2,1] is phi_{rho(2t-1)}^{H_B}. At t = 1: rho(1) = 1, so the flow is phi_1^{H_B}. The total flow at t = 1 is phi_1^{H_B} circ phi_1^{H_A}, which maps K to L.\n\nThis is the standard smooth concatenation of Hamiltonian isotopies; see McDuff-Salamon, 3rd ed., Proposition 5.4.6 (composition of Hamiltonian diffeomorphisms is Hamiltonian).\n\nSTEP 3 (COMPLETENESS OF THE HAMILTONIAN FLOW).\n\nCase 1: Compact K. All vertices lie in a bounded region, all edges are finite. Every H_v and H_e is compactly supported. Their sums H_A, H_B are compactly supported. Compactly supported Hamiltonian vector fields on R^4 are complete: the flow exists for all t in R. Reference: McDuff-Salamon, 3rd ed., Section 5.4.\n\nCase 2: Non-compact K with finitely many vertices but infinite edges. All H_v are compactly supported; H_A is compactly supported. For infinite edges, H_e is not compactly supported but: (i) H_e is bounded: |H_e| \u003c= C. (ii) X_{H_e} is bounded: |X_{H_e}| \u003c= C'. (iii) X_{H_e} is tangent to the transverse (x_2, y_2)-plane (H_e is x_1-independent). A bounded Hamiltonian vector field has a complete flow (integral curves cannot escape to infinity in finite time since |dx/dt| \u003c= C'). Reference: Lang, Differential and Riemannian Manifolds, Theorem IV.1.6.\n\nCase 3: Non-compact K with infinitely many vertices. Exhaustion argument. For each interior vertex v of K (a vertex whose star is fully contained in K), the Hamiltonian H_v is determined by the local geometry in B_delta(v). We define H_infinity = sum_v H_v + sum_e H_e as a locally finite sum.\n\nSTABILIZATION: For any compact subset S of R^4, only finitely many vertex balls and edge neighborhoods intersect S (by local finiteness of the polyhedral structure). So H_infinity restricted to S equals a finite sum. In particular, H_infinity is smooth (locally equals a finite sum of smooth functions).\n\nBOUNDARY TREATMENT: In the exhaustion K_n = K cap B_n(0), we smooth only INTERIOR vertices (those whose star lies entirely within B_n(0)). Boundary vertices (where faces extend beyond B_n) are NOT smoothed. This avoids any issue with choosing consistent extensions. For n large enough that v's star is inside B_n, the Hamiltonian H_v is the same in K_n and K_{n+1} (it depends only on the local geometry in B_delta(v), which is identical). This gives stabilization without boundary extension issues.\n\nSMOOTHNESS OF H_infinity: By local finiteness plus stabilization, H_infinity is smooth on R^4 (it locally equals H_n for n large enough).\n\nCOMPLETENESS: On any compact set S, the flow of H_infinity agrees with the flow of H_n for n large enough (since H_infinity = H_n on a neighborhood of S for large n, and H_n is compactly supported hence complete). The flow on compact sets stabilizes, defining a well-defined smooth flow phi_t^{H_infinity} on all of R^4. This flow is the desired Hamiltonian diffeomorphism smoothing all of K.\n\nSTEP 4 (FLUX VANISHING — CORRECT FORMULATION).\n\nThe Lagrangian flux of an isotopy L_t is an element of H^1(L_0; R), defined by:\n  Flux({L_t})(gamma) = integral_0^1 (integral_gamma omega(V_t, .)) dt,\nwhere V_t = dL_t/dt and gamma is a loop in L_0.\n\nIMPORTANT DISTINCTION: The Lagrangian flux lives in H^1(L_0; R), NOT in H^1(R^4; R). These are different cohomology groups. The vanishing of H^1(R^4; R) = 0 does not directly imply the vanishing of the Lagrangian flux when H^1(L_0; R) != 0.\n\nHowever, this distinction is MOOT for our construction, because our isotopy is Hamiltonian BY CONSTRUCTION (Steps 1-3 above). Here is why flux vanishes independently:\n\n(a) Construction-based argument (primary): The isotopy K_t = phi_t^H(K) is generated by an ambient Hamiltonian vector field X_H on R^4. For any Hamiltonian isotopy, the Lagrangian flux vanishes: the variation vector field V_t = X_H|_{L_t} is Hamiltonian, so i_{V_t} omega = dH_t is exact on R^4 and hence exact when restricted to L_t. The flux integral over any loop gamma becomes integral_gamma dH_t = 0.\n\n(b) Exactness argument (secondary, independent verification): Each K_t in the isotopy is an exact Lagrangian. We verify this region by region:\n\n(b1) NEAR VERTICES (inside B_delta(v)): K_t is the graph of dG_t where G_t is the generating function from Node 1.3. The Liouville form lambda = sum y_i dx_i pulls back to dG_t on graph(dG_t), which is exact. So lambda|_{K_t near v} = dG_t (exact).\n\n(b2) ALONG EDGES (outside vertex balls): K_t = {(x_1, gamma_t(s), 0, gamma_t(s))} in edge-adapted coordinates. The pullback: lambda|_{K_t} = y_1 dx_1 + y_2 dx_2 = 0 * dx_1 + gamma_{t,2}(s) * gamma_{t,1}'(s) ds. Define g_t(s) = integral_0^s gamma_{t,2}(u) * gamma_{t,1}'(u) du. Then lambda|_{K_t along e} = dg_t(s) (exact, since the form depends only on the single parameter s).\n\n(b3) AT JUNCTIONS (where vertex regions meet edge regions): Near the Phase A/Phase B junction, the vertex-region primitive is G_t (generating function) and the edge-region primitive is g_t(s). On the overlap (where both descriptions are valid and the surface is the original PL surface K since Phase B has not yet acted), both primitives restrict to the PL generating function. The difference G_t - g_t is locally constant on the overlap (connected arc of the boundary circle intersected with the face). Since we can always adjust primitives by constants, the local primitives patch to a global primitive on K_t. (Alternatively: K_t is simply connected — it is a topological disk near each vertex, an annulus along each edge — so H^1(K_t; R) = 0 whenever K_t is simply connected, making the patching automatic.)\n\n(b4) FOR GENERAL TOPOLOGY: If K is not simply connected (e.g., a torus), H^1(K; R) != 0. However, the flux still vanishes by argument (a): the isotopy is ambient Hamiltonian, and the 1-form i_{V_t} omega = dH_t is exact on ALL of R^4, hence its restriction to K_t is exact regardless of the topology of K_t.\n\nSTEP 5 (ATTRIBUTION AND REFERENCES).\n\n(1) Hamiltonian vector fields with compact support are complete: standard ODE theory; McDuff-Salamon, Introduction to Symplectic Topology, 3rd ed., Section 5.4.\n(2) Bounded Hamiltonian vector fields on R^{2n} are complete: Global existence for ODEs with globally Lipschitz vector fields; Lang, Differential and Riemannian Manifolds, Thm IV.1.6.\n(3) Smooth concatenation of Hamiltonian isotopies is Hamiltonian: McDuff-Salamon, 3rd ed., Prop. 5.4.6, combined with standard smooth time reparametrization.\n(4) Hamiltonians with disjoint support Poisson-commute, and their sum generates the simultaneous flow: McDuff-Salamon, 3rd ed., Prop. 5.4.2.\n(5) Flux homomorphism: Banyaga (1978) for compact manifolds; extended to compactly supported diffeomorphisms on non-compact manifolds in McDuff-Salamon, 3rd ed., Theorem 10.2.5. We do NOT use this abstract result; our isotopy is Hamiltonian by explicit construction.\n(6) Lagrangian flux: H^1(L; R)-valued invariant of Lagrangian isotopies, DISTINCT from the ambient symplectomorphism flux. See Auroux, A Beginner's Introduction to Fukaya Categories, Section 2.\n\nEND OF PROOF.","owner":"prover-1.6"}