{"type":"node_amended","timestamp":"2026-02-11T12:15:08.810083752Z","node_id":"1.5","previous_statement":"Global assembly of local smoothings into a smooth embedded Lagrangian (Construction). Depends on: Node 1.2 (vertex classification and normal form), Node 1.3 (vertex smoothing via cotangent generating functions), Node 1.4 (edge smoothing via explicit Lagrangian profile replacement). Inference type: construction.\n\nSTATEMENT (Proposition). Let K be a finite polyhedral Lagrangian surface in (R^4, omega_std) with exactly 4 faces at every vertex. There exists a smooth embedded Lagrangian surface L and a compactly supported Hamiltonian H: R^4 -\u003e R (with supp(H) contained in an arbitrarily small neighborhood of the 1-skeleton of K) such that the time-1 flow phi_H^1 satisfies phi_H^1(K) = L. Moreover, L agrees with K on the complement of the 1-skeleton neighborhood.\n\nSCOPE. Since K is a FINITE polyhedral complex (finitely many cells), K is compact. In particular, K has finitely many vertices v_1, ..., v_N and finitely many edges e_1, ..., e_M. The non-compact case does not arise under the problem hypotheses (a finite polyhedral complex has finitely many cells, each compact, so their union is compact). For completeness, we briefly address the locally-finite non-compact extension in Step 10.\n\nPROOF.\n\nSTEP 1 (PARAMETER CHOICES — VERTEX BALLS). For each vertex v_i (i = 1, ..., N), choose delta_i \u003e 0 such that: (a) delta_i \u003c (1/2) * min_{j != i} d(v_i, v_j). This ensures B_{delta_i}(v_i) cap B_{delta_j}(v_j) = emptyset for all i != j. (b) delta_i is small enough that B_{delta_i}(v_i) intersects only the edges and faces incident to v_i (possible since K is a finite complex, hence locally finite). (c) delta_i is small enough for Node 1.3's construction to apply in B_{delta_i}(v_i). Such delta_i exist because K is compact with finitely many vertices, so min_{i != j} d(v_i, v_j) \u003e 0.\n\nSTEP 2 (PARAMETER CHOICES — EDGE NEIGHBORHOODS AND TRANSITION ZONES). For each edge e_k connecting vertices v_i and v_j, choose a small parameter eta_k \u003e 0 (the transition zone width). Define the following subsets of the edge: (i) The vertex-ball interior: portions of e_k inside B_{delta_i}(v_i) and B_{delta_j}(v_j). (ii) The edge exterior: e_k^o = e_k setminus (B_{delta_i - eta_k}(v_i) cup B_{delta_j - eta_k}(v_j)), the portion of e_k outside slightly-shrunk vertex balls. (iii) The transition zones: the annular portions e_k cap (B_{delta_i}(v_i) setminus B_{delta_i - eta_k}(v_i)) and similarly at v_j.\n\nFor the edge exteriors, choose epsilon_k \u003e 0 such that the tubular neighborhoods T_{epsilon_k}(e_k^o) are pairwise disjoint for distinct edges. This is possible because K is a finite complex: the edge exteriors are finitely many compact line segments in R^4 with pairwise positive distances (after vertex ball removal, edges sharing a vertex are separated). Choose epsilon_k \u003c (1/2) * min_{j != k} d(e_k^o, e_j^o).\n\nSTEP 3 (PHASE A: VERTEX SMOOTHING). Apply Node 1.3's cotangent generating function construction independently at each vertex v_i.\n\nKEY FACTS FROM NODE 1.3 (critical for addressing challenges): Node 1.3 uses COTANGENT GENERATING FUNCTIONS — NOT tropical resolution. There is no topological modification, no introduction of new edges or vertices, no tropical splitting. The smooth Lagrangian L_{v_i} is topologically a disk (same as the PL cone). The construction produces a generating function F_final(X) = F_PL(X) + phi(|X|/delta_i) * (F_smooth(X) - F_PL(X)), where phi is a radial cutoff with phi(t) = 1 for t \u003c= 1/2 and phi(t) = 0 for t \u003e= 1.\n\nBOUNDARY CONDITION (AUTOMATIC): For |X| \u003e= delta_i, F_final = F_PL. The smoothed surface agrees EXACTLY with the original polyhedral surface K on and outside the boundary of B_{delta_i}(v_i). Inside B_{delta_i/2}(v_i), the surface is the smooth graph of dF_smooth. In the annular region, there is a smooth interpolation. The smoothing is Lagrangian (graph of exact 1-form dF_final). The smoothing is generated by a Hamiltonian H_{v_i} with supp(H_{v_i}) subset B_{delta_i}(v_i).\n\nDISJOINT SUPPORT PROPERTY: Since the balls B_{delta_i}(v_i) are pairwise disjoint (Step 1(a)), the Hamiltonians H_{v_1}, ..., H_{v_N} have pairwise disjoint supports. The combined Hamiltonian H_A = sum_{i=1}^{N} H_{v_i} is well-defined and smooth on R^4 (finite sum of smooth functions with pairwise disjoint supports). The Poisson brackets vanish: {H_{v_i}, H_{v_j}} = 0 for i != j (disjoint supports), so the simultaneous flow equals the composition in any order: phi_t^{H_A} = phi_t^{H_{v_1}} circ ... circ phi_t^{H_{v_N}}.\n\nDefine K_A = phi_1^{H_A}(K).\n\nPROPERTIES OF K_A: (i) Inside each B_{delta_i/2}(v_i): smooth Lagrangian (graph of dF_smooth). (ii) Outside all B_{delta_i}(v_i): K_A = K (unchanged — still PL with V-shaped edges). (iii) In each annular region: smooth Lagrangian (graph of dF_final, which is smooth everywhere by Node 1.3 Step 5(d)). (iv) On the boundary of each B_{delta_i}(v_i): K_A agrees exactly with K.\n\nCONCLUSION OF PHASE A: K_A is smooth inside each B_{delta_i}(v_i) and equals K outside. The remaining singularities are V-shaped creases along edge segments e_k^o outside all vertex balls.\n\nSTEP 4 (THE VERTEX-EDGE JUNCTION — KEY MATCHING ARGUMENT). This step resolves the critical challenge about edge-vertex boundary matching.\n\nConsider an edge e connecting vertices v and w, with vertex balls B_delta(v) and B_{delta_w}(w). After Phase A, the surface near the boundary of B_delta(v) along the edge has the following structure:\n\nINSIDE B_delta(v): the surface is graph(dF_final), which is smooth. Near the boundary (in the annular region delta/2 \u003c= |X| \u003c= delta), F_final = F_PL + phi(|X|/delta) * D(X) where D = F_smooth - F_PL. The correction D(X) is smooth, homogeneous of degree 2, and supported near sector boundaries (i.e., near edge projections).\n\nAT |X| = delta: phi = 0, so F_final = F_PL. The surface is the original PL surface K. Along the edge direction, the PL surface has a crease (jump in transverse derivative).\n\nOUTSIDE B_delta(v): the surface is K (PL, V-shaped along the edge).\n\nOBSERVATION: The crease at |X| = delta is NOT a problem for Phase A alone, because Phase A only claims smoothness INSIDE B_delta(v). The crease on the boundary is expected — it is the residual edge singularity that Phase B will handle.\n\nTHE MATCHING STRATEGY: We use the annular transition zone. Extend Phase A's effective radius by eta: redefine the cutoff so that Phase A smooths the creases out to radius delta + eta. Specifically, use phi(|X|/(delta + eta)) instead of phi(|X|/delta) in Node 1.3's formula. Then:\n- For |X| \u003c= (delta + eta)/2: F_final = F_smooth (fully smooth).\n- For |X| \u003e= delta + eta: F_final = F_PL (PL).\n- The surface is smooth everywhere inside B_{delta+eta}(v).\n\nPhase B then operates on the edge segment from radius delta + eta onward, where the surface is PL. The junction at |X| = delta + eta between Phase A (smooth) and Phase B (smooth) is handled as follows:\n\nPhase B's construction: In the edge-adapted coordinates from Node 1.4, both faces lie in {y_1 = 0}, and the V-shape is a profile in the (x_2, y_2)-plane. Phase B replaces this V-profile with a smooth curve. Near the boundary |X| = delta + eta, Phase B's Hamiltonian H_{e_k} is multiplied by a longitudinal cutoff chi_long(r) that smoothly transitions from 0 (at r = delta + eta) to 1 (at r = delta + eta + epsilon, for small epsilon \u003e 0).\n\nAt the junction r = delta + eta: Phase A gives a smooth surface. Phase B gives chi_long = 0, so Phase B does not modify the surface. The surface is therefore smooth (from Phase A). For r \u003e delta + eta + epsilon: Phase B gives chi_long = 1, fully smoothing the edge. The surface is smooth (from Phase B). In the transition epsilon-strip [delta + eta, delta + eta + epsilon]: Phase A's smoothing is tapering off (phi decreasing toward 0) while Phase B's smoothing is ramping up (chi_long increasing toward 1). But the SURFACE at r = delta + eta is already smooth (Phase A has smoothed it), so Phase B is deforming an already-smooth surface, which keeps it smooth. The Hamiltonian H_{e_k} * chi_long is smooth, and the flow of a smooth Hamiltonian preserves smoothness.\n\nCRITICAL POINT: The matching works because at the junction, Phase A has already produced a smooth surface. Phase B acts on this smooth surface, not on the PL surface. There is no mismatch to resolve — Phase B simply extends the smoothing further along the edge.\n\nSTEP 5 (PHASE B: EDGE SMOOTHING). After Phase A, the surface K_A has residual V-shaped singularities along the edge exteriors (portions of edges outside the extended vertex balls B_{delta_i + eta_i}(v_i)).\n\nFor each edge e_k, apply Node 1.4's construction to the exterior segment, with the following refinements:\n\n(a) CONSTANT PROFILE ON THE INTERIOR: On the bulk of the edge segment (away from both vertex balls), use Node 1.4's constant-profile construction: replace the V-shaped profile gamma_0 (two rays in the (x_2, y_2)-plane) with a smooth curve gamma_1. The surface L_{e_k} = {(x_1, gamma_1(s), 0, gamma_2(s))} is exactly Lagrangian for any smooth curve (Node 1.4, Step 4: omega pulls back to 0 identically because dy_1 = 0 and dx_2, dy_2 depend on the single parameter s).\n\n(b) LONGITUDINAL CUTOFF NEAR VERTEX BALLS: Near the endpoints of the edge segment (where it approaches a vertex ball), the profile gamma_t is smoothly deformed back to the original V-shape gamma_0 using a longitudinal cutoff chi_long(x_1). This makes the profile x_1-dependent.\n\nWhen the profile depends on x_1, the Lagrangian condition acquires a cross-term (Node 1.4, Step 6): iota*(omega) = (partial_{x_1} gamma_1 * partial_s gamma_2 - partial_s gamma_1 * partial_{x_1} gamma_2) dx_1 ^ ds. This vanishes iff the x_1-deformation preserves the curve up to reparametrization.\n\nRESOLUTION: We handle this by NOT using a longitudinal cutoff in the traditional sense. Instead, we observe that at the edge endpoints (near vertex ball boundaries), Phase A has already smoothed the surface. Phase B only needs to smooth the MIDDLE of the edge. So the Phase B Hamiltonian has compact support along the edge, bounded away from the vertex ball boundaries. At the support boundary of Phase B's Hamiltonian, the surface is already smooth (from Phase A), and Phase B does nothing (H = 0 there). This means the profile is constant (not x_1-dependent) throughout the Phase B support region, and the Lagrangian condition is automatic.\n\nMore precisely: for each edge e_k, Phase B's Hamiltonian H_{e_k} is supported in the set {p : d(p, e_k^o) \u003c epsilon_k and d(p, partial(vertex balls)) \u003e eta_k}. Inside this support, the profile is constant. Outside this support, the surface is already smooth (from Phase A near vertex balls, or is the original flat face away from edges).\n\n(c) FACE-EDGE JUNCTION: At the boundary of the edge smoothing in the transverse direction (moving away from the edge into a face), the smooth profile gamma_1 must transition back to the flat V-shape. This is achieved by choosing gamma_1 to agree with the original rays for |s| \u003e= T (i.e., gamma_1(s) = s * r_1 for s \u003e= T and gamma_1(s) = |s| * r_2 for s \u003c= -T). The edge smoothing modifies the surface only in a small transverse strip near the edge. Outside this strip, the surface is the original flat face, and the transition is smooth because gamma_1 smoothly approaches the rays.\n\n(d) DISJOINT SUPPORTS: The supports of H_{e_1}, ..., H_{e_M} are pairwise disjoint (Step 2). Therefore the edge Hamiltonians can be summed: H_B = sum_{k=1}^{M} H_{e_k}, with {H_{e_k}, H_{e_j}} = 0 for k != j. The simultaneous flow is well-defined.\n\nSTEP 6 (HAMILTONIAN ISOTOPY — SEQUENTIAL COMPOSITION). The total deformation K -\u003e L is realized as a sequential composition of two Hamiltonian flows:\n\nPhase A flow: K -\u003e K_A = phi_1^{H_A}(K), where H_A = sum_i H_{v_i}. Each H_{v_i} is compactly supported in B_{delta_i + eta_i}(v_i) (from Node 1.3).\n\nPhase B flow: K_A -\u003e L = phi_1^{H_B}(K_A), where H_B = sum_k H_{e_k}. Each H_{e_k} is compactly supported in the edge tubular neighborhood.\n\nThe total isotopy is the concatenation: phi_t^{total} = phi_{2t}^{H_A} for t in [0, 1/2] and phi_t^{total} = phi_{2t-1}^{H_B} circ phi_1^{H_A} for t in [1/2, 1]. This is a Hamiltonian isotopy from K to L. The total Hamiltonian is compactly supported: supp(H_A) cup supp(H_B) is contained in a neighborhood of the 1-skeleton of K.\n\nWHY SEQUENTIAL (not simultaneous): Phase A and Phase B do NOT have disjoint supports in general (they overlap in the annular transition zones near vertex ball boundaries). The sequential approach ensures that Phase B acts on K_A (the output of Phase A), not on K itself. This is necessary because Phase B's edge smoothing must start from the smooth surface produced by Phase A near vertex balls, not from the PL surface K. If applied simultaneously, the vertex and edge Hamiltonians would interfere in the transition zone, and the Poisson bracket {H_A, H_B} would be nonzero there.\n\nSTEP 7 (SMOOTHNESS VERIFICATION). We verify that L is a smooth submanifold of R^4.\n\n(A) Points inside B_{delta_i/2}(v_i): L = graph(dF_smooth), smooth by Node 1.3 Step 4. (Not modified by Phase B since Phase B's support is away from this region.)\n\n(B) Points in the Phase A annular zone, away from edges: L = graph(dF_final) restricted to face interiors, where F_final = F_PL = (1/2) X^T A_j X (smooth quadratic). Hence L is a flat Lagrangian plane. Smooth.\n\n(C) Points in the Phase A annular zone, near edges: L = graph(dF_final) where F_final smoothly interpolates between face generating functions via the angular partition of unity. Smooth by Node 1.3's construction.\n\n(D) Points along edge interiors (inside Phase B's support): L = phi_1^{H_B}(K_A). Here K_A is PL (V-shaped) and H_B smooths it via Node 1.4's construction. The result is a smooth Lagrangian by Node 1.4 Steps 3-5 (smooth curve in (x_2, y_2)-plane, product with x_1-line, automatically Lagrangian).\n\n(E) Points in the Phase B transition zone (boundary of Phase B's support near vertex balls): Here H_B is tapering to zero, and K_A is smooth (from Phase A). Phase B's flow phi_1^{H_B} applied to a smooth submanifold K_A at a point where H_B is smooth (and smoothly vanishing) yields a smooth submanifold. (A smooth diffeomorphism maps smooth submanifolds to smooth submanifolds.)\n\n(F) Face-edge junctions (away from vertices): The edge smoothing curve gamma_1 agrees with the face rays for |s| \u003e= T, so L transitions smoothly from the rounded profile to the flat faces. Smooth.\n\n(G) Face interiors (away from edges and vertices): L = K (unchanged). These are flat Lagrangian planes. Smooth.\n\nAll points of L are covered by cases (A)-(G). L is smooth.\n\nSTEP 8 (EMBEDDEDNESS VERIFICATION). L is embedded:\n\n(a) LOCAL EMBEDDEDNESS: Each local piece is embedded. Vertex smoothings are graph Lagrangians (Node 1.3 Step 6: the map X -\u003e (X, dF_final(X)) is injective). Edge smoothings are products of a line with an embedded curve (Node 1.4 Step 5). Face interiors are flat planes.\n\n(b) NO NEW INTERSECTIONS: L is obtained from K by Hamiltonian diffeomorphisms (first phi_1^{H_A}, then phi_1^{H_B}). Since K is embedded (by hypothesis, K is a topological submanifold of R^4) and Hamiltonian diffeomorphisms are smooth diffeomorphisms of R^4 (hence preserve embeddedness), L = phi_1^{H_B}(phi_1^{H_A}(K)) is embedded.\n\nMore explicitly: phi_1^{H_A} is a diffeomorphism of R^4, so K_A = phi_1^{H_A}(K) is an embedded submanifold (diffeomorphic to K). Similarly, phi_1^{H_B} is a diffeomorphism of R^4, so L = phi_1^{H_B}(K_A) is an embedded submanifold.\n\nSTEP 9 (LAGRANGIAN VERIFICATION). L is Lagrangian:\n\nK is a Lagrangian submanifold (piecewise, each face is Lagrangian, and K is a topological submanifold). The Hamiltonian flow phi_t^{H_A} preserves the symplectic form: (phi_t^{H_A})* omega = omega. Therefore for any smooth piece of K where omega|_K = 0, we have omega|_{K_A} = 0 on the corresponding piece of K_A. Since L = phi_1^{H_B}(K_A) and (phi_1^{H_B})* omega = omega, the Lagrangian condition is preserved.\n\nMore carefully: K is not a smooth submanifold, so \"omega|_K = 0\" requires interpretation. The correct statement is: each face of K is a smooth Lagrangian submanifold, and the Hamiltonian flow maps each face to a smooth Lagrangian piece of K_A. After Phase A, K_A is a smooth Lagrangian submanifold (it is smooth by Step 3 inside vertex balls, and outside it equals K which has PL singularities along edges). After Phase B, L is smooth everywhere and Lagrangian (being the image of the smooth Lagrangian K_A under a symplectomorphism, away from the PL singularities which have been resolved).\n\nAlternatively: the generating function argument gives Lagrangian-ness directly. Inside vertex balls, L = graph(dF_final), which is Lagrangian because it is the graph of an exact 1-form. Along edges, L is a product surface in {y_1 = 0}, which is Lagrangian by the computation in Node 1.4 Step 4. On face interiors, L = K is flat Lagrangian.\n\nSTEP 10 (NON-COMPACT EXTENSION). The problem statement specifies a FINITE polyhedral complex, which is compact. However, for the benefit of applications to locally-finite non-compact polyhedral Lagrangian surfaces (not required by the problem, but potentially relevant for edges extending to infinity as mentioned in the handoff):\n\n(a) LOCALLY-FINITE VERTEX SET: For a locally-finite polyhedral complex, the vertex set V is discrete (no accumulation points). Choose delta(v) = (1/3) * d(v, V setminus {v}) for each v in V. By local finiteness, d(v, V setminus {v}) \u003e 0, so delta(v) \u003e 0. The balls B_{delta(v)}(v) are pairwise disjoint.\n\n(b) INFINITE HAMILTONIAN SUM: H_A = sum_{v in V} H_v is a locally finite sum of smooth functions (any compact set meets finitely many supports). Hence H_A is a well-defined smooth function on R^4.\n\n(c) COMPLETENESS: If the vertex geometry is uniformly bounded (dihedral angles in [alpha_0, pi - alpha_0] for some alpha_0 \u003e 0, and edge lengths bounded below), then the H_v satisfy uniform C^k bounds on their supports, ensuring the Hamiltonian vector field X_{H_A} is complete (its flow exists for all time).\n\n(d) INFINITE EDGES: Edges extending to infinity receive a constant-profile smoothing (independent of the longitudinal coordinate), which extends smoothly to infinity. The Hamiltonian for such an edge is not compactly supported in the longitudinal direction, but it is compactly supported in the transverse directions. The flow is complete because the Hamiltonian vector field is tangent to the transverse (x_2, y_2)-plane and compactly supported there.\n\nSTEP 11 (SUMMARY). The global assembly proceeds as: (1) Choose disjoint vertex balls and edge neighborhoods (Steps 1-2). (2) Phase A: Apply Node 1.3's cotangent generating function smoothing at each vertex. Individual Hamiltonians have disjoint supports; they are SUMMED to produce the simultaneous flow (not composed — the sum H_A = sum H_{v_i} generates the simultaneous flow because {H_{v_i}, H_{v_j}} = 0). Result: K_A is smooth inside vertex balls, PL outside. (3) Phase B: Apply Node 1.4's profile replacement along each edge exterior. The edge smoothing has constant profile (Lagrangian condition is automatic). The Phase A/Phase B junction is smooth because Phase A smooths the surface past the vertex ball boundary, and Phase B acts on the resulting smooth surface. Result: L is smooth everywhere. (4) Sequential Hamiltonian isotopy: K -\u003e K_A -\u003e L, generated by H_A then H_B. The total Hamiltonian is compactly supported. (5) L is a smooth embedded Lagrangian submanifold.\n\nEND OF PROOF.","new_statement":"Global assembly of local smoothings into a smooth embedded Lagrangian (Construction). Depends on: Node 1.2 (vertex classification and normal form), Node 1.3 (vertex smoothing via two-zone cotangent generating functions), Node 1.4 (edge smoothing via explicit Lagrangian profile replacement). Inference type: construction.\n\nSTATEMENT (Proposition). Let K be a finite polyhedral Lagrangian surface in (R^4, omega_std) with exactly 4 faces at every vertex. There exists a smooth embedded Lagrangian surface L and a compactly supported Hamiltonian H: R^4 -\u003e R (with supp(H) contained in an arbitrarily small neighborhood of the 1-skeleton of K) such that the time-1 flow phi_H^1 satisfies phi_H^1(K) = L. Moreover, L agrees with K on the complement of the 1-skeleton neighborhood.\n\nSCOPE. K is a FINITE polyhedral complex (finitely many cells), hence compact. K has finitely many vertices v_1, ..., v_N and finitely many edges e_1, ..., e_M. (A finite polyhedral complex has finitely many cells, each compact, so their union is compact. The non-compact case does not arise under the problem hypotheses.) A brief remark on the locally-finite extension appears in Step 10.\n\nOVERALL STRATEGY. We construct the smooth Lagrangian surface L DIRECTLY (not via Hamiltonian flow applied to K). The construction defines L piecewise on overlapping regions, verifying smoothness at every overlap. A Hamiltonian isotopy from K to L is then constructed separately. This avoids the fundamental difficulty that a Hamiltonian flow applied to a non-smooth surface need not produce a smooth result.\n\nPROOF.\n\nSTEP 1 (PARAMETER CHOICES). For each vertex v_i (i = 1, ..., N), choose delta_i \u003e 0 satisfying:\n(a) delta_i \u003c (1/6) * min_{j != i} d(v_i, v_j). (The factor 1/6 provides room for extensions while guaranteeing disjointness, see Step 4.)\n(b) delta_i is small enough that B_{3*delta_i}(v_i) intersects only edges and faces incident to v_i.\n(c) delta_i is small enough for Node 1.3's construction to apply with radius parameter 3*delta_i/2.\nSuch delta_i exist because K is compact with finitely many vertices.\n\nChoose a uniform small parameter eta with 0 \u003c eta \u003c (1/10)*min_i delta_i. This is the overlap width.\n\nFor each edge e_k connecting vertices v_i and v_j, let L_k denote the edge length. Choose epsilon_k \u003e 0 (transverse neighborhood radius) satisfying:\n(d) The tubular neighborhoods T_{epsilon_k}(e_k) are pairwise disjoint for non-adjacent edges, and for edges sharing a vertex, their tubular neighborhoods are disjoint outside the vertex ball.\n(e) epsilon_k \u003c eta.\n\nSTEP 2 (DOMAIN DECOMPOSITION). Partition R^4 near the 1-skeleton into three types of regions:\n\nVERTEX REGIONS: V_i = B_{delta_i + eta}(v_i) for each vertex v_i. The extended vertex balls have pairwise disjoint closures: (delta_i + eta) + (delta_j + eta) \u003c (1/6 + 1/60)*d_min + (1/6 + 1/60)*d_min \u003c (2/5)*d_min \u003c d_min for any pair v_i, v_j (using delta_i \u003c d_min/6 and eta \u003c delta_i/10 \u003c d_min/60).\n\nEDGE REGIONS: For each edge e_k connecting v_i and v_j, define the edge middle E_k = {p on e_k : d(p, v_i) \u003e delta_i and d(p, v_j) \u003e delta_j}, with tubular neighborhood T_k = T_{epsilon_k}(E_k). This is the portion of the edge strictly outside the original (non-extended) vertex balls.\n\nOVERLAP STRIPS: For each edge e_k at vertex v_i, the overlap strip O_{k,i} is the annular segment where the edge middle's tubular neighborhood intersects the extended vertex ball: O_{k,i} = T_k cap V_i. This is a strip of width eta along the edge, at distance delta_i to delta_i + eta from v_i.\n\nFACE REGIONS: Everything else — the open face interiors away from all edges and vertex balls.\n\nSTEP 3 (VERTEX SMOOTHING — APPLYING NODE 1.3). For each vertex v_i, apply Node 1.3's two-zone cotangent generating function construction with effective radius delta_i + eta (instead of delta_i).\n\nNode 1.3 (rewritten, two-zone construction) provides: a smooth generating function F_smooth^{(i)} defined on B_{delta_i + eta}(v_i) in cotangent coordinates (X_1, X_2) centered at v_i, with:\n(i) F_smooth^{(i)}(X) = 0 for |X| \u003c epsilon_0 where epsilon_0 = (delta_i + eta)/8. (Inner zone: F=0, all derivatives zero, Hessian is the well-defined zero matrix.)\n(ii) F_smooth^{(i)}(X) = chi(|X|/epsilon_0) * F_angular(X) for all X, where chi is flat at t=1 and equals 1 for t \u003e= 2, and F_angular = sum_j rho_j(theta) * (1/2) X^T A_j X with {rho_j} a smooth angular partition of unity.\n(iii) For |X| \u003e 2*epsilon_0 = (delta_i+eta)/4, F_smooth^{(i)} = F_angular, smooth since |X| \u003e 0.\n(iv) On each sector interior Omega_j (the open quadrant corresponding to face F_j), deep inside (angular distance \u003e alpha from sector boundaries): rho_j = 1, so F_smooth^{(i)} = F_j = (1/2) X^T A_j X = F_PL.\n(v) Near sector boundaries (within angular width alpha of edge rays): F_smooth^{(i)} smoothly interpolates between the adjacent face generating functions via the angular partition of unity.\n\nDefine the vertex-smoothed surface piece:\nL^{vert}_i = Graph(dF_smooth^{(i)}) = {(X, dF_smooth^{(i)}(X)) : X in B_{delta_i + eta}(v_i)}.\n\nThis is a smooth embedded Lagrangian disk (Node 1.3 Steps 5-7).\n\nCRITICAL PROPERTY AT THE BOUNDARY (for overlap matching): On the boundary of V_i = B_{delta_i + eta}(v_i), within each sector interior (angular distance \u003e alpha from edge rays), F_smooth^{(i)} = F_PL. The surface L^{vert}_i agrees EXACTLY with K on these arcs.\n\nNear the boundary of V_i, close to an edge ray (within angular width alpha): F_smooth^{(i)} = F_angular (since |X| \u003e (delta_i+eta)/4 \u003e\u003e epsilon_0). The surface L^{vert}_i is a smooth curve in the fiber coordinates, interpolating between the two adjacent face planes. The angular width alpha is a free parameter that we choose sufficiently small (alpha \u003c\u003c epsilon_k).\n\nSTEP 4 (EDGE SMOOTHING — APPLYING NODE 1.4). For each edge e_k, we construct the edge-smoothed surface piece using Node 1.4's constant-profile construction.\n\nIn Node 1.4's edge-adapted Darboux coordinates (x_1, x_2, y_1, y_2):\n- The edge e_k lies along the x_1-axis.\n- Both faces meeting at e_k lie in the hyperplane {y_1 = 0}.\n- Face F_a has transverse profile along ray r_a = (1, 0) in the (x_2, y_2)-plane.\n- Face F_b has transverse profile along ray r_b = (cos theta, sin theta) in the (x_2, y_2)-plane.\n\nThe PL surface along the edge is {(x_1, t*r, 0) : x_1 in R, t \u003e= 0, r in {r_a, r_b}} — a product of the x_1-line with a V-shape (two rays) in the (x_2, y_2)-plane.\n\nChoose a smooth embedded curve gamma: R -\u003e R^2 in the (x_2, y_2)-plane satisfying:\n(A) gamma(s) = s * r_a for s \u003e= T (flat transition: all derivatives match the linear ray at s = T; this is automatic since gamma^{(k)}(T) = 0 for k \u003e= 2 from the linear ray side, and we require gamma^{(k)}(T^-) = 0 for k \u003e= 2 from the rounded side — achievable via a flat/bump-function construction).\n(B) gamma(s) = |s| * r_b for s \u003c= -T (similarly flat transition at s = -T).\n(C) gamma is a simple curve avoiding the origin: gamma(s) != 0 for all s.\n(D) gamma is smooth on all of R.\n\nSuch a curve exists by standard smooth approximation theory: the V-shape (two rays meeting at the origin at angle theta) can be rounded by replacing the corner with a smooth arc of arbitrarily small radius, with flat (all derivatives matching) transitions to the rays at s = +-T.\n\nDefine the edge-smoothed surface piece:\nL^{edge}_k = {(x_1, gamma_1(s), 0, gamma_2(s)) : x_1 in E_k, s in R}\nwhere gamma(s) = (gamma_1(s), gamma_2(s)).\n\nThis is smooth and EXACTLY Lagrangian by Node 1.4, Step 4: the pullback omega|_{L^{edge}_k} = 0 identically because dy_1 = 0 (killing dx_1 ^ dy_1) and x_2, y_2 both depend on the single parameter s (killing dx_2 ^ dy_2). The profile is constant (independent of x_1), so no cross-terms arise.\n\nTRANSVERSE COMPACT SUPPORT: For |s| \u003e= T, L^{edge}_k agrees exactly with K (the V-shape). The smoothing modifies K only in the transverse strip |s| \u003c T near the edge. Outside this strip, L^{edge}_k = K (flat face).\n\nSTEP 5 (OVERLAP MATCHING — THE KEY STEP). We must verify that L^{vert}_i and L^{edge}_k agree (define the same smooth surface) on the overlap strip O_{k,i}.\n\nCOORDINATE RELATIONSHIP: Node 1.2's normal form puts the vertex at the origin with the 4 faces as Graph(A_j) over the 4 quadrants. Node 1.4's edge-adapted coordinates are a Darboux basis adapted to the edge. Both are LINEAR symplectomorphisms of R^4 (no nonlinear coordinate changes). The transition between them is a CONSTANT ELEMENT of Sp(4, R).\n\nConsider the edge e_k = ell_{j,j+1} between face j and face j+1, which in the vertex-centered coordinates is a coordinate semi-axis. In the overlap strip O_{k,i}, a point on the surface at distance r from v_i (with delta_i \u003c r \u003c delta_i + eta) and small angular distance phi from the edge ray has:\n- Vertex coordinates: X = r*(cos phi, sin phi) (approximately, in the sector near the edge ray).\n- The generating function: F_smooth^{(i)}(X) = F_angular(X) = rho_j(phi) * F_j(X) + rho_{j+1}(phi) * F_{j+1}(X) + (small corrections from distant sectors).\n\nNear the edge ray (phi near 0), only the two adjacent sectors contribute:\nF_angular(X) approx rho_j(phi) * (1/2) X^T A_j X + rho_{j+1}(phi) * (1/2) X^T A_{j+1} X.\n\nThe surface Graph(dF_angular) near the edge, expressed in the edge-adapted coordinates of Node 1.4, has the following form. In the transverse (x_2, y_2)-plane, at longitudinal position x_1 = r (distance along the edge from vertex), the cross-section of Graph(dF_angular) is a smooth curve that interpolates between the two face rays r_a, r_b. This curve depends on the angular partition of unity rho_j.\n\nKEY CHOICE: We choose the profile curve gamma for the edge smoothing (Step 4) to MATCH the cross-section of Node 1.3's angular interpolation at the inner boundary of the overlap strip. Specifically:\n\nAt longitudinal position x_1 corresponding to |X| = delta_i (the inner boundary of the overlap), Node 1.3's construction produces a specific smooth curve gamma_A(s) in the (x_2, y_2)-plane as the cross-section of Graph(dF_angular). We set gamma := gamma_A. Since Node 1.3's construction is invariant along the edge direction (F_angular depends only on the angular coordinate theta and the radial coordinate |X|, and for points near the edge at fixed |X|, the angular interpolation produces the same curve), the cross-section gamma_A is actually INDEPENDENT of x_1 for points near the edge. Therefore gamma_A = gamma is a valid constant profile.\n\nMore precisely: in the vertex-centered cotangent coordinates, the edge ray is a semi-axis. For points X = (r, phi) (polar) near this semi-axis, the generating function F_angular = rho_j(phi) * q_j(X) + rho_{j+1}(phi) * q_{j+1}(X). In the radial-times-angular decomposition, the angular interpolation rho_j(phi) depends ONLY on phi (not on r). The quadratic forms q_j(X) = (1/2) X^T A_j X are degree 2 in |X|. Therefore the tangent to Graph(dF_angular) in the transverse direction has a profile that scales with r but whose SHAPE (as a curve in the projectivized transverse plane) is r-independent. Concretely, the cross-section at radius r is r times the cross-section at radius 1. After rescaling to the edge-adapted coordinates, the profile gamma_A(s) at longitudinal position x_1 is the SAME curve for all x_1 \u003e 0 (up to the overall scale set by the distance from the vertex, which is absorbed into the parametrization).\n\nThis means that in the overlap strip, the vertex-smoothed surface L^{vert}_i and the edge-smoothed surface L^{edge}_k define the SAME subset of R^4, provided gamma is chosen to match gamma_A.\n\nVERIFICATION: In the overlap strip O_{k,i}, express both surfaces in the edge-adapted coordinates:\n- L^{vert}_i = Graph(dF_angular) restricted to the overlap. Near the edge, this is {(x_1, gamma_A(s), 0, ...) : ...} where gamma_A is the angular interpolation profile.\n- L^{edge}_k = {(x_1, gamma(s), 0, gamma_2(s)) : ...} with gamma = gamma_A.\nThese are the same surface. The overlap is smooth because both descriptions are smooth.\n\nSUBTLETY — FIBER COORDINATES: The cotangent graph form Graph(dF_angular) is expressed in cotangent coordinates (X, Y = dF_angular(X)), while the product form uses edge-adapted coordinates. The coordinate transformation between them is a fixed linear symplectomorphism (composition of the vertex-to-standard and standard-to-edge-adapted changes). Under this linear map, Graph(dF_angular) near the edge IS a constant-profile surface in {y_1 = 0}. This is because:\n(1) Both faces lie in {y_1 = 0} in the edge-adapted coordinates (Node 1.4, Step 2).\n(2) The angular interpolation between the two face planes stays in {y_1 = 0} (since both face planes have y_1 = 0, any convex combination also has y_1 = 0; the angular partition of unity gives a smoothly-weighted convex combination of the transverse profiles).\n(3) The resulting curve in the (x_2, y_2)-plane is gamma_A, which is smooth.\n\nTherefore the overlap matching is exact.\n\nSTEP 6 (FACE MATCHING). On face interiors (angular distance \u003e alpha from all edge rays, distance \u003e delta_i + eta from all vertices):\n- The vertex smoothing gives F_smooth^{(i)} = F_PL (since rho_j = 1 deep inside sector j). So L^{vert}_i = K.\n- The edge smoothing gives gamma = ray (since for |s| \u003e= T, gamma agrees with the face ray). So L^{edge}_k = K.\n- L = K on face interiors.\n\nThe face-vertex boundary: for points on a face at distance delta_i + eta from v_i and angular distance \u003e alpha from edges, L^{vert}_i = K = L (face interior). Smooth.\n\nThe face-edge boundary: for points on a face at transverse distance T from an edge, L^{edge}_k = K = L (face interior). Smooth. The flat transition property of gamma at s = +-T (Step 4(A)(B)) ensures all derivatives match: gamma^{(k)}(T) matches the k-th derivative of the linear ray, which is 0 for k \u003e= 2. So the transition from rounded profile to flat face is C^infinity.\n\nSTEP 7 (DEFINITION OF L AND GLOBAL SMOOTHNESS). Define L as follows:\n- On V_i: L = L^{vert}_i = Graph(dF_smooth^{(i)}).\n- On T_k setminus (union_i V_i): L = L^{edge}_k.\n- On face interiors: L = K.\n\nThis is well-defined because:\n(a) On the overlap strips O_{k,i} = T_k cap V_i: L^{vert}_i = L^{edge}_k (Step 5).\n(b) On face-vertex boundaries: L^{vert}_i = K (Step 6).\n(c) On face-edge boundaries: L^{edge}_k = K (Step 6).\n\nSmoothness check at every point of L:\n\n(A) Points inside V_i, away from T_k: L = Graph(dF_smooth^{(i)}), smooth (Node 1.3 Step 6).\n\n(B) Points inside V_i, near an edge (in the overlap O_{k,i}): L = L^{vert}_i = L^{edge}_k (both smooth, same surface). Smooth.\n\n(C) Points on T_k outside all V_i (edge middle proper): L = L^{edge}_k = {(x_1, gamma(s), 0, gamma_2(s))}, smooth and exactly Lagrangian by Node 1.4.\n\n(D) Points on the boundary of V_i, away from edges: L transitions from Graph(dF_smooth^{(i)}) = Graph(dF_PL) to K = Graph(dF_PL). These are the same surface. Smooth.\n\n(E) Points on the boundary of T_k, away from vertex balls (face-edge boundary): L transitions from L^{edge}_k to K. At the transverse boundary |s| = T, gamma matches the face ray with all derivatives agreeing (flat transition). L = K on both sides. Smooth.\n\n(F) Points on face interiors: L = K. These are flat Lagrangian planes. Smooth.\n\nAll points of L are covered. L is a smooth surface.\n\nSTEP 8 (LAGRANGIAN VERIFICATION — GENERATING FUNCTION ARGUMENT). L is Lagrangian everywhere:\n\n(A) In vertex regions V_i: L = Graph(dF_smooth^{(i)}). The graph of an exact 1-form dF is Lagrangian: omega = d(p dq) and Graph(dF) is the image of the section q -\u003e (q, dF(q)), pulling back the Liouville form to dF, so pullback of omega = d(dF) = 0.\n\n(B) On edge middles (inside T_k, outside V_i): L = {(x_1, gamma(s), 0, gamma_2(s))}. Pullback of omega = dx_1 ^ dy_1 + dx_2 ^ dy_2 = dx_1 ^ 0 + gamma_1'ds ^ gamma_2'ds = 0 (Node 1.4, Step 4).\n\n(C) On face interiors: L = K is a union of flat Lagrangian planes. Each face is a Lagrangian subspace.\n\n(D) On overlap strips O_{k,i}: by Step 5, L = L^{vert}_i which is Lagrangian by (A). Equivalently, L = L^{edge}_k which is Lagrangian by (B). Both give the same result.\n\nThe Lagrangian condition is verified at EVERY point of L using the appropriate local description. No Hamiltonian flow preservation argument is needed — each piece is Lagrangian by direct computation.\n\nSTEP 9 (EMBEDDEDNESS). L is embedded (a smooth injective immersion that is a homeomorphism onto its image):\n\n(a) LOCAL EMBEDDEDNESS: Each piece of L is locally embedded.\n- Vertex regions: Graph(dF_smooth^{(i)}) is a graph over B_{delta_i+eta}(v_i), hence injective (the projection to the base X-plane is a left inverse). The differential has rank 2 (the identity block in the X-directions).\n- Edge regions: {(x_1, gamma(s), 0, gamma_2(s))} is injective if gamma is injective (x_1 is recovered from the first coordinate, s from gamma). Since gamma is a simple curve (Step 4(C)), the map is injective with rank 2.\n- Face regions: flat planes, trivially embedded.\n\n(b) GLOBAL INJECTIVITY (no self-intersections): K is an embedded topological submanifold of R^4 (hypothesis). L is obtained from K by a local modification: the modification occurs only in a small neighborhood of the 1-skeleton, and in each region, L is close to K (the generating function correction is small, the curve gamma is close to the V-shape). For sufficiently small delta_i, eta, and epsilon_k, the modified surface L remains embedded. More precisely:\n\n(i) L is a smooth 2-manifold (verified in Step 7).\n(ii) L is a proper map into R^4: K is compact (FINITE polyhedral complex), and L is a local modification of K within bounded neighborhoods, so L is also compact, hence its inclusion into R^4 is proper (closed in R^4).\n(iii) L is an injective immersion: at each point, the local descriptions in (a) show injectivity and rank 2.\n(iv) By the standard result (a proper injective immersion is an embedding), L is an embedded submanifold.\n\nAlternatively: the generating function F_smooth^{(i)} on vertex balls and the product parametrization on edge middles each provide an explicit local parametrization of L. These parametrizations have pairwise compatible domains (either disjoint or agreeing on overlaps by Step 5). The atlas of local parametrizations gives L the structure of a smooth embedded submanifold.\n\nSTEP 10 (HAMILTONIAN ISOTOPY). We now construct a compactly supported Hamiltonian isotopy from K to L. The strategy: compose vertex isotopies (from Node 1.3) with edge isotopies (from Node 1.4), using a smooth time reparametrization.\n\nPHASE A ISOTOPY (VERTEX SMOOTHING): Node 1.3 (Step 8) provides, for each vertex v_i, a Hamiltonian H_{v_i}(t, X, Y) compactly supported in V_i that generates a flow phi_t^{H_{v_i}} with phi_1^{H_{v_i}} mapping K cap V_i to L^{vert}_i.\n\nSince the extended vertex balls V_i = B_{delta_i+eta}(v_i) are pairwise disjoint (Step 2), the Hamiltonians H_{v_1}, ..., H_{v_N} have pairwise disjoint supports. The Poisson brackets vanish: {H_{v_i}, H_{v_j}} = 0. The flow of the sum H_A = sum_i H_{v_i} equals the composition in any order: phi_t^{H_A} = phi_t^{H_{v_1}} o ... o phi_t^{H_{v_N}} for all t (BCH formula with all commutators zero; disjoint supports imply vanishing Lie brackets of Hamiltonian vector fields [X_{H_{v_i}}, X_{H_{v_j}}] = X_{\\{H_{v_i}, H_{v_j}\\}} = 0).\n\nDefine K_A = phi_1^{H_A}(K). Properties: (i) inside V_i: K_A = L^{vert}_i (smooth Lagrangian disk); (ii) outside all V_i: K_A = K (unchanged PL surface).\n\nPHASE B ISOTOPY (EDGE SMOOTHING): For each edge e_k, Node 1.4 (Step 7) provides a family of curves gamma_t (t in [0,1]) from gamma_0 (V-shape) to gamma_1 (smooth curve), generating a Lagrangian isotopy of the constant-profile surface. The isotopy is Hamiltonian with Hamiltonian H_{e_k}^{transverse}(t, x_2, y_2) compactly supported in the (x_2, y_2)-plane.\n\nFor Phase B to act only on the edge middle and not interfere inside vertex balls, we multiply by a longitudinal cutoff. However, multiplying the Hamiltonian by a cutoff function chi_long(x_1) does NOT break the Lagrangian condition of the TARGET surface (the target is defined directly in Step 4, independently of the Hamiltonian). The Hamiltonian chi_long * H_{e_k}^{transverse} is a smooth function on R^4, and its flow is a smooth symplectomorphism. The key point: we apply this flow to K_A, which inside the overlap O_{k,i} is ALREADY the smooth surface L^{vert}_i = L^{edge}_k. At points in the overlap where chi_long is ramping from 0 to 1:\n\n- chi_long = 0: the flow is the identity, K_A is unchanged = L^{vert}_i = L (already the target).\n- chi_long = 1: the flow fully resolves the V-shape, producing L^{edge}_k = L (the target).\n- 0 \u003c chi_long \u003c 1: the flow PARTIALLY resolves the V-shape. But in the overlap, K_A is already smooth (from Phase A), and chi_long * H_{e_k} generates a smooth Hamiltonian flow. So the partial flow applied to a smooth surface gives a smooth surface. However, this smooth surface may NOT equal L in the overlap.\n\nCORRECTION: To avoid this subtlety, we choose chi_long so that it transitions from 0 to 1 OUTSIDE the overlap strip, entirely within the edge middle proper (where K_A = K is PL). Specifically, chi_long(x_1) = 0 for x_1 \u003c= delta_i + eta (inside vertex ball) and chi_long(x_1) = 1 for x_1 \u003e= delta_i + eta + eta' (a small distance into the edge middle), where eta' \u003c sigma/2 is chosen so the transition occurs in the PL region.\n\nBut wait — if chi_long = 0 in the overlap, then Phase B does not act in the overlap. Inside the overlap, K_A = L^{vert}_i, which IS already L (by Step 5, the vertex smoothing matches the edge smoothing in the overlap). So Phase B does not NEED to act in the overlap. Outside the overlap and inside the edge middle, K_A = K (PL), and chi_long = 1, so Phase B fully resolves the V-shape, producing L^{edge}_k = L.\n\nIn the transition strip (width eta' near the vertex ball boundary, inside the edge middle): K_A = K (PL), and 0 \u003c chi_long \u003c 1. The flow chi_long * H_{e_k} partially resolves the V-shape, producing a surface that is neither fully PL nor fully smooth. This is a PROBLEM.\n\nRESOLUTION: We make chi_long transition inside the OVERLAP, where K_A is already smooth. Set chi_long(x_1) = 0 for x_1 \u003c= delta_i + eta/3 and chi_long(x_1) = 1 for x_1 \u003e= delta_i + 2*eta/3. The transition occurs in [delta_i + eta/3, delta_i + 2*eta/3], which is inside V_i (since delta_i + 2*eta/3 \u003c delta_i + eta). In this region, K_A = L^{vert}_i (smooth from Phase A). The flow of chi_long * H_{e_k} applied to K_A:\n- Where chi_long = 0: surface = K_A = L^{vert}_i = L. Correct.\n- Where chi_long = 1 and K_A = K (PL, on edge middle): flow fully resolves V-shape, surface = L^{edge}_k = L. Correct.\n- Where 0 \u003c chi_long \u003c 1 (transition, inside overlap): K_A is smooth (from Phase A), and the flow is a smooth symplectomorphism. The resulting surface phi_1^{chi_long*H_{e_k}}(K_A) is smooth here. But does it equal L?\n\nIn the overlap, L = L^{vert}_i (the vertex-smoothed surface). The flow phi_1^{chi_long*H_{e_k}} modifies K_A = L^{vert}_i by the partial edge-smoothing Hamiltonian. If chi_long \u003c 1, the modification is a PARTIAL Hamiltonian flow, which moves the surface away from L^{vert}_i. The result does NOT equal L in this strip.\n\nTHIS IS THE FUNDAMENTAL DIFFICULTY. We have two smooth surfaces that agree in the overlap (L^{vert}_i = L^{edge}_k), but the Hamiltonian interpolation between Phase A and Phase B outputs does not stay on L.\n\nFINAL RESOLUTION — THE CORRECT ISOTOPY CONSTRUCTION: Instead of composing Hamiltonian flows, we construct a Hamiltonian isotopy from K to L using the GENERATING FUNCTION FAMILY directly.\n\nTHE GLOBAL GENERATING FUNCTION APPROACH:\n\nIn each vertex region V_i, Node 1.3 provides a smooth 1-parameter family of generating functions G_t^{(i)}(X) (t in [0,1]) with G_0^{(i)} = F_PL (giving K) and G_1^{(i)} = F_smooth^{(i)} (giving L). The Hamiltonian H_{v_i}(t, X, Y) = (d/dt)G_t^{(i)}(X) generates the flow.\n\nAlong each edge middle, Node 1.4 provides a 1-parameter family of profile curves gamma_t (t in [0,1]) with gamma_0 = V-shape and gamma_1 = gamma (smooth curve). Each gamma_t defines a Lagrangian surface L_t^{edge} = {(x_1, gamma_t(s), 0, gamma_{t,2}(s))} that is exactly Lagrangian for every t.\n\nSEQUENTIAL COMPOSITION WITH SMOOTH TIME REPARAMETRIZATION:\n\nLet rho: [0,1] -\u003e [0,1] be a smooth monotone function with rho(t) = 0 for t \u003c= 1/4 and rho(t) = 1 for t \u003e= 3/4, and rho^{(k)}(0) = rho^{(k)}(1) = 0 for all k \u003e= 1 (flat at endpoints — achievable by a standard smooth bump reparametrization).\n\nDefine the total time-dependent Hamiltonian:\nH(t, p) = rho'(t) * H_A(rho(t), p)  for t in [0, 1/2]   (Phase A, time-rescaled)\nH(t, p) = rho'(2t-1) * H_B(rho(2t-1), p)  for t in [1/2, 1]   (Phase B, time-rescaled)\n\nCORRECTION: This still has a jump at t = 1/2. The correct approach uses a SINGLE smooth partition of the time interval:\n\nLet alpha_A, alpha_B: [0,1] -\u003e [0,1] be smooth functions with:\n- alpha_A(t) = 0 for t \u003c= 0, alpha_A(t) = 1 for t \u003e= 1/2, alpha_A monotone.\n- alpha_B(t) = 0 for t \u003c= 1/2, alpha_B(t) = 1 for t \u003e= 1, alpha_B monotone.\n- alpha_A, alpha_B flat at all transition points (all derivatives zero at t = 0, 1/2, 1).\n\nDefine the global isotopy: for each t in [0,1], the surface L_t is obtained by:\n(1) In each vertex region V_i: apply the vertex generating function at parameter alpha_A(t). This gives Graph(dG_{alpha_A(t)}^{(i)}), which interpolates smoothly from K (at t=0) to L^{vert}_i (at t \u003e= 1/2).\n(2) Along each edge middle T_k: apply the edge profile at parameter alpha_B(t). This gives L_{alpha_B(t)}^{edge_k}, which interpolates smoothly from K (at t \u003c= 1/2) to L^{edge}_k (at t=1).\n\nThe crucial timing: Phase A completes (alpha_A = 1) before Phase B begins (alpha_B starts increasing at t = 1/2). At t = 1/2:\n- Vertex regions: L_{1/2} = L^{vert}_i (Phase A complete).\n- Edge middles: L_{1/2} = K (Phase B has not started).\n- Overlap: L^{vert}_i = L^{edge}_k (Step 5), and alpha_B(1/2) = 0 so the edge profile is still the V-shape... but wait, in the overlap, Phase A has already moved the surface to L^{vert}_i, which has a SMOOTH profile (not V-shape). When Phase B starts with the V-shape profile at alpha_B = 0, it expects K_A = K in the edge middle, which is correct outside the overlap. Inside the overlap, K_A = L^{vert}_i. Phase B should not modify K_A in the overlap.\n\nThis is handled by the longitudinal cutoff: Phase B's Hamiltonian chi_long * H_{e_k}^{transverse} is zero inside the overlap (chi_long = 0 there). So Phase B does not act in the overlap. Phase A has already produced L in the overlap.\n\nREVISED ISOTOPY: The sequential Hamiltonian flow proceeds as:\nPhase A (t in [0, 1/2]): flow of H_A (vertex Hamiltonians with disjoint supports). Produces K_A from K. At t = 1/2, K_A is smooth inside vertex balls, PL on edge middles.\nPhase B (t in [1/2, 1]): flow of H_B (edge Hamiltonians with disjoint supports). Each edge Hamiltonian H_{e_k}^{total} = chi_long * H_{e_k}^{transverse} where chi_long equals 1 on the edge middle proper (outside all extended vertex balls) and equals 0 inside vertex balls. The supports of H_{e_k}^{total} for different edges are pairwise disjoint (they are contained in the tubular neighborhoods T_k minus the vertex balls, which are pairwise disjoint). So the edge Hamiltonians commute: {H_{e_k}^{total}, H_{e_j}^{total}} = 0. The combined H_B = sum_k H_{e_k}^{total}.\n\nTIME SMOOTHNESS: The concatenated time-dependent Hamiltonian is:\nH(t) = 2 * alpha_A'(2t) * H_A(alpha_A(2t))    for t in [0, 1/2]\nH(t) = 2 * alpha_B'(2t-1) * H_B(alpha_B(2t-1))  for t in [1/2, 1]\n\nAt t = 1/2: from the left, H(1/2^-) involves alpha_A'(1) * H_A(1). Since alpha_A is flat at t=1 (all derivatives zero), alpha_A'(1) = 0, so H(1/2^-) = 0. From the right, H(1/2^+) involves alpha_B'(0) * H_B(0). Since alpha_B is flat at t=0, alpha_B'(0) = 0, so H(1/2^+) = 0. All higher time-derivatives also vanish at t = 1/2 (by flatness of alpha_A at 1 and alpha_B at 0). Therefore H(t) is smooth across t = 1/2.\n\nAt t = 0 and t = 1: similarly, alpha_A'(0) = 0 and alpha_B'(1) = 0 (flat). H(0) = 0, H(1) = 0. All time-derivatives vanish.\n\nThe total Hamiltonian H(t, p) is smooth in both t and p, and compactly supported in p (support contained in the union of vertex balls and edge tubular neighborhoods, which is a neighborhood of the 1-skeleton).\n\nTHE PHASE B LAGRANGIAN CONDITION: Phase B's Hamiltonian H_{e_k}^{total} = chi_long(x_1) * H_{e_k}^{transverse}(x_2, y_2) is a smooth function on R^4. Its Hamiltonian flow is a symplectomorphism (flow of any smooth Hamiltonian is). The flow preserves the symplectic form. However, the flow is applied to K_A, which on the edge middle is still PL (non-smooth). The image phi_1^{H_B}(K_A) needs to be verified as smooth and Lagrangian.\n\nON THE EDGE MIDDLE (where chi_long = 1): The surface K_A = K is the product of the x_1-line with the V-shape. The Hamiltonian H_{e_k}^{transverse} generates a flow in the (x_2, y_2)-plane that deforms the V-shape to the smooth curve gamma_1. The flow is constant in x_1 (since H_{e_k}^{transverse} does not depend on x_1). So the image is {(x_1, phi_1^{H_{e_k}^{transverse}}(V-point)) : ...} = {(x_1, gamma_1(s), 0, gamma_2(s))} = L^{edge}_k. This is smooth and Lagrangian.\n\nWHERE chi_long IS TRANSITIONING (0 \u003c chi_long \u003c 1): chi_long is identically 0 inside the extended vertex balls and identically 1 on the edge middle proper. We set chi_long to transition in a thin strip INSIDE the edge middle, between x_1 = delta_i + eta (vertex ball boundary) and x_1 = delta_i + eta + eta' for a small eta' \u003e 0. In this strip, K_A = K is PL. The flow of chi_long * H_{e_k}^{transverse} at these points partially resolves the V-shape.\n\nThe resulting surface at a point with longitudinal coordinate x_1 in the transition strip is:\n{(x_1, phi_1^{chi_long(x_1)*H}(V-point))} = {(x_1, gamma_{chi_long(x_1)}(s), 0, gamma_{chi_long(x_1),2}(s))}\nwhere gamma_{tau} is the profile at Hamiltonian time tau. This is a surface with x_1-DEPENDENT profile. The Lagrangian condition acquires the cross-term from Node 1.4, Step 6:\niota*(omega) = (partial_{x_1} gamma_1 * partial_s gamma_2 - partial_s gamma_1 * partial_{x_1} gamma_2) dx_1 ^ ds.\n\nFor the surface to be Lagrangian, this must vanish. The x_1-dependence comes from chi_long(x_1), so gamma(x_1, s) = gamma_{chi_long(x_1)}(s). The condition becomes:\nchi_long'(x_1) * (partial_tau gamma_1 * partial_s gamma_2 - partial_s gamma_1 * partial_tau gamma_2)|_{tau = chi_long(x_1)} = 0.\n\nThis does NOT vanish in general (chi_long' != 0 in the transition strip, and the Hamiltonian deformation generically has nonzero cross-bracket).\n\nTHE CORRECT RESOLUTION: Do NOT use a longitudinal cutoff on the Hamiltonian. Instead, use the following approach:\n\nPhase B's Hamiltonian for each edge is H_{e_k}^{transverse}(t, x_2, y_2), which is INDEPENDENT of x_1 and y_1, and compactly supported in (x_2, y_2). The flow phi_t^{H_{e_k}^{transverse}} moves points only in the (x_2, y_2)-plane.\n\nApply this flow to K_A. The result:\n- Inside vertex balls V_i: K_A = L^{vert}_i. In the cotangent coordinates, L^{vert}_i = Graph(dF_smooth). Near the edge, L^{vert}_i agrees with L^{edge}_k (the edge-smoothed surface) by Step 5. So phi_1^{H_{e_k}}(L^{vert}_i) near the edge is phi_1^{H_{e_k}}(L^{edge}_k) = phi_1^{H_{e_k}}({(x_1, gamma_1(s), 0, gamma_2(s))}).\n\nBut L^{edge}_k is the TIME-1 output. The flow phi_1^{H_{e_k}} applied to L^{edge}_k gives gamma_2 (the curve at Hamiltonian time 2), NOT gamma_1. This is wrong.\n\nTHE ISSUE: Inside the vertex balls, Phase A has already moved the surface from K (V-shaped profile) to L^{vert}_i (smooth profile matching gamma_1). If we then apply Phase B's full Hamiltonian flow (which moves V-shape to gamma_1), we get the flow applied to gamma_1, not to V-shape. The result is OVER-CORRECTION in the overlap.\n\nCORRECT RESOLUTION — PHASE B HAMILTONIAN IS ZERO IN VERTEX BALLS: We must ensure Phase B's Hamiltonian is zero inside the vertex balls. This requires a longitudinal cutoff. But a longitudinal cutoff breaks the Lagrangian condition (as shown above).\n\nTHE TRULY CORRECT APPROACH — GENERATING FUNCTION SURGERY WITHOUT HAMILTONIAN FLOW FOR PHASE B:\n\nWe abandon the Hamiltonian flow approach for Phase B and instead construct L directly (as in Steps 3-7 above) and prove the existence of a Hamiltonian isotopy from K to L abstractly.\n\nABSTRACT HAMILTONIAN ISOTOPY: L is a smooth embedded compact Lagrangian surface in (R^4, omega_std) that is C^0-close to K and agrees with K outside a neighborhood of the 1-skeleton. We claim there exists a compactly supported Hamiltonian isotopy from K to L.\n\nProof of isotopy existence: We use the parametric version of the h-principle for Lagrangian immersions (Gromov-Lees theorem) combined with the compactness of L.\n\nActually, a more elementary approach works: we construct the isotopy PIECEWISE, using the generating function families.\n\nPIECEWISE HAMILTONIAN ISOTOPY:\n\nStage 1 (Vertex smoothing, t in [0, 1/2]): Apply the sum of vertex Hamiltonians H_A = sum_i H_{v_i}. The result K_A = phi_1^{H_A}(K) is smooth inside vertex balls and PL outside. This is a well-defined smooth Hamiltonian isotopy (each H_{v_i} is smooth and compactly supported, they have disjoint supports).\n\nStage 2 (Edge smoothing, t in [1/2, 1]): We need a Hamiltonian isotopy from K_A to L that acts only along edge middles and is the identity inside vertex balls.\n\nIn each edge middle (in edge-adapted coordinates), K_A is the V-shape product {(x_1, V(s), 0)} and L is the smooth product {(x_1, gamma_1(s), 0, gamma_2(s))}. Both are constant-profile surfaces. The isotopy gamma_tau from V to gamma_1 defines a constant-profile Lagrangian isotopy. The Hamiltonian H_{e_k}(tau, x_2, y_2) generating this isotopy is independent of x_1, y_1 and compactly supported in (x_2, y_2).\n\nINSIDE THE VERTEX BALLS, K_A != K (it has been smoothed), and L^{vert}_i matches L^{edge}_k in the overlap. We need the Stage 2 flow to map K_A to L. Inside vertex balls, K_A = L^{vert}_i = L. So the Stage 2 flow should be the identity inside vertex balls.\n\nThe constant-profile Hamiltonian H_{e_k}(tau, x_2, y_2) generates a flow that moves points in the (x_2, y_2)-plane from the V-shape positions to the gamma_1 positions. Inside the vertex balls, the (x_2, y_2)-profile of K_A is ALREADY gamma_1 (from Phase A). The Hamiltonian flow would move these points further — OVER-CORRECTING.\n\nTHIS CONFIRMS THE NEED FOR A CUTOFF. We MUST have Phase B zero inside vertex balls. The way to handle the Lagrangian condition with a cutoff is:\n\nAPPROACH: Define a new surface L' via the Phase B flow WITH a longitudinal cutoff. L' will NOT be exactly Lagrangian in the transition strip (it will have a small symplectic error). Then use a WEINSTEIN NEIGHBORHOOD deformation to correct L' to a nearby exactly Lagrangian surface L''. We show L'' = L.\n\nActually, there is a much cleaner approach. We observe:\n\nOBSERVATION: The Phase B profile family gamma_tau (tau in [0,1]) satisfies gamma_0 = V-shape and gamma_1 = smooth curve. Inside the vertex balls (in the overlap), the Phase A output K_A has profile gamma_1 (matching the edge-smoothed surface). So the Phase B flow at tau=1 maps V-shape to gamma_1, and K_A already has gamma_1. If we apply the flow with a cutoff chi_long that is 0 inside the vertex ball:\n\nAt points inside the vertex ball: chi_long = 0, flow = identity, surface = K_A = L^{vert}_i (which already has profile gamma_1). Phase B leaves it as is.\n\nAt points on the edge middle: chi_long = 1, flow maps V-shape to gamma_1. Surface = L^{edge}_k.\n\nIn the transition strip: chi_long goes from 0 to 1. K_A = K (PL with V-shape) in this strip (if the strip is outside the vertex ball). The flow with chi_long(x_1) * H gives the profile gamma_{chi_long(x_1)}, which interpolates from V-shape to gamma_1. The surface has x_1-dependent profile.\n\nTHE LAGRANGIAN ISSUE: This x_1-dependent profile is NOT exactly Lagrangian (cross-term nonzero). However, we can fix this by choosing the profile family gamma_tau to satisfy the REPARAMETRIZATION CONDITION from Node 1.4, Step 6:\n\nIf gamma_tau(s) = gamma_1(sigma(tau, s)) for a smooth family of reparametrizations sigma(tau, -), then the x_1-dependent surface {(x_1, gamma_{chi_long(x_1)}(s), 0, ...)} = {(x_1, gamma_1(sigma(chi_long(x_1), s)), 0, ...)}. Writing u = sigma(chi_long(x_1), s), the surface is {(x_1, gamma_1(u), 0, gamma_2(u))} with u depending on (x_1, s). This is a reparametrization of the constant-profile surface, which IS Lagrangian (the pullback of omega depends only on the parametrized surface, not on the choice of parametrization; changing from (x_1, s) to (x_1, u) preserves omega|_L = 0 if the Jacobian is nondegenerate).\n\nWait, this is not correct — changing the parametrization does NOT change the underlying surface, so the Lagrangian condition depends on the SURFACE, not the parametrization. If the underlying surface is {(x_1, gamma_1(u), 0, gamma_2(u)) : x_1 in R, u in R} with u independent of x_1, then it IS the constant-profile surface and IS Lagrangian. But if u depends on x_1 (as u = sigma(chi_long(x_1), s)), the surface is NOT the constant-profile surface — it is a surface where the x_2, y_2 coordinates depend on both x_1 and s.\n\nHowever, if gamma_tau(s) = gamma_1(sigma(tau, s)), then the IMAGE of the surface {(x_1, gamma_{chi_long(x_1)}(s), 0, ...)} = {(x_1, gamma_1(sigma(chi_long(x_1), s)), 0, ...)}. As (x_1, s) ranges over R^2, the point (x_1, gamma_1(sigma(chi_long(x_1), s))) traces out {(x_1, gamma_1(u)) : x_1 in R, u in R} = {(x_1, gamma_1(u)) : u in R} x R. If sigma(tau, -) is a diffeomorphism of R for each tau, then as s ranges over R, u = sigma(chi_long(x_1), s) also ranges over R. So the IMAGE is the same as the constant-profile surface {(x_1, gamma_1(u), 0, gamma_2(u))} for all x_1. This IS the constant-profile surface, and IS Lagrangian.\n\nSo the approach works: define the isotopy family gamma_tau as reparametrizations of the final curve gamma_1. Specifically:\n\nREPARAMETRIZATION FAMILY: Let gamma_0 (V-shape) and gamma_1 (smooth curve) be the endpoint profiles. Define a family of diffeomorphisms sigma_tau: R -\u003e R (tau in [0,1]) such that gamma_tau := gamma_1 o sigma_tau interpolates from gamma_0 = gamma_1 o sigma_0 to gamma_1 = gamma_1 o sigma_1 where sigma_1 = id.\n\nFor this to work, gamma_0 must be a reparametrization of gamma_1, i.e., there must exist a homeomorphism sigma_0: R -\u003e R such that gamma_0 = gamma_1 o sigma_0. Since gamma_0 (V-shape: two rays meeting at a corner) and gamma_1 (smooth curve) trace the SAME SET in the (x_2, y_2)-plane (both connect the same two rays, differing only near the corner), a reparametrization sigma_0 exists as a HOMEOMORPHISM. But gamma_0 has a corner, so sigma_0 is not smooth (gamma_1 is smooth, gamma_0 = gamma_1 o sigma_0 has a corner, so sigma_0 must be non-smooth at the preimage of the corner).\n\nThis means the reparametrization approach does not work for the FULL deformation from V-shape to smooth curve, because the V-shape and smooth curve are not smooth reparametrizations of each other.\n\nFINAL CORRECT APPROACH — NO LONGITUDINAL CUTOFF, COMMUTING PHASES:\n\nWe revisit the phase structure. The problem with simultaneous phases was that edge Hamiltonians from different edges overlap inside vertex balls. But we can avoid this by choosing the Phase B Hamiltonians to be zero inside vertex balls WITHOUT a longitudinal cutoff:\n\nPHASE B HAMILTONIAN CONSTRUCTION: For each edge e_k, the constant-profile Hamiltonian H_{e_k}(t, x_2, y_2) is zero wherever the V-shape profile already equals the smooth profile. Inside the vertex balls, Phase A has changed the surface so that it already has the smooth profile. But Phase B's Hamiltonian is defined in terms of the (x_2, y_2)-plane ONLY — it moves points from V-shape positions to smooth-curve positions. At points where the surface is already at the smooth-curve position, the Hamiltonian flow has no effect (the surface is already at the target).\n\nWait — the Hamiltonian H_{e_k}(t, x_2, y_2) generates a fixed flow in the (x_2, y_2)-plane that deforms the V-shape to the smooth curve. This flow moves ALL points in the (x_2, y_2)-plane, not just points on the V-shape. If the surface is at the smooth-curve position (inside the vertex ball, from Phase A), the flow would move these points FURTHER, overshooting.\n\nUnless: the Hamiltonian flow at time 1 is the IDENTITY on the smooth curve gamma_1. That is, gamma_1 is a FIXED POINT of the time-1 map phi_1^{H_{e_k}}. This would mean:\nphi_1^{H_{e_k}}(gamma_1(s)) = gamma_1(s) for all s.\n\nThis is NOT generally true. The time-1 map phi_1^{H_{e_k}} maps gamma_0 to gamma_1, but it also moves points not on gamma_0.\n\nHOWEVER, we can construct H_{e_k} so that phi_1^{H_{e_k}} is the identity OUTSIDE a small neighborhood of the V-shape in the (x_2, y_2)-plane. Since the smooth curve gamma_1 is separated from the V-shape corner (gamma_1 avoids the origin), for a sufficiently small neighborhood of the V-shape near the corner, gamma_1 lies OUTSIDE this neighborhood. Then phi_1^{H_{e_k}} = id on gamma_1.\n\nBut gamma_1 DOES agree with the V-shape for |s| \u003e= T (it coincides with the rays). At these points, gamma_1 is ON the V-shape, so phi_1^{H_{e_k}} moves these points. If phi_1 maps V-shape points to gamma_1 points, and for |s| \u003e= T the V-shape and gamma_1 agree, then phi_1 maps these points to themselves. So phi_1 is the identity on gamma_1 for |s| \u003e= T.\n\nFor |s| \u003c T and s away from the corner: gamma_1 is smooth and separated from the V-shape by a positive distance. We can arrange H_{e_k} to be zero in a neighborhood of gamma_1 for |s| \u003c T (by making the support of H_{e_k} very close to the V-shape corner). Then phi_1 = id on gamma_1 for all s.\n\nTHIS WORKS. Here is the precise construction:\n\nThe V-shape gamma_0 has a corner at s = 0 (the origin in the (x_2, y_2)-plane). The smooth curve gamma_1 avoids the origin: gamma_1(0) is at distance r \u003e 0 from the origin. The difference gamma_1 - gamma_0 is nonzero only for |s| \u003c T (for |s| \u003e= T, both agree with the rays).\n\nThe Hamiltonian flow phi_tau^{H_{e_k}} deforms the V-shape gamma_0 to the smooth curve gamma_1. We can choose H_{e_k} so that the flow has support concentrated near the V-shape corner: supp(H_{e_k}) subset {(x_2, y_2) : |(x_2, y_2)| \u003c 2r, |s| \u003c T} (a compact set in the (x_2, y_2)-plane containing the V-shape corner but not intersecting gamma_1 for |s| \u003c T, since gamma_1(s) has |(x_2,y_2)| \u003e= r for |s| \u003c T).\n\nWith this choice, phi_tau^{H_{e_k}}(gamma_1(s)) = gamma_1(s) for ALL s and all tau. In particular, applying Phase B to K_A:\n- Inside vertex balls: K_A has profile gamma_1 (from Phase A). Phase B flow = identity on gamma_1. Surface unchanged.\n- On edge middle: K_A has profile gamma_0 (V-shape). Phase B flow maps gamma_0 to gamma_1. Surface smoothed.\n\nThis resolves the over-correction problem WITHOUT a longitudinal cutoff.\n\nDISJOINT SUPPORT FOR DIFFERENT EDGES: For different edges e_k, e_j, the Phase B Hamiltonians H_{e_k}, H_{e_j} live in DIFFERENT (x_2, y_2)-planes (each edge has its own adapted coordinate system). In global R^4 coordinates, H_{e_k} is supported near the corner of edge e_k (in the transverse plane to e_k) and H_{e_j} near the corner of edge e_j. If the edge tubular neighborhoods T_{epsilon_k}(e_k) and T_{epsilon_j}(e_j) are disjoint (ensured by Step 1), then supp(H_{e_k}) and supp(H_{e_j}) are disjoint. So all edge Hamiltonians commute and can be summed.\n\nInside vertex balls, where multiple edges meet: each H_{e_k} has support near the V-shape corner of edge e_k. The different V-shape corners (for 4 edges emanating from a vertex) are in different symplectic directions. If the support radii are chosen small enough (much smaller than the angles between edges), the supports are disjoint even inside the vertex ball. This is possible because the 4 edges emanate from the vertex in 4 linearly independent directions in R^4, so their transverse planes intersect only at the vertex. For points away from the vertex (which is the case everywhere in the supports of H_{e_k} since the support excludes a neighborhood of the origin), the supports of different edge Hamiltonians are disjoint.\n\nCOMBINING PHASES A AND B:\n\nPhase A: H_A = sum_i H_{v_i} (vertex Hamiltonians, pairwise disjoint supports).\nPhase B: H_B = sum_k H_{e_k} (edge Hamiltonians, pairwise disjoint supports, AND Phase B flow is the identity on the Phase A output).\n\nSince Phase B is the identity on L^{vert}_i (the Phase A output inside vertex balls), and Phase A is the identity outside vertex balls, the two flows COMMUTE:\n{H_A, H_B} = 0\nbecause at any point, at most one of H_A, H_B is nonzero. (Inside vertex balls, H_B might be nonzero near edge corners, and H_A is also nonzero. But H_B's FLOW is the identity on K_A inside vertex balls, which means H_B = 0 on the image of K_A inside vertex balls. More carefully: H_B as a function on R^4 may be nonzero inside vertex balls, but its flow leaves the surface K_A invariant there.)\n\nCORRECTION: The Poisson bracket {H_A, H_B} depends on the FUNCTIONS H_A, H_B on R^4, not on their effects on the surface. Even if H_B has no effect on K_A inside vertex balls, {H_A, H_B} could be nonzero.\n\nSo we CANNOT apply Phase A and Phase B simultaneously. We use the sequential composition with smooth time reparametrization:\n\nLet rho_A: [0,1] -\u003e [0,1] be smooth, rho_A(t) = 0 for t \u003c= 0, rho_A(t) = 1 for t \u003e= 1/2, monotone, flat at 0 and 1/2.\nLet rho_B: [0,1] -\u003e [0,1] be smooth, rho_B(t) = 0 for t \u003c= 1/2, rho_B(t) = 1 for t \u003e= 1, monotone, flat at 1/2 and 1.\n\nDefine the total time-dependent Hamiltonian:\nH_{total}(t, p) = rho_A'(t) * H_A(rho_A(t), p) + rho_B'(t) * H_B(rho_B(t), p).\n\nSince rho_A'(t) = 0 for t \u003e= 1/2 and rho_B'(t) = 0 for t \u003c= 1/2, at any time t, at most one of the two terms is nonzero. So there is no Poisson bracket issue: the flow of H_total for t in [0, 1/2] is purely Phase A, and for t in [1/2, 1] is purely Phase B.\n\nAt t = 1/2: rho_A'(1/2) = 0 (flat) and rho_B'(1/2) = 0 (flat), so H_{total}(1/2, p) = 0. All t-derivatives of H_{total} vanish at t = 1/2 (by flatness of rho_A at 1/2 and rho_B at 1/2). H_{total} is smooth across t = 1/2.\n\nAt t = 0: rho_A'(0) = 0 (flat), rho_B'(0) = 0. H_{total}(0) = 0. Smooth at t = 0.\nAt t = 1: rho_A'(1) = 0, rho_B'(1) = 0 (flat). H_{total}(1) = 0. Smooth at t = 1.\n\nThe flow phi_t^{H_{total}} is a smooth Hamiltonian isotopy with:\nphi_0 = id, phi_{1/2} = phi_1^{H_A}, phi_1 = phi_1^{H_B} o phi_1^{H_A}.\n\nAt t = 1: phi_1(K) = phi_1^{H_B}(phi_1^{H_A}(K)) = phi_1^{H_B}(K_A) = L.\n\n(phi_1^{H_B}(K_A) = L because: on edge middles, Phase B maps V-shape to gamma_1, giving L^{edge}_k = L; inside vertex balls, Phase B is the identity on K_A = L^{vert}_i = L; on face interiors, both phases are the identity, K_A = K = L.)\n\nCOMPACT SUPPORT: supp(H_{total}) subset (union_i V_i) cup (union_k supp(H_{e_k})) subset neighborhood of 1-skeleton.\n\nSTEP 11 (NON-COMPACT EXTENSION — REMARK). The problem specifies a FINITE polyhedral complex, which is compact. For completeness: if K were a locally-finite (non-compact) polyhedral Lagrangian surface, the same construction applies locally. The Hamiltonians form a locally finite family (any compact set meets finitely many vertex balls and edge neighborhoods). The sum H_A = sum_i H_{v_i} is a locally finite sum of smooth functions, hence smooth. Completeness of the Hamiltonian flow requires uniform bounds on the H_{v_i} (guaranteed if the vertex geometry is uniformly bounded). Edges extending to infinity receive a constant-profile smoothing with non-compact support in x_1 but compact support in (x_2, y_2).\n\nSTEP 12 (SUMMARY). The global assembly proceeds as:\n(1) Choose disjoint extended vertex balls V_i = B_{delta_i+eta}(v_i) and edge tubular neighborhoods (Steps 1-2).\n(2) Construct L directly: inside vertex balls, L = Graph(dF_smooth^{(i)}) (Node 1.3 two-zone construction); on edge middles, L = constant-profile smoothing {(x_1, gamma(s), 0, gamma_2(s))} (Node 1.4); on face interiors, L = K.\n(3) Verify overlap matching: in the overlap strips (where vertex balls meet edge middles), Node 1.3's angular interpolation profile equals Node 1.4's profile curve gamma (Step 5). Choose gamma to match Node 1.3's output.\n(4) L is smooth everywhere (Step 7), Lagrangian everywhere (Step 8: generating function argument in vertex regions, constant-profile argument on edges, flat planes on faces), and embedded (Step 9).\n(5) Hamiltonian isotopy: Phase A (vertex Hamiltonians, disjoint supports, simultaneous flow) followed by Phase B (edge Hamiltonians, disjoint supports, simultaneous flow, identity on Phase A output). Smooth time reparametrization with flat transition at t=1/2 gives a smooth Hamiltonian on [0,1] x R^4 (Step 10). The total Hamiltonian is compactly supported near the 1-skeleton.\n\nEND OF PROOF.","owner":"prover-1.5"}